{
    "title": "SNS Vračar o predizbornim neregularnostima: Građani treba da znaju na kakve je prevare spreman deo opozicije",
    "timestamp": "2024-05-14T19:24:17+02:00",
    "content": "Shutterstock Opštinski odbor Vračar Srpske napredne stranke (SNS) saopštio je danas, povodom odluke Opštinske izborne komisije (OIK) gradske opštine Vračar koja je odbacila listu \"Dr Savo Manojlović i ja sam Vračar - Kreni-promeni\" zbog nepoštovanja propisa o zastupljenosti polova, ali i zbog nedovoljnog broja potpisa, da građani mogu još jednom da se uvere na kakve su sve prevare spremni predstavnici opozicionih lista. \"Proverom podnete izborne liste utvrđeno je da nisu poštovana zakonska pravila o zastupljenosti polova na izbornoj listi propisana odredbom člana 41. Zakona o lokalnim izborima. Ovaj član propisuje da na izbornoj listi mora da bude najmanje 40 odsto pripadnika manje zastupljenog pola tako da među svakih pet kandidata po redosledu na listi moraju biti tri pripadnika jednog i dva pripadnika drugog pola. Prema zaključku OIK ovo predstavlja neotklonjiv nedostatak izborne liste iz člana 77. Zakona o izboru narodnih poslanika, usled kojeg se ne može doneti zaključak kojim bi se naložilo otklanjanje navedenog nedostatka\", navodi se u saopštenju vračarskog SNS. Preporučujemo Vučević sa ambasadorom Francuske o saradnji i poziciji Srbije po pitanju KiM Koalicija \"Biramo\" traži da se proglase sve opozicione liste U saopštenju se dodaje da su za \"obaranje\" liste bili i predstavnici liste \"Biramo Vračar - Miloš Pavlović\", koju čine stranke Zeleno-levi front/Ne davimo Beograd, Narodni pokret Srbije, Demokratska stranka, Ekološki ustanak-Ćuta, Pokret slobodnih građana i Novo lice Srbije. Pored navedenog, jedan od razloga je i što je dostavljen manji broj od potrebnog broja potpisa građana. \"Ovom prilikom navodimo da je, što se tiče liste \"Biramo Vračar\" stigao prigovor više birača, jer je devet ljudi na listi prijavljeno na Vračaru posle 3. jula 2023. godine, od kojih sedam osoba tokom ove godine, a jedna osoba 3. maja ove godine,neposredno pred predaju pomenute liste\", navodi se u saopštenju. Narodni poslanik Aleksandar Ivanović prijavljen je 15. aprila ove godine na Vračaru da bi mogao da bude kandidat liste \"Biramo Vračar\" na lokalnim izborima na Vračaru, dodaje se u saopštenju. \"Isto tako, javnost treba da zna da su po pitanju liste 'Biramo Vračar', četiri osobe prijavljene na istoj adresi Vojvode Šupljikca 24b, a na toj adresi ne živi niko. Oni su prijavljeni januara ove godine. Opoziciona lista Save Manojlovića 'Kreni pokreni' ima dvoje novih doseljenika na Vračar od kojih je jedan doseljen iz Nove Vroši kako bi bio kandidat na izborima na Vračaru. Podsećamo, da su za odbijanje liste Save Manojlovića glasali opozicioni članovi OIK-a\", dodaje se u saopštenju. Opštinski odbor SNS dodaje da je sve navedeno još jedan dokaz da je opozicija prijavljivala fantomske birače na teritoriji Vračara i da za sve to neopravdano optužuju SNS. \"Građani treba još jednom da se uvere na kakve su sve prevare spremni predstavnici opozicionih lista. Izborne komisije su nezavisne i rade po zakonu. Verujemo da će komisije kao i sudovi koji su nezavisni pravilno ceniti odluke komisije i žalbe. Ostaće upamćeno da su opozicione stranke tražile da zakon koji su sami predložili i koji važi za sve - ne važi za njih!? Da narod zna kako bi ti ljudi sutra vodili opštinu ili grad a izbornu listu ne znaju da predaju bez kršenja zakona\", zaključuje se u saopštenju SNS Vračar. (Telegraf.rs)"
}