{"title": "UAH honors faculty, staff, researchers with 2024 University Awards for Excellence", "timestamp": "\"2024-06-10 08:00:18\"", "content": ["Michael Mercier | UAH", "The University of Alabama in Huntsville (UAH) recognized outstanding achievements of its faculty, staff members and researchers during the 2024 University Awards for Excellence ceremony on April 26. UAH is a part of The University of Alabama System.", "Laurel Long, associate vice president, human resources, described the honorees as “individuals who exemplify commitment, consistency, hard work and resilience.”", "“They take quality service to its highest level,” she said, “and they ensure that The University of Alabama in Huntsville maintains its vision and high standards within higher education.”", "Congratulations to all of the honorees for their dedication and service:", "UAH Foundation Staff Awards", "Facilities Excellence Award – Jeremy Mitchell, HVAC controls technician, Facilities and Operations Administrative Services", "Staff Excellence Awards – Rae Gill, senior staff assistant, Department of Kinesiology, and Drew Yarbrough, marketing and events manager, College of Business", "Staff Leadership Excellence Award – Amber Adcock, senior associate registrar, Office of the Registrar", "Graduate Awards", "Graduate Mentor Award – Dr. Darlene Showalter, clinical associate professor, College of Nursing", "Research and Creative Activity Undergraduate Mentor Award – Dr. Ryan Conners, associate professor and chair, Department of Kinesiology", "College Outstanding Faculty", "College of Arts, Humanities and Social Sciences – Dr. Nicole Pacino, associate professor, Department of History", "College of Business – Dr. Natalie Malak, assistant professor, Department of Economics", "College of Education – Dr. Dana Skelley, assistant professor, curriculum and instruction", "College of Engineering – Dr. Guangsheng Zhang, assistant professor, Department of Mechanical and Aerospace Engineering", "College of Nursing – Dr. Donna Guerra, clinical associate professor of nursing and Bachelor of Science in Nursing program coordinator", "College of Science – Dr. Paul Wolf, professor and chair, Department of Biological Sciences", "University Distinguished Teaching Award", "Beth Allen, senior lecturer of computer science, College of Science", "University Distinguished Research, Creative Achievement, and Scholarly Performance Award", "Dr. Bryan Mesmer, associate professor, Department of Industrial and Systems Engineering and Engineering Management", "University Researcher of the Year Award", "Mark Zwiener, manager, range operations, Aerophysics Research Center", "Photo gallery for 2024 University Awards for Excellence"]}