{"title": "The Hollow Earth Theory", "timestamp": "\"2024-06-13 16:51:00\"", "content": ["One can never be sure just how serious they are about it, but there does exist a group of people who call themselves the \"Flat-Earth Society\" (remember the news item about the old gentleman who was invited to Cape Kennedy to watch an Apollo moon launch, but came away convinced that it was all a hoax?). There is another group, equally vocal, who believe that the earth is hollow. Several years ago, a group of \"believers\" informed a member of the Geophysical Institute staff that there was an opening to the center of the earth in the Alaska Range, and that this was an entry and exit point for flying saucers.", "Modern-day proponents of the hollow earth theory can refer nonbelievers to the book The Hollow Earth (Bell Publishing Company, 1979) by Raymond Bernard. Bernard, judging from the initials he lists behind his name, holds just about every advanced academic degree, but is apparently somewhat of a recluse. As a spokesman for the publisher states in a foreword to the book, \"I will not enter into any correspondence regarding this book--or the author. Whether you accept or reject the content of this book is your privilege. No one cares.\"", "The crux of the hollow earth theory is that the earth is a shell with walls about 800 miles thick. In the polar regions there are holes 1400 miles across, with edges that curve smoothly from the outside of the shell around to the inside. A sea or surface traveler could proceed over an edge of the hole, like an ant crawling over the lip of a coffee mug from the outside to the inside, and not be aware that he was actually entering the interior of the earth. Bernard explains that the holes have never been seen from the air because pilots are fooled by their compasses into believing that they are crossing the pole, when they are actually following the hole's \"magnetic rim\". Thus aircraft never really fly over the geographic poles, which naturally mark the centers of the holes themselves. As irrefutable proof of his claim, he cites Admiral Byrd's statement, \"I'd like to see that land beyond the Pole. That area beyond the Pole is the Great Unknown.\"", "The hollow earth theory actually seems to have been originated in the early 1800s by John Symmes, an earnest American who devoted the greater part of his later life to convincing the world that the earth was formed by a series of concentric shells.", "Symmes believed that there were miles of wondrous unclaimed domain beneath our feet, with lush vegetation and fish and game for the taking. Apparently, there were those who took him seriously. As reported in the October 1882 issue of Harper's New Monthly Magazine, a Mr. Howgate had recently been in the news, proposing that an expedition be made to discover \"Symmes' Hole.\" His plan was to have a number of men acclimate themselves to higher and higher latitudes, moving further north each year. They were to observe the animals that presumably wintered over within the earth each year and emerged during the spring to bear young. Eventually, the colony of men were to follow the animals in the fall to find where they entered into that marvelous land at the center of the earth.", "Sadly for this romantic concept, if today's believers are correct, the only thing that they would find there now are flying saucers."]}