{"title": "Wildfire experts provide guidance for new research directions", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["As wildfires cause increasing devastation worldwide, dozens of fire experts across the nation are joining together in calling for a more strategic and interdisciplinary approach to pursuing wildfire research and protecting vulnerable communities.", "A new study, led by a scientist at the National Center for Atmospheric Research (NCAR) and co-authored by 86 other fire experts from a breadth of disciplines, highlights the obstacles for fire science and provides guidance for investing in future research. The commentary is a follow-up to a five-day innovation lab, sponsored by the U.S. National Science Foundation (NSF), that brought together diverse research communities in May 2021 to develop a roadmap for new research directions.", "Published in the Proceedings of the National Academy of Sciences (PNAS) Nexus journal, the study outlines five key challenges to advance the study of fire. These range from promoting coordinated research to drawing on diverse sources of knowledge.", "“We need to develop a proactive fire research agenda that helps create safe communities and ecosystems,” said NCAR scientist Jacquelyn Shuman, the lead author. “This requires a more cross-disciplinary approach and building diverse partnerships to make better use of the knowledge that exists.”", "The scientists are making their recommendations at a time when wildfires pose an increasing global risk, spurred largely by climate change, generations of fire suppression, and more development in the wildland-urban interface. Recent decades have seen a substantial increase in the length of fire season as far north as the Arctic, as well as intense conflagrations from the Pantanal tropical wetland in South America to the peatlands of tropical Asia. In the western United States, warmer and drier conditions have spurred fires that have burned nearly twice the area in the 21st century compared with the late 20th century.", "Despite the growing wildfire destruction, the authors emphasize fire is a fundamental part of ecosystems globally, and it has been used by society to manage landscapes for millennia.", "The innovation lab motivating this commentary was funded by NSF, which is NCAR’s sponsor.", "Major research advances", "Using increasingly advanced observing systems, field campaigns and computer models, scientists have made major strides in better understanding and anticipating wildfire behavior, as well as the effects of smoke on air quality. However, such advances have often been made in isolation, instead of being incorporated into a comprehensive and holistic understanding of the causes and impacts of fires.", "Recognizing the need for a more convergent approach, the innovation lab last year brought together experts at federal agencies and universities. They represented fields ranging from ecology, forestry and anthropology to geomorphology, hydrology, and computer science, among others.", "The five challenges outlined in the paper, which built on those discussions, are:", "Integrate across disciplines by promoting coordination among physical, biological, and social sciences. Fire research currently is siloed within disciplines such as forestry, atmospheric chemistry, and others, but wildfire is a biophysical and social phenomenon that cannot be understood with any single disciplinary lens.", "Embrace different ways of knowing and knowledge generation to identify resilience pathways. Humans from diverse groups and perspectives, including indigenous peoples of tribal nations, can provide scientists with invaluable insights into fire.", "Use fire as a lens to address fundamental science questions. Fire is such an ancient and pervasive phenomenon that it can be used to help gain new insights into a range of sciences, including ecology and evolutionary biology, the evolution of Homo sapiens, and social dynamics.", "Capitalize on the “firehose” of data to support community values. With more data now available to study fire in the biosphere than ever before, scientists need funding to harness the data revolution and aid our understanding of fire.", "Develop coupled models that include human dimensions to better anticipate future fire. To better anticipate future fire activity and its impacts, scientists need to develop more advanced computer modeling systems that incorporate both the human and non-human dimensions of fire.", "“We have far more information about fires than before, but we need increased funding and better coordination to deploy it on a global scale,” Shuman said. “This will enable us to be more proactive as we work to help society and ecosystems become more resilient to the increasing risk of fires.”", "About the article", "Title: “Reimagine Fire Science for the Anthropocene”", "Journal: Proceedings of the National Academy of Sciences (PNAS) Nexus", "Authors: Jacquelyn K Shuman, Jennifer K Balch, Rebecca T Barnes, Philip E Higuera, Christopher I Roos, Dylan W Schwilk, E Natasha Stavros, Tirtha Banerjee, Megan M Bela, Jacob Bendix, Sandro Bertolino, Solomon Bililign, Kevin D Bladon, Paulo Brando, Robert E Breidenthal, Brian Buma, Donna Calhoun, Leila M V Carvalho, Megan E Cattau, Kaelin M Cawley, Sudeep Chandra, Melissa L Chipman, Jeanette Cobian-Iñiguez, Erin Conlisk, Jonathan D Coop, Alison Cullen, Kimberley T Davis, Archana Dayalu, Fernando De Sales, Megan Dolman, Lisa M Ellsworth, Scott Franklin, Christopher H Guiterman, Matthew Hamilton, Erin J Hanan, Winslow D Hansen, Stijn Hantson, Brian J Harvey, Andrés Holz, Tao Huang, Matthew D Hurteau, Nayani T Ilangakoon, Megan Jennings, Charles Jones, Anna Klimaszewski-Patterson, Leda N Kobziar, John Kominoski, Branko Kosovic, Meg A Krawchuk, Paul Laris, Jackson Leonard, S Marcela Loria-Salazar, Melissa Lucash, Hussam Mahmoud, Ellis Margolis, Toby Maxwell, Jessica L McCarty, David B McWethy, Rachel S Meyer, Jessica R Miesel, W Keith Moser, R Chelsea Nagy, Dev Niyogi, Hannah M Palmer, Adam Pellegrini, Benjamin Poulter, Kevin Robertson, Adrian V Rocha, Mojtaba Sadegh, Fernanda Santos, Facundo Scordo, Joseph O Sexton, A Surjalal Sharma, Alistair M S Smith, Amber J Soja, Christopher Still, Tyson Swetnam, Alexandra D Syphard, Morgan W Tingley, Ali Tohidi, Anna T Trugman, Merritt Turetsky, J Morgan Varner, Yuhang Wang, Thea Whitman, Stephanie Yelenik, Xuan Zhang"]}