{"title": "Michael Mosley tribute show remembers TV doctor who ‘demystified science’ for nation", "timestamp": "\"2024-06-14 20:10:33\"", "content": ["The beloved TV personality and doctor Michael Mosley, who tragically passed away while on holiday in Greece, was honoured in an emotional BBC show tonight (Friday).", "Mosley, 67, sadly died while holidaying with his spouse Dr Clare Bailey on the idyllic Greek island of Symi earlier in the month. His disappearance came after he embarked on a walk at 1.30pm on Wednesday June 5, only to be discovered days later on Sunday near Agia Marina beach.", "A TV special titled Michael Mosley: The Doctor Who Changed Britain aired on BBC One at 8pm in his memory and highlighted Mosley's extensive broadcasting career and his transformative impact on people's lives through science.", "READ MORE: Tragedy as worker dies after police called to Greggs' Manchester factory", "The BBC special featured a number of Mosley’s hit broadcast programmes which saw him embrace self-experimentation.", "Clips from Pain, Pus And Poison saw him put a needle through his anaesthetised hand, while in Guts: The Strange And Mysterious World Of The Human Stomach, he swallowed a camera to film his lunch digesting while spending the day at the Science Museum.", "He turned his body into a “living laboratory” in BBC Four documentary Infested: Living With Parasites.", "In a clip from the programme which featured on the tribute show, Mosley said: “The time has come to give myself tapeworm. I’m feeling mildly apprehensive. Well, I think I’m confident that it should be safe.", "“It is very strange thought that there are millions of people who are infected by parasites who don’t want to be, and I’m about to deliberately infect myself, but, I hope it’s not something I’m going to regret. Here we go.”", "Mosley also demonstrated the nutritious value of blood in 2015 documentary titled The Wonderful World Of Blood by making two black puddings out of his own blood.", "“Millions of us will know Michael Mosley as a TV doctor who opened our eyes to a healthier way of life,” TV doctor Hannah Fry narrates.", "“Michael was an endless source of inspiration, helping us live life that little bit better. Changing the health habits of a nation.”", "Mosley first trained as a doctor before moving into the world of broadcasting, joining the BBC “on a whim”.", "He began his career on popular science show Tomorrow’s World but it was a 1994 edition of the flagship science series Horizon that was the turning point in his career, with the Ulcer Wars documentary.", "A defining moment also came on Horizon: Eat, Fast And Live Longer, where Mosley discovered a third of his body was fat and he embraced the idea of fasting.", "Fry says: “Michael set out on a journey of discovery that would change not only his life, but the health habits of the nation.”", "Mosley is credited with popularising the 5:2 diet, a form of intermittent fasting, through his book The Fast Diet, and later advocated for The Fast 800 diet, which follows a “moderately low-carb, Mediterranean-style diet”.", "He later did a Horizon: The Truth About Sleep special where he discovered whether helping his gut had improved his sleep.", "In 2013, he joined BBC series Trust Me, I’m A Doctor and during the pandemic, he began Radio 4’s Just One Thing with each episode featuring a health tip.", "The BBC television tribute concluded saying that Mosley had touched “millions of lives in the most modest of ways”.", "“He made a difference to people’s lives, changing the way we see ourselves, our health and our wellbeing.", "“And in doing that for so many people and for so many years he leaves Britain for the better,” Fry added.", "Viewers were quick to praise the show on social media with many paying tribute to Mosley.", "Posting on X Conor Patrick Jackson said: “I can say with certainty that the BBC One tribute to Michael Mosley did the man justice. It's so sad to know we'll not see him on television again. He was effortlessly entertaining and wise.”", "Rev wrote: “Just watched BBC1’s Michael Mosley: The Doctor Who Changed Britain - very emotional, close to tears. How could such a wonderful man be taken so soon. I miss him though I never met him - as if he was a friend & comforting presence in this mad world. Thoughts with his family.”", "Clare added: “Just watched the lovely tribute to @MichaelMosley. I think I took for granted what an incredible man he was. I hope these tributes eventually bring some comfort to his wife and children. So sad.”", "Echoing their comments, Mike Armitage said : “I watched the programme made as a tribute to #michaelmosley on @BBCOne this evening. He was in many ways a very ordinary man but what he did was really extraordinary. I looked up to him and I cannot believe he’s gone.”"]}