{"title": "BBC reflects on career of Michael Mosley who ‘demystified science’ for nation", "timestamp": "\"2024-06-14 22:18:16\"", "content": ["A BBC special has remembered TV doctor Michael Mosley, whose trailblazing style of self-experimentation in the name of science changed “the health habits of a nation”.", "The broadcaster and columnist died of natural causes last week aged 67 after he went missing on the Greek island of Symi.", "Michael Mosley: The Doctor Who Changed Britain aired on Friday on BBC One and featured a number of his hit broadcast programmes which saw him embrace self-experimentation.", "Clips from Pain, Pus And Poison saw him put a needle through his anaesthetised hand, while in Guts: The Strange And Mysterious World Of The Human Stomach, he swallowed a camera to film his lunch digesting at the Science Museum.", "He turned his body into a “living laboratory” in BBC Four documentary Infested: Living With Parasites.", "In a clip from the programme which featured on the tribute show, Mosley said: “The time has come to give myself tapeworm. I’m feeling mildly apprehensive. Well, I think I’m confident that it should be safe.", "“It is very strange thought that there are millions of people who are infected by parasites who don’t want to be, and I’m about to deliberately infect myself, but, I hope it’s not something I’m going to regret. Here we go.”", "Mosley also demonstrated the nutritious value of blood in 2015 documentary titled The Wonderful World Of Blood by making two black puddings out of his own blood.", "“Millions of us will know Michael Mosley as a TV doctor who opened our eyes to a healthier way of life,” TV doctor Hannah Fry narrates.", "“Michael was an endless source of inspiration, helping us live life that little bit better. Changing the health habits of a nation.”", "Mosley first trained as a doctor before moving into the world of broadcasting, joining the BBC “on a whim”.", "He began his career on popular science show Tomorrow’s World but it was a 1994 edition of the flagship science series Horizon that was the turning point in his career, with the Ulcer Wars documentary.", "A defining moment also came on Horizon: Eat, Fast And Live Longer in 2012, where Mosley discovered a third of his body was fat and he embraced the idea of fasting.", "Fry says: “Michael set out on a journey of discovery that would change not only his life, but the health habits of the nation.”", "Mosley is credited with popularising the 5:2 diet, a form of intermittent fasting, through his book The Fast Diet, and later advocated for The Fast 800 diet, which follows a “moderately low-carb, Mediterranean-style diet”.", "He later did a Horizon: The Truth About Sleep special where he discovered whether helping his gut had improved his sleep.", "In 2013, he joined BBC series Trust Me, I’m A Doctor and during the pandemic, he began Radio 4’s Just One Thing with each episode featuring a health tip.", "“Michael’s reputation for demystifying science meant that when the world faced an unprecedented pandemic of then unknown scale Michael’s was the reassuring presence we turned to for the facts,” Fry narrates.", "On Friday, Mosley’s “genius” was remembered in a special BBC Radio 4 programme airing the last interview conducted by the late TV doctor.", "Doctor and broadcaster Chris van Tulleken introduced the interview on There’s Only One Michael Mosley, which aired a conversation between Mosley and Professor Paul Bloom recorded at the Hay Festival on May 25.", "Van Tulleken, who worked with Mosley on Trust Me, I’m A Doctor, introduced the programme: “As you’re listening to Michael (in the interview), I want you to reflect on his style, dryly witty, modest, humble.", "“This style disguises that he is one of the most important broadcasters of recent decades.", "“Before Michael, doctors in white coats told you how to live from their ivory towers, Michael’s genius was to make himself the patient and the guinea pig in a way that’s utterly relatable.", "“We’ll never forget him infecting himself with a tapeworm, or having a camera put up his back passage, all for our benefit.", "“And he’s the reason that so many programmes on radio and television have adopted this style.”", "Meanwhile, the BBC television tribute concluded saying that Mosley had touched “millions of lives in the most modest of ways”.", "“He made a difference to people’s lives, changing the way we see ourselves, our health and our wellbeing.", "“And in doing that for so many people and for so many years he leaves Britain for the better,” Fry added."]}