{"title": "Global Enterprises’ High Growth Expectations in the AI-Era at Risk from Short-term Focus on Technology", "timestamp": "\"2024-06-11 07:00:00\"", "content": ["LONDON--(BUSINESS WIRE)--Expereo, the world leading global intelligent internet company that connects people, places and things anywhere, today announces the release of an IDC InfoBrief, commissioned by Expereo, Enterprise Horizons 2024: Technology Leaders’ Priorities on Their Digital Business Journey1, which details insights from a survey of over 650 global technology leaders and highlights attitudes towards growth and investment as well as the key inhibitors to achieving these ambitions.", "The survey results, published in the IDC InfoBrief, reveal that global organizations are optimistic about their business outlook for the next 12 months, with 81% of technology leaders2 expecting to see moderate to high growth in this period. The role of technology in helping deliver that growth has reached new prominence, driven by the pace of AI adoption. However, the survey reveals major obstacles that must be overcome for technology to fully enable growth priorities, notably the emergence of a short-term, opportunistic attitude to technology planning.", "Technology’s Role in Business Growth Strategies", "When asked about their business outlook for the next 12 months, 52% of global enterprises expect to see moderate growth and a further 29% expect high growth. The ability of technology to help deliver this growth has never been higher on the agenda, with almost a third of technology leaders (29%) saying growth (to increase revenue and/or expand into new markets, segments, and/or geographies) is in their top 3 priorities driving tech investments in their organization. In addition, the top priority of technology leaders is now to contribute to business growth / increased turnover.", "Short-Termism Putting Growth Ambitions Under Threat for Many", "However, only 22% of global enterprises have reached full digital maturity – a scenario where a long-term digital business strategy is in place and there’s an orchestrated enterprise-wide digital-first trajectory. The reality is that most of global organizations are still working on opportunistic and short-term digital plans with isolated and siloed digital excellences across IT and Business units.", "In fact, a third (33%) of global enterprises admit to having a short-term focus, meaning digital strategy and initiatives are enterprise oriented but typically have a short lifespan. Interestingly, there are more than a quarter of global respondents who say whilst the CEO supports digital initiatives, they do not work closely enough with technology leaders, putting digital transformation initiatives in jeopardy.", "Digital Maturity Vital to Meet Challenges Ahead", "The range of challenges identified in the survey reflects the mix of technical, economic and cultural factors that technology and business leaders face today.", "When asked what the biggest risks or inhibitors are to their growth ambitions over the next 12 months, 38% of global respondents cited geopolitical issues as potentially affecting either their business or their technology providers. This is followed by inflation (34%), economic uncertainty (32%), uncontrolled spending by lines of business (31%) and performance of networks /connectivity globally (30%).", "When asked about serious challenges to executing the digital initiatives aimed at enabling growth, IT integration complexity (41%), partners’ capabilities (40%), lack of regional expertise (35%) were identified.", "Increased automation, enhanced cost containment and efficiencies, and greater innovation seen as key growth enablers", "When asked how their organisations were planning to deliver global growth over the next 12 months, the number one driver is via increased automation for almost half (49%) of respondents; a further 60% agree that automating business operations and processes is now considered important or extremely important. Additional growth initiatives include an increased focus on cost containment and efficiencies (44%) and increased innovation (39%).", "AI is the number one technology investment priority globally", "42% of respondents named AI as their number one technology investment priority, narrowly beating security (37%) and cloud or multicloud networking/ connectivity (35%). 31% of global respondents believe AI/ML will be critical to fulfilling business ambitions, a further 60% say it will be important.", "Ben Elms, Chief Executive Officer at Expereo, comments: “This year’s Enterprise Horizons report brings encouraging news: there is a growing optimism about global growth, and the critical role of technology in driving this progress is widely acknowledged. Many organizations are eager to accelerate their journey toward the future through digital transformation, but the path forward remains a work in progress for many. Bridging the gap between the fifth of global organizations that exhibit full digital maturity and the rest is imperative.", "To move swiftly into the future with digital transformation, organizations need a comprehensive long-term 360-degree digital strategy. This strategy must encompass every aspect of the technology stack — from AI/ML, automation, and analytics, to cloud performance, security, network visibility, and connectivity. Such a strategic approach is essential for ensuring the performance, agility, and scalability necessary for sustained high growth.”", "For the full IDC InfoBrief, please visit: https://www.expereo.com/whitepapers/enterprise-horizons-2024", "About Expereo", "Expereo is the world leading intelligent internet company that connects people, places, and things anywhere. Solutions include Global Internet, SD-WAN/SASE, and Enhanced Internet. With an extensive global reach, Expereo is the trusted partner of 60% of Fortune 500 companies. It powers enterprise and government sites in more than 190 countries, with the ability to connect to any location worldwide, working with over 2,300 partners to help customers improve productivity and empowering their networks and cloud services with the agility, flexibility, and value of the Internet, with optimal network performance.", "Expereo was acquired in Feb 2021, by Vitruvian Partners which acquired a majority shareholding from Seven2.", "1 doc #EUR252162924, May 2024", "2 doc #EUR252049924, April 2024"]}