{"title": "US Open 2024: Rory McIlroy shares first-round lead with Patrick Cantlay as Scottie Scheffler, Tiger Woods struggle", "timestamp": "\"2024-06-14 00:00:00\"", "content": ["Rory McIlroy made a dream start to his bid to claim an elusive fifth major title by grabbing a share of the first-round lead at the 124th US Open.", "McIlroy, chasing a first major victory since his 2014 PGA Championship success, carded five birdies in a bogey-free 65 at Pinehurst No 2 to match the early clubhouse target set by Patrick Cantlay.", "The Northern Irishman said ahead of this week that he was \"closer than ever\" to ending a decade-long major drought, and McIlroy - who has already claimed three worldwide victories this season - backed it up with his first blemish-free start to a US Open since his wire-to-wire win in 2011.", "US Open: Latest leaderboard | Opening round as it happened", "When is the US Open on Sky Sports? Key TV times and how to follow", "Stream the US Open and more with NOW | US Open latest headlines", "Cantlay birdied three of his last five holes to also get to five under, with debutant Ludvig Åberg a shot back in third ahead of 2020 US Open champion Bryson DeChambeau and Frenchman Matthieu Pavon.", "McIlroy was playing alongside PGA Championship winner Xander Schauffele and world No 1 Scottie Scheffler, who carded rounds of 70 and 71 respectively, while defending champion Wyndham Clark struggled to a three-over 73 and Tiger Woods fell nine behind with an opening-round 74.", "How McIlroy made early major move", "McIlroy opened with three straight pars and followed a seven-foot birdie at the fourth by chipping in for another at the par-five next, with the 35-year-old reaching the turn in 33 and then taking advantage of the par-five 10th.", "The former world No 1 ended a run of two-putt pars by converting a 10-foot birdie at the par-four 16th, before a 20-foot birdie at the last saw him complete his first bogey-free start to a major since his 2014 victory at The Open.", "Cantlay mixed six birdies with a lone bogey during an impressive start, while DeChambeau - who impressed off the tee during the opening day - threatened a late push for the lead when he carded a first-nine 33 and added further birdies at the third and fifth.", "The American missed from eight feet to save par at the seventh, though, and slipped back to three under alongside Pavon, who held a two-shot lead earlier in the day following two eagles in the space of six holes.", "England's Tyrrell Hatton and Tony Finau started with 68s and Sergio Garcia took advantage of a late entry into the event to post a bogey-free 69, while Collin Morikawa recorded a birdie-birdie finish to salvage a level-par 70 to sit five back alongside Schauffele and five-time major winner Brooks Koepka.", "Schauffele - chasing back-to-back major victories after last month's win at Valhalla - mixed four birdies with as many bogeys during an erratic open day, as Scheffler struggled off the tee and fell six behind in his bid for a sixth PGA Tour title in nine starts.", "Open champion Brian Harman started with a one-over 71 and Clark made just one birdie in his title defence, carding four bogeys along the way, as Woods cited a lack of sharpness and a poor display on the greens after being unable to build on his strong start.", "Woods held a share of the lead lead after playing the first six holes in one under but then slipped back with five bogeys in a seven-hole stretch, although he was later seen on the range offering support to Justin Thomas after the two-time major champion slumped to a seven-over 77.", "McIlroy leads after 'controlled start'", "McIlroy, who started with a bogey-free round in three of his four major wins, said: \"I went through a run there for a while where my starts at major championships weren't very good. Probably got myself a little too worked up at the start of the week.", "\"But back to the PGA (Championship) I opened with a five under there at Valhalla. Even going all the way back to this tournament last year, I opened with a low one. It wasn't quite as low as Rickie (Fowler) and Xander (Schauffele), but it was nice to open up with a low one and feel like you're right in the tournament from the first day.", "\"Certainly the major championships that I've won or the ones that I've played well at, I've always seemed to get off to a good start, and it's nice to get off to another one.", "\"My short game was good early on. I chipped in at five and had a really good up and down on six and on eight. But apart from that, I think I hit every other green. It was a really controlled round of golf.\""]}