{"title": "Specialized Court Dockets Honor Graduates", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["Months of intensive court-supervised treatment and support culminated in three special graduation ceremonies recently — the first graduations for the Fairfax County Drug Court Docket and Mental Health Docket and the 13th for the Veterans Treatment Docket.", "All three court dockets are part of Fairfax County’s Diversion First initiative that offers alternatives to incarceration for people with mental illness, developmental disabilities and substance use disorders who come into the criminal justice system. The programs, which are voluntary, aim to prevent repeat encounters with the criminal justice system, improve public safety, promote a healthier community, efficiently utilize resources and — most importantly — help people who are in crisis recover and take control of their lives.", "Drug Court", "Fairfax Circuit Court Judge Penney S. Azcarate, who was instrumental in establishing the Drug Court, found that approximately 65% to 70% of her cases involved substance use. “If we can reduce substance use recidivism in our county,” she points out, “we ultimately can save lives — and money.” Studies have shown that, even with treatment costs included, drug courts saved localities an overall average of $5,600 to $6,200 per offender compared to incarceration.", "Drug courts are specific court sessions, or dockets, for criminal defendants who have alcohol and/or other substance use disorders and have been convicted of a non-violent crime, are on probation and have come back into the court because of a felony probation violation related to substance use dependency disorders. Participants commit to close monitoring and following treatment recommendations, as well as regular communication with a probation officer, frequent court status hearings and routine drug screenings. The supervising judge receives regular reports from treatment providers about the participants.", "Mental Health Docket", "“The issue of mental health is important to the whole judicial system,” says Fairfax County General District Court Judge Tina Snee, who presides over the Mental Health Docket. The docket serves criminal participants who are suffering from a mental illness and are currently involved in Fairfax County’s criminal justice system. The docket is voluntary and participants can decide not to be involved at any time. However, if they choose to quit (or obtain a sanctioned dismissal) the traditional court process will resume.", "The Mental Health Docket is divided into three phases. Commonwealth and defense attorneys can require a defendant to complete different phases of treatment until they graduate. Upon successful completion of the program, participants may expect any one or more of a range of dispositions or outcomes in their cases, including, but not limited to, dismissal or reduction of the charges or having the case otherwise resolved.", "“A large number of individuals who are part of the judicial system suffer from varying degrees of mental health/co-occurring issues,” notes Snee. “Their needs would be best addressed by behavioral health specialists, and jail is not always the best place to have those needs addressed.”", "Veterans Docket", "The Veterans Treatment Docket was launched in 2015 to address the mental health and substance use issues that often result from the combat stresses of military service. “We ask much of our men and women in uniform,” says Fairfax County General District Court Judge Michael Lindner. “We are ultimately responsible for ensuring that whatever effects they suffer in the mission of defending our nation will be treated.”"]}