{"title": "Dan Hurley remains at UConn, turns down offer to coach Lakers for chance to pursue third straight NCAA title", "timestamp": "\"2024-06-10 17:41:00\"", "content": ["The Huskies have won yet again.", "Dan Hurley has turned down a career-altering job offer from the Los Angeles Lakers and will remain in college basketball as UConn's coach, a source confirmed to CBS Sports. If ever there was an event to firm up Connecticut's blue-blood status, this is it. Despite being presented with a sizable contract ( $70 million over six years, according to multiple reports) that outsized UConn's bidding price, Hurley nevertheless spurned the NBA's most glamorous franchise to stay in Storrs, Connecticut, and will continue to oversee the best program in the sport.", "\"I am humbled by this entire experience,\" Hurley said in a statement. \"At the end of the day, I am extremely proud of the championship culture we have built at Connecticut. We met as a team before today's workout and our focus right now is on getting better this summer and connecting as a team as we continue to pursue championships.\"", "Hurley traveled to Los Angeles for an interview Friday to meet with Lakers president Jeannie Buss and general manager Rob Pelinka. He was sold a vision of overseeing a pro franchise that could operate in his image and with his influence at the forefront of the Lakers organization in the years to come. But what that job could not provide is the long-term stability and the comforts of Storrs and his beloved territory, the East Coast.", "Hurley flew back East on Saturday, just in time to attend a Billy Joel concert at another NBA facility he's all too familiar with: Madison Square Garden, AKA \"Storrs South.\" Huskies assistant Luke Murray attended the concert alongside Hurley and Hurley's wife, Andrea, posting a short video clip of the three of them on Instagram (with Hurley in a New York, New York T-shirt, no less). In retrospect, the IG post functioned as a harbinger of the good news that was to come for UConn fans.", "Hurley's decision is a quake to pro and college hoops. On the college side, this keeps UConn highly ranked heading into the 2024-25 season, reigniting the Huskies' hopes and dreams of a three-peat — something last achieved in men's college basketball in the early 1970s by UCLA. The NBA fallout: Hurley's pass on the Lakers brings more speculation and recalibration regarding the timeline and new leading candidate for a legacy franchise looking to capitalize in the winter years of LeBron James' career. Previously, in the days before Hurley's name was attached to the vacancy, ESPN broadcaster/commentator JJ Redick had reportedly been the Lakers' top choice.", "In opting to stay in the college ranks, Hurley joins the likes of Mike Krzyzewski, Jay Wright, Tom Izzo, Jim Boeheim and Bob Knight as championship-winning college coaches who turned down NBA job offers. Hurley's rebuff comes 20 years after Krzyzewski did the same thing to the Lakers, only instead of having LeBron James, it was Kobe Bryant who was the megawatt star in L.A. two decades back.", "A lifelong resident of the Northeast, Hurley ultimately chose to return to a place where he's beloved and, should the Huskies' streak of dominance continue in the years to come, has a chance to go down as one of the best coaches in the history of men's college basketball.", "\"We are thrilled that Dan Hurley has made the decision to stay at UConn and continue building upon our championship tradition,\" Connecticut AD Dave Benedict said. \"He has helped return our men's basketball program back to the pinnacle of the sport, including back-to-back NCAA Championships, and we're grateful for his loyalty to UConn. We look forward to Dan's continued leadership on and off the court at UConn. He will continue to bring great pride to Husky fans everywhere as we work toward a three-peat.\"", "It's a huge day for college basketball, which keeps one of the biggest stars in its sport and, crucially, avoids a potential mass exodus of talent out of Storrs.", "UConn is ranked No. 5 in Gary Parrish's offseason rankings, thanks to the return of rising junior Alex Karaban, the key portal addition of Aiden Mahaney (Saint Mary's) and incoming five-star freshman Liam McNeeley. Karaban recently decided to return to Connecticut after heavily flirting with going to the NBA. Among many reasons Hurley decided to return, Karaban's decision to return was also a factor.", "The NBA still remains a looming curiosity for Hurley, but it might be years before he flirts with the Association again. The job he covets much more than the Lakers is housed right where he watched Billy Joel on Saturday night: The New York Knicks. If not there, then potentially somewhere else on the East Coast (the Celtics, Nets or 76ers), should any of them open and come calling later this decade."]}