{"title": "Chasing sports: Excited to join Norway fans in East Lansing", "timestamp": "\"2024-06-14 00:00:00\"", "content": ["IRON MOUNTAIN — The way I’ve lived has given me a few moments of anticipation that are incomparable. Boarding the plane back to Germany after a year in Afghanistan, is probably at the top of that list.", "However, outside of covering my first Central Michigan football game against Western Michigan, the anticipation of watching the Norway varsity baseball team take the field at Michigan State University ranks right up there with seeing the hallowed grounds of Wrigley Field.", "Growing up, my aunt Carrie took my brother and I to Michigan State University, where she attended classes. I remember walking around Beaumont Tower, the MSU Duck Pond and the Sparty statue as we talked about the potential of attending the school as well. All the while, in the back of my head, I knew I would never be back in East Lansing.", "Oh how wrong I was.", "Since I began my journalism career in October 2020, I’ve covered a lot of teams from Grand Rapids Community College to Central Michigan University and beyond. And yet, I’ve never been able to cover a team’s chase for a title… Until now", "On top of that, I get the chance to watch an incredible group of kids achieve a childhood dream.", "While I haven’t been in the Dickinson County news game for long, I tried to dive right in and since I’ve been here Norway has been among the most accommodating schools as far as media is concerned.", "I mean, Ian Popp saved me from having permanent facial damage during a basketball game and then made a play on the other end. How much more hospitable can ya get?", "As crazy as it may seem, there was one sport that I hoped to avoid when I began my path as a journalist. … Baseball.", "It wasn’t for a lack of knowledge or interest, but rather, it was one of the few sports I wasn’t involved in and I didn’t think I could cover it with the same effortlessness as Buster Olney and Peter Gammons.", "It may not mean much, but you’ve got at least one “Troll” on your side.", "Here’s hoping that they have caught on to the “Coney Dog” trend in East Lansing.", "If you can’t make it to the Knights’ semifinal contest in East Lansing, the event will be streamed online at https://www.nfhsnetwork.com/events/mhsaa-mi/gam9c39d8dbb0.", "Before I take my talents over the “Mighty” Mackinac Bridge, I want to point out some other folks who had impressive springs.", "After working out the kinks, the Niagara varsity baseball team nearly made history of its own by bringing home a sectional championship.", "Iron Mountain’s Niko Burgoon kicked off the perfect game craze in the area and Kingsford’s Andres Finley was a force on the mound as well.", "Outside of hardball, Kamdan Johnson brought home another state title in track while West Iron County’s Danica Shamion entered rarefied air in the Upper Peninsula after winning four U.P. titles at the U.P. Finals in Kingsford. On the boys side, Vic Giuliani secured a high jump title with a 6′ jump and he nearly pushed it even higher. Kingsford’s Michael Floriano and Iron Mountain’s Matthew Colavecchi brought home individual titles as well.", "Just under 10 months ago, I moved to the area with no idea what the local sports scene truly looked like. However, on June 13, I can say I vastly underestimated the level of talent in the area.", "One last thing.", "I tried to make sure they were recognized even as I struggled to keep myself afloat in this fast-paced world of high school sports this year.", "Yes, I made some mistakes and things were missed. But, looking back, I can say I gave it my all every day in hopes of providing the coverage this area has come to expect from the likes of Burt Angeli.", "I’ve got a few ideas to level-up the sports coverage in the area and this is only the beginning. I know that things have been overlooked in past years. So if there is an event, whether it be rec golf or Little League or bocce ball, please let me know at schase@ironmountaindailynews.com.", "Thank you for all the help and feedback along the way.", "I’ll see you in East Lansing!"]}