{"title": "Get Ready for Any Emergency During National Preparedness Month", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["Since Sept. 11, 2001, the U.S. Government has taken steps to encourage everyone to make their own survival preparations. In 2004, the Federal Emergency Management Agency (FEMA) launched its annual campaign every September, now known as National Preparedness Month, to remember the events of Sept. 11 and highlight the importance of being prepared.", "The 2022 theme is “A Lasting Legacy. The life you’ve built is worth protecting. Prepare for disasters to create a lasting legacy for you and your family.”", "Each week in September, Fairfax County has been highlighting a different aspect of preparedness for individuals, families and communities on our emergency blog.", "Our Department of Emergency Management and Security (DEMS) is also collecting feedback through the 2022 Emergency Preparedness Survey to assess the culture of personal disaster preparedness and resilience in Fairfax County.", "County Conversation Podcast", "Greg Zebrowski, assistant coordinator for DEMS' Planning and Policy Division was featured on the Sept. 7 “County Conversation” podcast. He provided guidance on what steps residents can take to be better prepared for any crisis or emergency, as well as informed listeners about National Preparedness Month.", "“I think it's important to be prepared to protect you and your family, your pets your property. There's a lot of things that can go wrong. And there's big acts of nature that can happen or there are simple home emergencies like a burst water pipe or a house fire or a tree falls through your roof because of limbs. Having the mindset of ‘I don't know when it could happen,’ but there's always so many simple little steps that you can have from something simple like having an umbrella or a blanket in your car during the winter or extra water on hand in your house. If you take it one easy step at a time, it doesn't become so daunting or overwhelming.”", "Emergency Preparedness Webinar", "On Sept. 7, DEMS hosted a live National Preparedness Month webinar, “Five Steps to Preparedness.”", "The webinar was designed to increase awareness of meaningful actions Fairfax County residents can take to prepare for, respond to and recover from emergencies, and increase resilience to all types of threats and hazards.", "Moriah Kitaeff, DEMS community engagement specialist, presented the webinar and provided preparedness tips throughout. One such tip was about “go bags” or emergency kits, recommending that residents have three different types of emergency kits – one for sheltering in place at home, a second for evacuating and a third for keeping in your vehicle.", "“I think that when it comes to emergency kits, there are so many different ways to create them and it does not have to be something that you … go drop X amount of dollars on. An emergency kit is something that can be built over time, piece by piece. And there's a lot of things that are great for an emergency kit that do not cost a lot of money.”", "She also noted that your evacuation bag and vehicle kit could be one-in-the-same.", "DEMS offers regular webinars every month on various emergency preparedness topics. Find an archived playlist of webinars on YouTube."]}