{"title": "Las Vegas Locally Owned Small Businesses", "timestamp": "\"2024-06-12 19:49:37\"", "content": ["hace 3 meses", "Locally Owned Small Businesses: Can the 'boss boom' repeat itself?", "On Monday mornings, we love to highlight locally owned businesses.Last year, there was a \"boss boom\" in our community.News 3's Kim Wagner spoke with Dave Chares", "hace 3 meses", "Locally Owned Small Businesses: What to know before you start your own business", "There's a boss boom happening, and you've had a front-row seat as News 3 puts a spotlight on locally-owned businesses.If you have an itch to dive into business", "hace 3 meses", "Locally Owned Small Businesses: Five Star Sitters", "It started as a babysitting club when they were students at UNLV -- a way for a couple of friends to earn some extra money while going to school full-time.Littl", "hace 3 meses", "Locally Owned Small Businesses: XGRiD Campers", "The local owner of this Las Vegas business wants you to get off the grid.They sell and customize specialized campers so you can get out on your next adventure", "hace 4 meses", "Locally Owned Small Businesses: Abingdon Co.", "A local woman found a need for specialty watches that do more than just tell time. We opened up the doors and the mechanics of Abingdon Co.in Downtown Las Vega", "hace 4 meses", "Locally Owned Small Businesses: ToTo Entertainment", "Don't be surprised if you find yourself wondering: \"Could I do that?\"Entrepreneur Daniel Calderin is in the central part of the Las Vegas valley, but his job ha", "hace 4 meses", "Locally Owned Small Businesses: Starburst Parlor satisfies your sweet tooth", "If you have a sweet tooth but you're supposed to avoid sweets, Starburst Parlor could be your answer.The unique bakery is located in the historic Medical Distri", "hace 4 meses", "Locally Owned Small Businesses: Starburst Parlor", "She didn't know it at the time, but it turned out to be a recipe for success.Las Vegas local Jill Shlesinger has a passion for baking, and all of a sudden she h"]}