{"title": "Erik ten Hag: Decision on Manchester United boss expected this week with Thomas Tuchel out of running", "timestamp": "\"2024-06-10 10:00:00\"", "content": ["Manchester United are expected to make a decision on the future of manager Erik ten Hag this week with Thomas Tuchel out of the running to replace him.", "Ten Hag has returned from holiday but is yet to find out whether he will be in charge for a third season at Old Trafford with the club's post-season review still ongoing.", "Former Bayern Munich and Chelsea boss Tuchel held talks with United co-owner Sir Jim Ratcliffe in France last week but is no longer under consideration for the job should United decide to make a change.", "Man Utd transfer news and rumours | Transfer Centre LIVE!", "Premier League 2024/25 season dates, schedule, fixture release", "Stream the Premier League with NOW | Get Sky Sports", "As far as Ten Hag is concerned, he is still the United manager and has one year left on his contract, but the longer the review goes on the more potentially concerning it becomes for him.", "The 54-year-old led United to FA Cup glory last month to secure his second major trophy in as many seasons, but an eighth-place finish in the Premier League and a dismal European campaign has cast doubt on his position.", "While he is aware of reports the club have been in contact with other managers, Ten Hag has always wanted to stay but is realistic when it comes to expectations about his future.", "Sky Sports News reported in May that Gareth Southgate was sounded out about the possibility of becoming United manager one day - but he had no interest in engaging in any conversation that was not about his job as England boss.", "Southgate is on good terms with INEOS director of sport Sir Dave Brailsford and he worked closely at the FA with incoming sporting director Dan Ashworth.", "It has been reported by other media outlets that United have also been monitoring ex-Chelsea and Tottenham boss Mauricio Pochettino, Brentford's Thomas Frank and Graham Potter.", "Why is Tuchel out of the running?", "Sky Sports News chief reporter Kaveh Solhekol:", "\"We know who won't be in charge of Manchester United next season and that's Thomas Tuchel. Depending on who you believe, there are different versions about why he won't be replacing Erik ten Hag as United manager if Ten Hag leaves Old Trafford.", "\"According to Tuchel's camp, he wants to take a little break away from football and wants to put his feet up for a while - that is why he doesn't want the United job.", "\"From Manchester United's point of view, the narrative would be that they don't want to make Tuchel their next manager and if they decide to replace Ten Hag, they will look for someone else.", "\"Speaking of Ten Hag, it's been a very difficult time for him since he won the FA Cup a couple of weeks ago. He's been on holiday but in the back of his mind, hanging over him, has been this issue of whether he's still going to be the Manchester United manager or not.", "\"United have been holding this post-season review and we're expecting some sort of clarity this week on his future.", "\"You would hope Ten Hag would be the first person to know. He's back from his holiday and you would imagine United will hold face-to-face talks soon.\"", "When does the summer transfer window open and close?", "The 2024 summer transfer window in the Premier League officially opens on Friday June 14 - the same day that Euro 2024 starts.", "The window will close on August 30 at 11pm UK time in England and at midnight in Scotland.", "The Premier League has brought forward Deadline Day to link up with the other major leagues in Europe. The closing dates were set following discussions with the leagues in England, Germany, Italy, Spain and France."]}