{"title": "FOX 10 FAQs", "timestamp": "\"2024-06-13 12:33:30\"", "content": ["News App", "How do I change the font size?", "On any story page, tap on the AAA button on the top right of the screen. Each tap will increase or decrease the size.", "How do I watch live video?", "Click on the red \"Watch Live\" button at the top right of the screen to view live feeds from FOX 10 Phoenix and other FOX TV stations.", "How do I turn on/off closed captioning?", "On a video, click on the CC button to turn on captions; click on it again to turn off captions", "How do I turn on/off notifications?", "Click on Settings, then toggle the notifications button.", "Can I disable the alert sound when I get a push notification?", "Yes, you can turn off the sound while continuing to receive our news alerts. If your device is in silent mode, an alert sound won’t play.", "Apple devices: Go to Settings > Notifications > FOX 10 app > Sounds. Tap on the switch to toggle the sound off or on.", "Android devices: Settings > Notifications > FOX 10 app. Toggle the switch for \"show silently.\"", "How do I share a story?", "Click on the share icon on the top right of the screen, then select the app you want to share the content to, or copy the link to a message, email, etc.", "How can I cast videos to my TV screen?", "For Apple devices: On videos, click on the TV icon; an AirPlay menu will appear. Choose your TV. Your phone/tablet must be on the same wi-fi as your TV.", "Screen casting is not available for Android devices at this time.", "I clicked on a push alert on my Apple device and the rest of the pushes in the list disappeared. What happened?", "After you open one alert, you can find the other stories alerts were sent about by clicking on Browse (Menu) > Alerts", "How do I clear the red bubble on the app’s icon?", "When you open the app, the badge number will be cleared.", "Apple devices: You can turn the \"bubble\" on or off by going to Settings > Notifications > FOX 10, then toggle \"Badges.\"", "Android devices: At this time, toggling badges is not available.", "None of the stories or videos are loading. What’s wrong?", "Are you using Wi-Fi or 3G/5G/4G/LTE? If the signal is low, it will cause delays in loading the content.", "Try closing the app, then re-opening it.", "Do you have the latest version of the app installed? If not, that could be causing the problem. Click here to update.", "Do you have the latest operating system installed on your phone/tablet? If not, updating your device to the latest OS can help.", "On Android devices, clear your app’s cache. Go to Settings, click on Storage. Find the FOX 10 app in your list of installed apps, click on it, then click on the Clear Cache button. Clearing the cache can help when an app isn’t working properly.", "On Apple devices, do you have Background App Refresh enabled? See https://support.apple.com for more information.", "Try restarting your device.", "Website", "How do I download a video?", "Videos on FOX10Phoenix.com are not available for downloading, and we do not send tapes or e-mail videos. For a copy of a newscast, please see https://fox10phoenix.com/copies-of-newscasts for information.", "On TV, they said go to our website for more information and a link. I’m lost. Where do I go online?", "Click on \"Links\" (it may also appear as \"Seen on TV\") in the menu bar or go to https://fox10phoenix.com/links", "TV Listings", "To view FOX 10 and FOX 10 Xtra programming schedules, go to https://fox10phoenix.com/whatsonfox", "How do I watch live video?", "Go to https://fox10phoenix.com/live to view live coverage from FOX 10 and other FOX owned-and-operated TV stations. For the latest on-demand video, head to https://fox10phoenix.com/shows/video", "Searching for stories and/or videos", "If you’re not sure of when the story aired, try using the search box at the top of all of our pages. Please note that not every story that airs on TV is posted to our website.", "Weather app", "How do I set up the app to update my location?", "Click on the menu button, select Location > Follow Me. Depending on your device’s settings, you may get a prompt to get your current location by clicking on \"change location settings,\" which will open the settings app on your phone/tablet. If you want to grant permission to view your location, select \"Ask next time,\" \"While using the app,\" or \"Always.\" If \"Never\" is selected, the app will not update to a different location.", "How do I turn on/off notifications?", "Click on the menu button > Settings. Toggle FOX 10 Weather Alerts off or on. For severe weather alerts, click on \"Weather Notification Types.,\" then \"Enable notifications for a location.\" On the next screen, enter the locations you’re interested in.", "I want the notifications, but without sound. How do I do that?", "Click on the menu button > Settings. Click on \"Notification Sounds,\" then toggle it off or on. You can also choose if you want to have a voice announcement or sounds for the alert(s) you receive.", "I put in my zip code, but the app can’t find my location.", "Try entering the name of the city instead or nearest area. If the app still isn’t recognizing your location, please reach out to us at foxphoenixwebteam@fox.com for assistance.", "None of the maps or videos are loading. What’s wrong?", "Are you using Wi-Fi or 3G/5G/4G/LTE? If the signal is low, it will cause delays in loading the content.", "Try closing the app, then re-opening it.", "Do you have the latest version of the app installed? If not, that could be causing the problem. Click here to update.", "Do you have the latest operating system installed on your phone/tablet? If not, updating your device to the latest OS can help.", "On Android devices, clear your app’s cache. Go to Settings, click on Storage. Find the FOX 10 app in your list of installed apps, click on it, then click on the Clear Cache button. Clearing the cache can help when an app isn’t working properly.", "On Apple devices, do you have Background App Refresh enabled? See https://support.apple.com for more information.", "Try restarting your device", "Email newsletters", "How do I sign up?", "Go to https://fox10phoenix.com/email and enter your first and last name, along with your email address. Then choose the newsletters you want to subscribe to: a daily Arizona Morning brief, breaking news, or features (sports, entertainment, contests and events). Click on the Sign Up button to complete the process.", "How do I unsubscribe to one newsletter, but stay subscribed to others?", "We’re sorry to see you go. In one of our previous newsletters, there’s a link to manage your preferences or to unsubscribe. (The link is specific for your account) Click on the checkbox for the email(s) you want to receive or unsubscribe from.", "FOX 10 and FOX 10 Xtra broadcasts", "For Audio/Video, TV Reception Issues, send an email to FoxPhoenixDTV@fox.com", "For Closed Captioning Issues, send an email to FoxPhoenixClosedCaptioning@fox.com"]}