{"title": "Springfield bests top-seeded Cherry in semifinals", "timestamp": "\"2024-06-15 00:00:00\"", "content": ["“Going into it, you’re obviously pumped,” Nachreiner said. “But everybody’s telling you, ‘It’s just one more inning, you can’t get too overthinking.’ It’s just another inning out there.”", "Nachreiner struck out six batters on the day and allowed one earned run on five hits and no walks in seven innings. Nachreiner’s performance helped punch the team’s ticket to the Class A State Baseball Championship game against No. 2 Parkers Prairie at 10 a.m. Monday morning at Target Field.", "“It feels amazing knowing that we get to play on that field,” Nachreiner said. “We’ve battled this whole year for it, we came out of a tough section, really tough. It just feels great knowing that we’re here.”", "Despite coming into the game as an underdog, Springfield held the belief that anyone could win at this stage of the state tournament.", "“Coming in against the one seed, you got to have the mentality that anybody’s beatable at this point,” Springfield’s Noah Neperman said. “Everybody’s equal, just try to stay calm and play the ball that we play.”", "At the plate for Springfield, Neperman was 2 for 4 with two RBIs, while Jackson Ludewig was 1 for 3 with an RBI. Nachreiner had a double, while Aiden Moriarty was 1 for 2 with a run scored.", "Cherry was the first to score in the second inning, putting runners on the corners on a double by Noah Sundquist and a single by Mason Heitzman. Shortstop Madden Lendt caught a line drive and got the double play at first, but Sundquist scored on a wild pitch to give Cherry a 1-0 lead.", "Springfield responded in the third inning, starting things off with a double by Nachreiner with two outs. Ludewig collected an RBI single in the next at-bat to tie things up.", "After a scoreless fourth inning, Heitzman, the Cherry Pitcher, walked three to start the fifth inning. This set up Neperman for a two-RBI single to give Springfield the lead for his first hit of the state tournament.", "“It felt good, everything at that point, just laying it out for the team,” Neperman said. “Same approach as the last few games, just getting the bat on the ball, try to barrel stuff up and it’s all about teamwork.”", "Lucas Milbrath got a sacrifice fly to tack on another run and make it a 4-1 lead. The Springfield defense continued the momentum by retiring the side in the bottom of the inning.", "Cherry made a push in the sixth inning, scoring one run on a hit and an error, but Nachreiner and the Springfield defense shut things down with four straight outs to end the game.", "“The team put in the effort,” Neperman said. “We put in the work all year, and this is exactly what we deserve for that.”", "Newsletter", "Today's breaking news and more in your inbox"]}