{"title": "Revitalize the Sciences", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["President Biden's administration has a long to-do list for its first 100 days. Columbia News asked faculty members from across the University to identify the most pressing issues facing the country and offer possible solutions.", "The Biden-Harris administration takes office in the wake of the most anti-science administration in memory. Indeed, the assault on science under Donald Trump—like the one on the media—has served to promote autocracy, by delegitimizing an institution that is an independent arbiter of truth. It also served to promote private profit over public well-being, by clearing the path for extreme deregulation of polluting industries. The new administration should move quickly to re-establish that science is essential to both democracy and ethical governance.", "The early signs are very promising. Biden has named an unprecedentedly strong “climate team” and announced that his science adviser, geneticist Eric Lander, will be elevated to the Cabinet. Perhaps even more exciting, he has appointed social scientist Alondra Nelson (a Columbia faculty member from 2009-2019) as the Office of Science and Technology Policy’s Deputy Director for Science and Society, a newly created position. Someone with Nelson’s expertise in the connections between science, technology, medicine, and social inequality has, to my knowledge, not been this high up in U.S. government before. Science will be in good hands for the next four years. Here are three broad goals I hope the new administration will pursue.", "1. Rebuild the Agencies", "Critical agencies have been decimated under Trump. Government entities with missions that bear most directly on policy—and that are most essential to addressing ongoing crises—such as the Environmental Protection Agency and Center for Disease Control, have been hardest hit by censorship, political interference, budget cuts, and staff losses. Besides working to reverse the damage agency-by-agency, Biden could define and publicize a federal policy on the role of science. Key points should include that scientists can communicate freely with the media, that political appointees will not meddle in research, and that the content of scientific reports from agencies, advisory boards, and the like will not be subject to political oversight. Such a policy could underscore a strong hiring program to draw new scientific talent to demoralized and understaffed agencies.", "2. Put the Public Interest First", "While the private sector has an important role to play in many science-related public policy issues, government’s first priority should be to look out for the public interest, defined broadly and inclusively. Trump's steps at disbanding scientific advisory panels in favor of industry-friendly committees selected by political appointees should be reversed. This concern applies most acutely to regulation of polluting industries—including, of course, the fossil fuel industry. But in addition to protecting the public from pollution, the government should resist privatization of key public goods: observational data used by government for weather and climate research and forecasting, as just one example, should remain free and open.", "3. Justice at the Forefront", "Harms from the COVID-19 pandemic, air and water pollution, climate change, and artificial intelligence are distributed unequally along racial and economic lines. Solutions that don’t acknowledge these inequities will be unjust. Nelson’s appointment shows that Biden recognizes this; now we can ask to see it manifest in policy. In the context of climate change, the emerging “standards, investments, and justice” framework, already endorsed by Biden, offers new hope for progress where the idea of an economy-wide carbon price (long viewed as theoretically preferable by economists) has largely failed. More broadly, government should “listen to the science,” but also recognize that the most critical scientific issues before it are actually trans-scientific—meaning that science must be coupled to democratic values to best serve the public. At a time when much of the population believes in conspiracy theories and lies—not least about Biden’s own election—governing on this basis will be challenging. On the other hand, truth and justice have never been more urgently needed."]}