{"title": "College basketball transfer portal rankings 2024: Illinois star Coleman Hawkins commits to Kansas State", "timestamp": "\"2024-06-14 16:16:00\"", "content": ["The highest-rated player left on the board in the CBS Sports Transfer Rankings revealed his commitment on Friday, when former Illinois star Coleman Hawkins announced that he will play at Kansas State next season. Hawkins, who is ranked the No. 20 transfer, also considered North Carolina, LSU, Louisville, SMU and Arkansas, among others.", "Though he played mostly center at Illinois over the past two seasons, Hawkins is more of a stretch four and could also have the chance to play on the wing for a K-State team that loaded up on bigs this offseason. Hawkins also explored the NBA's pre-draft process before opting to use his fifth and final season of collegiate eligibility following four years at Illinois.", "With Hawkins' commitment, the only uncommitted player remaining in the CBS Sports Transfer Rankings is former Kansas State wing Arthur Kaluma (No. 39).", "As the final significant commitments of the 2024 transfer cycle roll in, we'll continue update the rankings. For now, here's a rundown of the top 80 transfers of college basketball's 2024 offseason.", "Check out the latest transfer portal updates from 247Sports", "1. Johnell Davis", "Old school: FAU | New school: Arkansas", "Davis played a key role in taking FAU to the 2023 Final Four and built on his breakout season by upping his scoring average to 18.2 points in 2023-24. The 6-foot-4 guard hit 41.4% of his 3-pointers, pulled down 6.3 rebounds and averaged 1.4 steals for the Owls in his fourth season of college basketball. He will be a pivotal part of John Calipari's first Arkansas roster.", "2. Kadary Richmond", "Old school: Seton Hall | New school: St. John's", "Richmond fueled Seton Hall's NIT title run as the Pirates' leading scorer at 15.7 points per game and top facilitator with 5.1 assists per game. He was also the team's highest-rated defender by a longshot, per evanmiya.com. The 6-5 guard is a four-year veteran of high-major basketball and is the sort of tough, two-way player who can make a difference for a St. John's team that is seeking to reach the NCAA Tournament under second-year coach Rick Pitino.", "3. Tucker DeVries", "Old school: Drake | New school: West Virginia", "DeVries won Missouri Valley Conference Player of the Year twice during three seasons while playing for his father, Darian DeVries. The 6-7 wing averaged 21.6 points, 6.7 rebounds and 3.7 assists per game in 2023-24. He's a career 35.9% 3-point shooter and dynamic offensive threat. DeVries is following his father, who accepted the West Virginia job.", "4. AJ Storr", "Old school: Wisconsin | New school: Kansas", "Storr provided a significant jolt of offense for Wisconsin in the 2023-24 season, averaging 16.8 points. The 6-6 wing is a multi-level scorer with the size needed to finish in the paint and around the rim. Being surrounded by other dynamic playmakers at Kansas should allow Storr to increase his efficiency after he shot 43.4% from the floor for the Badgers.", "5. Oumar Ballo", "Old school: Arizona | New school: Indiana", "Ballo's size (7-foot and 260 pounds) makes him a difficult player for opponents to manage. He averaged 12.9 points and 10.1 rebounds in 2023-24 for Arizona on 65.8% shooting. There isn't much versatility to his game, and Ballo's free-throw shooting dipped to a career-worst 49.5% this past season. But he's a productive bruiser with a proven track record at an elite program. He will help Indiana replace the production of Kel'El Ware, who is headed to the NBA Draft.", "6. Norchad Omier", "Old school: Miami | New school: Baylor", "At 6-7, Omier is an undersized but physical big who brings a deft shooting touch at the rim. He's a voracious rebounder and can get to high-efficiency spots as the \"roll guy\" in the pick-and-roll. Omier averaged 17 points and 10 boards per game while shooting 59.8% from the floor this past year for the Hurricanes. He also demonstrated 3-point shooting promise for the first time in his career.", "7. Mark Mitchell", "Old school: Duke | New school: Missouri", "Mitchell started 67 games in his two seasons at Duke after ranking as a five-star prospect in the Class of 2022. The 6-9 forward is a dynamic athlete who played mostly at small forward in 2022-23 before sliding to power forward this past season. He averaged 11.6 points and 6.0 rebounds per game on 54% shooting from the floor this past year. With two seasons of eligibility remaining and NBA-caliber upside, Mitchell could blossom into a star for a rebuilding Missouri team.", "8. Jeremy Roach", "Old school: Duke | New school: Baylor", "Roach is a seasoned floor general with two years of experience under Mike Krzyzewski and two years of experience under Jon Scheyer. The 6-1 guard earned third-team All-ACC honors in 2023-24 while averaging 14 points and 3.3 assists per game on 42.9% 3-point shooting. With 108 starts for a premier program under his belt, Roach will be a plug and play replacement for RayJ Dennis, who is out of eligibility after one year at Baylor.", "9. Great Osobor", "Old school: Utah State | New school: Washington", "Osobor earned Mountain West Player of the Year honors after averaging 17.7 points, 9.0 rebounds and 1.4 blocks for a Utah State team that won a strong league. The 6-8 big man does his work in the paint and hasn't shown much of an outside shot. But his effectiveness as an interior scorer is tremendous, and he should play a massive role at Washington as he reunites with his former coach Danny Sprinkle.", "10. Chaz Lanier", "Old school: North Florida | New school: Tennessee", "Lanier made a whopping 44% of his 3-point attempts on 7.5 attempts per game in his fourth season at North Florida. The 6-4 guard was merely a role player early in his career before breaking out to earn all-Atlantic Sun honors this past season. Replacing Dalton Knecht is no small task, but Lanier is poised to play a big role for the Volunteers after Knecht's memorable one-year stop through the program.", "11. Kylan Boswell", "Old school: Arizona | New school: Illinois", "Boswell started 35 games for Arizona as a sophomore, averaging 9.6 points and 3.6 assists while shooting 37.9% from 3-point range. The 6-2 guard isn't particularly explosive or rangy, which means he has limitations as a driver and defender. But he's sure-handed and produced a solid track record of perimeter shooting who should be in line for a major role with a retooling Illinois team.", "12. Rylan Griffen", "Old school: Alabama | New school: Kansas", "Griffen averaged 11.2 points on 39.2% 3-point shooting while starting 33 games as a sophomore for Alabama. The former top-50 prospect has good size as an off-ball guard at 6-5. He should play a key role on the wing for a Kansas team losing players such as Kevin McCullar Jr. and Johnny Furphy. With a strong season, Griffen could play his way into 2025 NBA Draft consideration.", "13. Tony Perkins", "Old school: Iowa | New school: Missouri", "Perkins averaged 14 points, 4.6 assists and 1.6 steals while starting all 34 games for Iowa as a senior. Following 126 career appearances for the Hawkeyes, he should make a significant impact for a Missouri program seeking to bounce back from an 0-18 SEC record. Though just a career 31.7% 3-point shooter, Perkins is a physical guard at 6-4 who can attack the basket. He also rated as Iowa's top defender in the 2023-24 season, per evanmiya.com.", "14. Robbie Avila", "Old school: Indiana State | New school: Saint Louis", "Avila became a college basketball cult hero while earning all-MVC honors as a sophomore. The 6-10 center averaged 17.4 points and 6.6 rebounds on 53.6% shooting for an Indiana State team that finished 32-7. Avila is great around the rim but also shot 39.4% from 3-point range on 4.2 attempts per game, which makes him a rarity among bigs in college basketball. He is following coach Josh Schertz from ISU to Saint Louis.", "15. Malik Mack", "Old school: Harvard | New school: Georgetown", "Mack's efficiency dipped down the stretch, but it was still a phenomenal freshman season for the 6-1 guard, who averaged 17.2 points and 4.8 assists per game. The Ivy League Rookie of the Year finished with 18 points and six assists at Boston College and scored 27 at Indiana during the first month of his college career. It was an impressive peek at what he's capable of against high-major opposition. Mack should be a featured member of Georgetown's offensive attack under second-year coach Ed Cooley.", "16. Vladislav Goldin", "Old school: FAU | New school: Michigan", "Goldin averaged 15.7 points, 6.9 rebounds and 1.6 blocks per game on an insanely efficient 67.3% shooting from the floor for FAU in 2023-24. The 7-1 Russian is a rugged and seasoned veteran who impacts both ends of the floor. He is a particularly strong asset on offense, despite the fact that he's never attempted a 3-pointer. He is reuniting with former FAU coach Dusty May at Michigan.", "17. PJ Haggerty", "Old school: Tulsa | New school: Memphis", "Haggerty averaged 21.2 points on 54% shooting inside the arc for Tulsa in 2023-24. What separates the 6-3 guard from some of the other volume scorers in the portal is that he has three seasons left to play. Instead of merely serving as a one-year rental, he could potentially develop into a three-year rotational mainstay. And if he develops his 3-point shot, he could be a high-level college star. With former star Memphis wing David Jones departing for the NBA Draft, Haggerty should shine for the Tigers.", "18. Desmond Claude", "Old school: Xavier | New school: USC", "Claude is a physical perimeter player who was Xavier's second-leading scorer at 16.6 points per game. His career 25.3% 3-point shooting mark is an eyesore, but he's an intriguing talent with a knack for putting the ball in the basket. USC is bringing in a ton of transfer talent under new coach Eric Musselman. Given Claude's track record at Xavier, he should be among the most productive of the bunch.", "19. Cade Tyson", "Old school: Belmont | New school: North Carolina", "Tyson is a career 44.6% 3-point shooter on 287 attempts over two seasons with Belmont. At 6-7 and with a demonstrated outside stroke, he should slot into a significant role with the Tar Heels. How Tyson will translate defensively to a higher level is likely the biggest question mark here, but his offensive game is sweet.", "20. Coleman Hawkins", "Old school: Illinois | New school: Kansas State", "Hawkins averaged 12.1 points, 6.1 rebounds and 2.7 assists while shooting 36.9% from 3-point range in 2023-24 for an Illinois team that reached the Elite Eight and finished 29-9. With four seasons of Big Ten experience under his belt, Hawkins is a proven stretch big man with some defensive versatility. At Kansas State, he may even get to play on the wing.", "21. Zvonimir Ivišić", "Old school: Kentucky | New school: Arkansas", "Ivišić showed tantalizing flashes of potential as a freshman at Kentucky. With a rare combination of size, skill and shooting ability, he will be an integral piece in John Calipari's effort to field a competitive team in his first season at Arkansas. At 7-2, Ivišić can swat shots or step out and hit 3-pointers. With a full offseason to spend in Arkansas' strength and conditioning program, the Croatian big man should develop the physicality required to bruise on the block in a rugged conference.", "22. Terrence Edwards", "Old school: James Madison | New school: Louisville", "Edwards was the leading scorer at 17.2 points per game for a James Madison team that finished 32-4 with a trip to the second round of the NCAA Tournament. The 6-6 guard also dished out 3.4 assists for the Dukes after making significant productivity strides in all four years he was at JMU. He will be a vital piece for coach Pat Kelsey's first team at Louisville.", "23. Jonas Aidoo", "Old school: Tennessee | New school: Arkansas", "Aidoo took significant strides as a junior during the 2023-24 season, averaging 11.4 points, 7.3 rebounds and 1.8 blocks as a full-time starter for the Volunteers. At 6-11, he registered as one of the most impactful defenders in the SEC. However, Aidoo did struggle in the rare instances when he was matched up against the sport's top bruisers such as Hunter Dickinson, Ryan Kalkbrenner and Zach Edey.", "24. JT Toppin", "Old school: New Mexico | New school: Texas Tech", "Players with Toppin's combination of production and promise don't come around often. The 6-9 forward earned Mountain West Rookie of the Year honors while averaging 12.4 points, 9.1 rebounds and 1.9 blocks per game in the 2023-24 season. Toppin has three seasons of eligibility remaining and has already demonstrated the ability to step out and shoot 3-pointers. He's got a tantalizing all-around game and could develop into an NBA Draft prospect.", "25. Trey Townsend", "Old school: Oakland | New school: Arizona", "Townsend earned Horizon League Player of the Year honors while leading Oakland to a conference title and upset victory over No. 3 seed Kentucky in the first round of the NCAA Tournament. The 6-6 forward is a dynamic scorer who racked up 1,813 points in four seasons playing for the Golden Grizzlies. He should play a key role for an Arizona team replacing a massive amount of production.", "26. Clifford Omoruyi", "Old school: Rutgers | New school: Alabama", "Entering the first round of the NCAA Tournament, Omoruyi's 93 blocks ranked fourth nationally. The 6-11 center is an elite rim protector with consecutive Big Ten All-Defense honors. Omoruyi also averaged double figures in each of the last three seasons and posted 29 double-doubles in his four years with Rutgers. He can't do much away from the rim offensively, but he is excellent defensively and will be a force on that end for a Crimson Tide team with national title aspirations.", "27. Pop Isaacs", "Old school: Texas Tech | New school: Creighton", "Creighton had a perimeter scoring role available amid the departures of Trey Alexander and Baylor Scheierman. Isaacs will help fill it after averaging 15.8 points as a sophomore at Texas Tech. The 6-2 guard was not efficient — shooting just 34.9% from the floor as a sophomore — but he is talented and figures to play a ton of minutes for the Bluejays.", "28. Deivon Smith", "Old school: Utah | New school: St. John's", "Smith was a steal on the 2023 transfer wire, landing as a star in the Utah lineup after he was a role player at Mississippi State and Georgia Tech during his first three seasons. The 6-1 guard finished sixth nationally in assists per game at 7.1 while also scoring 13.3 points per game on 40.8% 3-point shooting for the Utes. He is a point guard upgrade for St. John's.", "29. Tramon Mark", "Old school: Arkansas | New school: Texas", "Mark averaged 16.2 points on 48% shooting for Arkansas in 2023-24 after spending the first three years of his career at Houston. The 6-5 guard is just a career 32% 3-point shooter, but he's a battle-tested veteran with the ability to go out and get buckets in a variety of ways. He is a big addition for a Texas team losing its top four scorers.", "30. Jaxson Robinson", "Old school: BYU | New school: Kentucky", "Robinson led BYU in scoring at 14.2 points per game last season while earning Big 12 Sixth Man of the Year honors. He is following his former coach to the SEC and should provide a dose of offensive punch to the Wildcats' transfer-heavy roster. This will be the third SEC stop for the 6-7 guard after Robinson began his career at Texas A&M and then Arkansas.", "31. Ja'Kobi Gillespie", "Old school: Belmont | New school: Maryland", "Belmont was at its best with Gillespie on the floor; he averaged 17.2 points, 4.2 assists and 2.2 steals for the Bruins. The 6-foot guard is on the smaller side but shot a ridiculous 66% inside the arc and a solid 38.7% beyond it. With two seasons of eligibility remaining, he's a good addition for a Maryland team that needs help in the backcourt.", "32. Wooga Poplar", "Old school: Miami | New school: Villanova", "Poplar averaged 13.1 points per game on 38.5% 3-point shooting for Miami in the 2023-24 season. The 6-5 guard also played a starring role for the Hurricanes during their 2023 Final Four run. While his defense could use some refining, the Philadelphia native is a great off-ball weapon with the athleticism to attack closeouts and finish at the rim.", "33. DJ Wagner", "Old school: Kentucky | New school: Arkansas", "Wagner finished the 2023 recruiting cycle ranked as the nation's No. 6 high school prospect, according to 247Sports. He displayed flashes of his elite potential during an SEC All-Freshman campaign at Kentucky but was inconsistent, shooting just 40.5% from the floor and 29.2% from 3-point range. Even though the 6-3 guard didn't turn out as a one-and-done superstar, his talent is clear and his ceiling remains high.", "34. Ryan Conwell", "Old school: Indiana State | New school: Xavier", "Conwell is a 6-4 guard who hit 40.7% of his 3-point attempts on 7.1 tries per game as a sophomore at Indiana State. He finished second on the team in scoring at 16.6 points per game and dished out 2.5 assists. Considering that Conwell also rates as a quality defender, he should be a key part of Xavier coach Sean Miller's effort to get the Musketeers back to the NCAA Tournament.", "35. Darlinstone Dubar", "Old school: Hofstra | New school: Tennessee", "Dubar is a 6-6 wing who averaged 17.8 points and 6.8 rebounds on 39.9% 3-point shooting for a 20-win Hofstra team. He began his career at Iowa State, starting seven games for the Cyclones in 2020-21. As a fifth-year player with a proven shot and good size, he'll be part of the committee tasked with helping Tennessee replace All-American guard Dalton Knecht. Former Alabama guard Aaron Estrada is a recent example of a quality high-major player to come through Hofstra.", "36. Dug McDaniel", "Old school: Michigan | New school: Kansas State", "McDaniel averaged 16.3 points and 4.7 assists while shooting 36.8% from 3-point range on 5.8 attempts for a bad Michigan team. The 5-11 guard also rated as the Wolverines' top defender, per evanmiya.com. Although his offensive numbers dipped against Big Ten foes, the former four-star prospect will help a Kansas State team needing to upgrade its guard play.", "37. Chucky Hepburn", "Old school: Wisconsin | New school: Louisville", "Hepburn started 103 games over three seasons at Wisconsin, establishing himself as a reliable floor general and defensive pest. The 6-2 guard is a career 36.2% 3-point shooter and earned Big Ten All-Defensive Team honors in the 2023-24 season while averaging 2.1 steals. He rated as the Badgers' most-efficient player and No. 2 defender this past season, per evanmiya.com.", "38. Saint Thomas", "Old school: Northern Colorado | New school: USC", "Northern Colorado produced a gem last cycle in Dalton Knecht. Can it come through again? Thomas is a vastly different player but nonetheless intriguing. At 6-7, he averaged 19.7 points, 4.2 assists and 1.7 steals while making 57.2% of his 2-pointers and 33% of his 3-pointers in 2023-24. The dynamic forward began his career at Loyola Chicago and has one season left to play.", "39. Arthur Kaluma", "Old school: Kansas State", "Kaluma averaged 14.4 points and seven boards per game while improving his 3-point percentage to a career-best 34.5% last season. The 6-7 forward has one season left to play after spending the first two years of his career as a starter for NCAA Tournament teams at Creighton.", "40. Aidan Mahaney", "Old school: Saint Mary's | New school: UConn", "Mahaney earned first-team All-WCC honors in both his seasons at Saint Mary's and was the conference's Freshman of the Year in the 2022-23 season. Though his efficiency dipped as a sophomore, the 6-3 guard is a natural shot-maker who could thrive in the right system. He's a career 37.5% 3-point shooter and often came up clutch in key situations for a team that secured a No. 5 seed in each of the past two NCAA Tournaments.", "41. Zeke Mayo", "Old school: South Dakota State | New school: Kansas", "Mayo earned Summit League Player of the Year after averaging 18.8 points, 5.7 rebounds and 3.5 assists for a South Dakota State team that won the conference. He's a career 38.8% 3-point shooter and scored 19 points on just 11 shots against Iowa State's vicious defense in an NCAA Tournament loss. There is a strong recent track record of Summit League Players of the Year transferring up. Max Abmas was the leading scorer for Texas this season after winning the award twice in his career at Oral Roberts. Baylor Scheierman has also been a star at Creighton the past two seasons after winning Summit League POTY at SDSU in 2022.", "42. Andrew Carr", "Old school: Wake Forest | New school: Kentucky", "Carr is a stretch four who shot 37.1% from 3-point range on 2.8 attempts per game for Wake Forest during his fourth season of college basketball. The 6-9 forward averaged 13.5 points per game for the Demon Deacons. He is skilled around the rim and serviceable defensively. Carr has one season of eligibility remaining.", "43. Otega Oweh", "Old school: Oklahoma | New school: Kentucky", "Oweh's production and efficiency dropped dramatically during the grind of Big 12 play after his sophomore season began with tantalizing glimpses of offensive promise. While his game remains a work in progress, the 6-5 wing is already a great defender. With two years left to play, Oweh can be an elite defensive stopper for Mark Pope's first UK team.", "44. Aden Holloway", "Old school: Auburn | New school: Alabama", "Holloway's upside as a former five-star prospect is clear. But after shooting just 31.8% from the field as a freshman at Auburn, he's got something to prove as he heads to rival Alabama with three seasons of eligibility remaining.", "45. Dre Davis", "Old school: Seton Hall | New school: Ole Miss", "Davis averaged 15 points per game and shot 35% from 3-point range in his second season at Seton Hall. It was the fourth season of college basketball for the 6-5 guard, who began his career at Louisville. He averaged 16.6 points, 6.6 rebounds and 2.6 blocks per game during Seton Hall's five-game NIT title run.", "46. Kobe Johnson", "Old school: USC | New school: UCLA", "Johnson stood out as an elite defender for USC, collecting 2.2 steals per game and rating as one of the top players on that side of the ball in the Pac-12. The 6-5 wing also scored 10.9 points per game in 2023-24. Though just a career 32.9% 3-point shooter, Johnson has some chops as a distributor and will be a plug-and-play veteran as he heads across town to play for UCLA.", "47. Javon Small", "Old school: Oklahoma State | New school: West Virginia", "Small averaged 15.1 points and 4.1 assists in his lone season at Oklahoma State after spending two years at East Carolina. The 6-2 guard hit 37.4% of his 3-pointers for the Cowboys, although that mark dropped to 31.8% in conference play. He should have the ball in his hands quite a bit for a West Virginia team that is rebooting under first-year coach Darian DeVries.", "48. Danny Wolf", "Old school: Yale | New school: Michigan", "Wolf averaged 14.1 points, 9.7 rebounds and 1.3 blocks for a Yale team that reached the second round of the 2024 NCAA Tournament. He is more fluid, nimble and versatile than a typical 7-footer. Wolf can attack defenders off the dribble, hit 3-pointers or post up. He has two seasons left, and his rare combination of size and tools make him one of this offseason's most interesting transfer prospects.", "49. Tyrese Hunter", "Old school: Texas | New school: Memphis", "Hunter started 71 games over his two seasons at Texas after winning Big 12 Rookie of the Year at Iowa State in 2021-22. Based on the trajectory he established with the Cyclones, Hunter seemed destined to become an all-Big 12 performer. It didn't work out that way, but the 6-foot guard is talented and in line to play a key role for Memphis.", "50. Myles Rice", "Old school: Washington State | New school: Indiana", "Rice defeated cancer and helped lead Washington State to its first NCAA Tournament since 2008. With coach Kyle Smith off to Stanford, it was no surprise to see Rice hit the portal. The 6-2 guard averaged 14.8 points, 3.8 assists and 1.6 steals for the Cougars and should have three seasons of eligibility remaining. He needs to improve his 3-point shot (27.5% on 3.7 attempts per game) and bulk up. But there is a lot to like about his trajectory for an Indiana team that desperately needed to upgrade its backcourt.", "51. A.J. Hoggard", "Old school: Michigan State | New school: Vanderbilt", "First-year Vanderbilt coach Mark Byington is reloading the Commodores with a collection of transfers. Hoggard is the biggest name of the bunch after an up-and-down four seasons under Tom Izzo at Michigan State. The 6-3 guard is a solid distributor and should have an opportunity to shine as a scorer.", "52. J'Vonne Hadley", "Old school: Colorado | New school: Louisville", "Though only a role player on a team oozing talent, the 6-6 wing did a lot for the Buffaloes, averaging 11.6 points, six rebounds and 2.4 assists. He attempted just 1.3 shots from 3-point range but hit 41.7% of them, and he was efficient inside the arc (56.5%). A significant role should be available to him at Louisville as the Cardinals reboot under new coach Pat Kelsey.", "53. Brandon Garrison", "Old school: Oklahoma State | New school: Kentucky", "Garrison showed glimpses of why he was a top-50 prospect and McDonald's All-American in the Class of 2023 during his freshman season at Oklahoma State. There are offensive strides to be made, but Garrison blocked 1.5 shots per game in just 22.7 minutes and has three seasons of eligibility remaining to continue realizing his potential.", "54. Dillon Mitchell", "Old school: Texas | New school: Cincinnati", "Mitchell made strides as a sophomore at Texas but still has untapped potential after ranking as a five-star prospect in the Class of 2022. The former McDonald's All-American is an athletic power forward who finishes well at the rim. If Wes Miller can unlock Mitchell's full abilities, the Bearcats could be a big winner from this portal cycle.", "55. Tre Donaldson", "Old school: Auburn | New school: Michigan", "Donaldson averaged 6.7 points, 3.2 assists and shot 41.2% from 3-point range in just 19.3 minutes per game at Auburn in 2023-24. With two years of eligibility remaining, the 6-2 Donaldson could be an impact player for the Wolverines as first-year coach Dusty May gets his program going.", "56. Meechie Johnson", "Old school: South Carolina | New school: Ohio State", "Johnson wasn't necessarily South Carolina's best all-around player, but the 6-2 guard did lead the Gamecocks in scoring at 14.1 points per game in 2023-24 during his second season in the program. Johnson began his career at Ohio State and will have one season of eligibility remaining as he returns to his home state to finish out his career with the Buckeyes.", "57. Lamont Butler", "Old school: San Diego State | New school: Kentucky", "Butler won Mountain West Defensive Player of the Year during his fourth and final season at San Diego State. The 6-2 guard's game is defined by dogged defense. Though he's just a 32.1% 3-point shooter, Butler may improve offensively in UK coach Mark Pope's more up-tempo scheme.", "58. Sean Stewart", "Old school: Duke | New school: Ohio State", "Stewart logged just 8.3 minutes per game as a freshman at Duke while stuck behind a logjam of frontcourt players that included Kyle Filipowski, Mark Mitchell and Ryan Young. But his splits were encouraging, and his athleticism came through in his limited spurts of action. The former McDonald's All-American has three seasons of eligibility remaining and could still blossom into an NBA Draft prospect.", "59. Roddy Gayle Jr.", "Old school: Ohio State | New school: Michigan", "Gayle is a physical perimeter player who can take defenders off the dribble and use his strength and athleticism to get good looks. He's just a career 33.1% 3-point shooter. But after averaging 13.5 points and 3.1 assists for the Buckeyes as a sophomore, Gayle should be a key contributor at Michigan as the Wolverines get started under first-year coach Dusty May.", "60. Milos Uzan", "Old school: Oklahoma | New school: Houston", "Uzan dished out 4.7 assists versus just 2.1 turnovers per game against Big 12 competition in the 2023-24 season. The 6-4 guard started 56 games during his two seasons with the Sooners and will be tasked with helping Houston replace beloved point guard Jamal Shead. He won't be handling that job alone -- few could -- but he'll be a big piece in keeping the Cougars in the Big 12 hunt.", "61. Lynn Kidd", "Old school: Virginia Tech | New school: Miami", "Kidd enjoyed a breakout season at Virginia Tech in 2023-24, averaging 13.2 points on 66.8% shooting. With Miami replacing Norchad Omier, Kidd should slot in nicely to his vacated slot as the Hurricanes seek to reclaim a winning trajectory following a down season.", "62. Eric Dailey", "Old school: Oklahoma State | New school: UCLA", "Dailey was a bright spot for Oklahoma State during a down season as he averaged 9.3 points and 4.8 rebounds while shooting 49.6% from the floor. Even if he doesn't start immediately for a reloading Bruins team, the 6-8 forward has three seasons left to play and ample promise as a versatile forward with the potential to impact both ends of the floor.", "63. Alijah Martin", "Old school: FAU | New school: Florida", "Martin was a three-time all-conference performer at FAU while appearing in 124 games across four seasons under Dusty May. The 6-2 guard is a good defender for his size and a career 36.9% 3-point shooter. He's more of a shooting guard than a point guard and has proven he can make substantive contributions to a winning program.", "64. Jalen Blackmon", "Old school: Stetson | New school: Miami", "Blackmon turned heads nationally with his 43-point outburst in the ASUN Tournament title game. The 6-3 guard hit 38.1% of his 3-pointers on 8.3 attempts per game in the 2023-24 season and is a career 90.6% free-throw shooter. The Indiana native has only one season of eligibility remaining and should be a difference maker for a Miami team that lost key players Wooga Poplar and Norchad Omier to the portal.", "65. Elijah Hawkins", "Old school: Minnesota | New school: Texas Tech", "Hawkins ranked third nationally in assists per game at 7.5 for Minnesota last season after spending his first two years at Howard. He proved his mettle as a power conference player and will have plenty of talent to distribute the basketball to as he joins a promising Texas Tech roster.", "66. Chris Youngblood", "Old school: South Florida | New school: Alabama", "Youngblood was the leading scorer for the AAC champions, averaging 15.3 points on 41.6% 3-point shooting for a 25-8 South Florida team. The 6-4 guard was the league's co-player of the year and should be an excellent fit with an Alabama program that prioritizes efficient 3-point shooting.", "67. Dante Maddox Jr.", "Old school: Toledo | New school: Xavier", "Given how productive transfer guards Quincy Olivari and Dayvion McKnight were for Xavier last season, it would be no surprise if the Musketeers' incoming crop of perimeter players produces in similar fashion. Maddox hit 42.4% of his 3-pointers in two seasons with the Rockets.", "68. Aaron Bradshaw", "Old school: Kentucky | New school: Ohio State", "Bradshaw struggled for minutes as a freshman while navigating a crowded Kentucky frontcourt. He was the No. 5 overall player in the Class of 2023, according to 247Sports, and he showed glimpses of promise during his lone season with the Wildcats. The 7-footer can step out and hit 3-pointers and is more mobile as a perimeter defender than most college centers.", "69. Javian McCollum", "Old school: Oklahoma | New school: Georgia Tech", "McCollum should have an opportunity to shine for Georgia Tech after averaging 13.3 points at Oklahoma last season. With Miles Kelly transferring out, the Yellow Jackets have plenty of playing time available, and McCollum's ability to play on or off the ball should make him a key cog in the lineup.", "70. Frankie Collins", "Old school: Arizona State | New school: TCU", "Collins is only a career 30.8% 3-point shooter, but he is an excellent perimeter defender. The 6-1 guard led the Pac-12 in steals at 2.6 per game during his second season at Arizona State. The former Michigan guard has one season of eligibility remaining and should play a huge role for a revamped TCU team.", "71. BJ Freeman", "Old school: Milwaukee | New school: Arizona State", "Freeman was a busy man the past two years at Milwaukee, leading a pair of 20-win teams in scoring. In 2023-24, he also led the Panthers in rebounds (6.6), assists (4.1) and steals (1.1). At 6-6, he's both a good solo shot creator and can facilitate for others He is among a trio of high-scoring mid-major veterans on the way to help Bobby Hurley's program.", "72. Jordan Pope", "Old school: Oregon State | New school: Texas", "Pope averaged 17.6 points and 3.4 assists while shooting 37.1% from beyond the arc for Oregon State as a sophomore in 2023-24. The 6-2 guard needs to improve defensively but is a proven high-major scorer with two years of eligibility remaining. He should play a key role for Texas squad losing guards Max Abmas and Tyrese Hunter.", "73. Jacob Crews", "Old school: UT Martin | New school: Missouri", "Crews shot 41.4% from 3-point range on 6.7 attempts per game as a junior for a UT Martin team that won a share of the OVC regular-season title. He also yanked down 8.2 rebounds per game for the Skyhawks. There are questions about his defense, but at 6-7 and with a good shooting stroke, he is a big pickup for Missouri. The Tigers are coming off a winless SEC campaign and need help.", "74. TJ Bamba", "Old school: Villanova | New school: Oregon", "Bamba started 33 games at Villanova in 2023-24 after leading Washington State in scoring in the 2022-23 season. He's a veteran, off-ball guard with good size at 6-5 and a career 38% 3-point shooting mark over four seasons.", "75. Adou Thiero", "Old school: Kentucky | New school: Arkansas", "Kentucky's most effective defensive lineups often featured Thiero. The tenacious 6-6 wing guards and rebounds with a voracious appetite and can score attacking the rim. He's just a career 32.3% 3-point shooter and doesn't have a refined offensive game. Still, his 80% free-throw shooting mark in 2023-24 portends promise, and he could shine in a greater role at Arkansas.", "76. Khalif Battle", "Old school: Arkansas | New school: Gonzaga", "Battle transferred from Temple to Arkansas for the 2023-24 season and finished second on the team in scoring at 14.8 points per game. The 6-5 guard is a streaky shooter capable of going off offensively against high-level opposition, as evidenced by the fact that he averaged 29.6 points per game over the Razorbacks' final seven contests. Gonzaga has other sources of perimeter firepower, but look for Battle to occasionally produce huge numbers.", "77. Kanaan Carlyle", "Old school: Stanford | New school: Indiana", "Carlyle averaged 11.5 points and 2.7 assists per game in his freshman season at Stanford after ranking as a four-star prospect in the Class of 2023. His best games came against Arizona and Washington State, which were both NCAA Tournament teams. With three seasons of eligibility remaining and a proven body of work at the high-major level, there is some upside here.", "78. Riley Kugel", "Old school: Florida | New school: Mississippi State", "Kugel is an interesting prospect with good tools and NBA upside; however, the 6-5 wing regressed as a sophomore while shooting just 31.2% from 3-point range. If he can push that closer to 40% and cut back on his turnovers, then Kugel could blossom into an impact 3-and-D player. Kugel committed to Kansas first before flipping to Mississippi State.", "79. Dain Danja", "Old school: Illinois | New school: Memphis", "As a burly big man, Dainja wasn't a great fit in Illinois' five-out offensive system. He played just 10.8 minutes per game during the 2023-24 season but was productive when on the floor. The 6-9 bruiser is an effective scorer in the paint, and he's a good rebounder and rim protector. If deployed properly, he could be a difference-maker for a Memphis team expected to compete for the AAC title.", "80. Tarris Reed", "Old school: Michigan | New school: UConn", "Reed will be a prominent member of the Donovan Clingan replacement committee at UConn after averaging nine points, 7.2 rebounds and 1.4 blocks as a sophomore at Michigan. He's a former four-star prospect with a big frame."]}