{"title": "The Russian Government", "timestamp": "\"2024-06-11 16:25:00\"", "content": ["The Government of the Russian Federation and the World Economic Forum have signed a memorandum creating a Centre for the Fourth Industrial Revolution in Russia. The signing took place at the Coordination Centre of the Russian Government.", "Acting under the instructions of Prime Minister Mikhail Mishustin, Deputy Prime Minister Dmitry Chernyshenko signed the memorandum for Russia, with World Economic Forum President, Borge Brende, signing for the WEF.", "The centre will facilitate the implementation of the WEF’s global projects in Russia, as well as help adapt the world’s best practices for Russian digital businesses. It will serve as a platform for bringing together leaders from across the global IT sector, manufacturing, research and business, as well as the leading Russian companies and government institutions for studying and introducing the latest IT solutions in Russia.", "Dmitry Chernyshenko said the Government, working with the regions and the business community, has been hard at work promoting the digital transformation, which was designated by President Vladimir Putin as one of the national goals. These efforts include, for example, moving public services online and converting to an electronic document flow to make life easier for people and for businesses. In keeping with the President’s instructions, the Government has been developing Russian software and seeking to boost demand for microelectronics.", "“Today, Russia is proactive in building a digital economy that encompasses all industrial sectors, the social sphere, as well as public administration. We are now witnessing unprecedented, breakthrough development. The main purpose of the Russian Centre for the Fourth Industrial Revolution is to raise awareness of Russia’s role within the global expert community and to exchange experience and expertise with the World Economic Forum and its partners around the world. Next year, together with the WEF, we intend to launch projects on an experimental legal framework, artificial intelligence and the internet of things. The first projects will be launched before the end of this year and will include autonomous transport, medicine and data processing. Russia has been actively implementing AI technology over the past few years. Today, there are more than 800 projects of this kind and some have already gained visibility on international markets. In general, cooperation with the WEF will be carried out in various areas such as data policy, urban mobility, export support and promotion of Russian IT technologies on foreign markets,” Dmitry Chernyshenko said.", "“Rapid technological discovery is disrupting our economic and social systems. Coordinated, impact-orientated action is needed to manage this change,” Borge Brende said. “The new Centre for the Fourth Industrial Revolution in Moscow will be an important part of the Forum’s global network. It is important we work across borders to shape a future that leaves no one behind.”", "Dmitry Chernyshenko added that the centre will be hosted by ANO Digital Economy. A corresponding agreement was also signed between the autonomous non-profit organization and the WEF.", "“We are delighted to join the global network of Centres for the Fourth Industrial Revolution. Our organization brings together leading digital companies in Russia. We will work together with these companies’ executives to explore and adapt the best international artificial intelligence, the Internet of Things, and data policy solutions, as well as other promising areas for the development of the digital economy. We will contribute to the promotion of Russian practices in other countries,” commented Yevgeny Kovnir, CEO of ANO Digital Economy.", "The Centre for the Fourth Industrial Revolution will help build up systematic collaboration and constructive dialogue between Russian IT companies, government and international agencies, as well as expert communities from around the world.", "The Deputy Prime Minister also noted that the centre will open on 15 October. Its key objectives for the next two months will be to set up an executive committee and draft a work plan for 2022.", "Launched in 2018 by the World Economic Forum, the global network of Centres for the Fourth Industrial Revolution is an international platform for cooperation focused on managing new technologies and digital transformation."]}