{"title": "Bridgerton showrunner teases 'extremely juicy' fourth season", "timestamp": "\"2024-06-14 11:41:01\"", "content": ["LONDON — Fans of the hit Netflix show Bridgerton can expect news of its fourth season \"sooner rather than later\", the series' writer and showrunner, Jess Brownell, said.", "The final four episodes of the third season started streaming on Thursday, wrapping up a highly-anticipated friends-to-lovers arc between characters Penelope Featherington and Colin Bridgerton.", "\"We want to give a few months for Pen and Colin to have their moment and enjoy their glory,\" said Brownell, who took the reins from series creator Chris Van Dusen as the new showrunner for the third season.", "\"We will be making an announcement about the next season sooner rather than later,\" she added.", "The Regency-era romance series is based on the books by Julia Quinn, with each focusing on a sibling of the Bridgerton family. The third season skipped the third book in Quinn's series about Benedict Bridgerton to focus on Colin and Penelope.", "The next season is in development, said Brownell, but fans will have to wait to discover which sibling takes the lead.", "\"I can tell you that it is going to be extremely juicy,\" she told Reuters at the launch of the second part of the third season in London.", "\"I think as a writer you sharpen your skills every season. And as a showrunner, I feel like I learnt on the job a lot this season, but now I'm really just enjoying myself and playing around and having a good time.\"", "Developed by Shonda Rhimes' television production company Shondaland and Netflix, Bridgerton is set in the early 1800s and follows the scandals and successes of the social season as young marriageable members of the nobility look for love.", "Rhimes, creator of shows such as Grey's Anatomy, Private Practise and Scandal is committed to keep going.", "\"We're very dedicated and we have eight books. It was always my intention. We have eight siblings, eight books, eight seasons. That's been my hope forever,\" she said."]}