{"title": "India summer: Eight more die as country faces 'longest' heatwave", "timestamp": "\"2024-06-11 05:43:04\"", "content": ["A severe heatwave continues to wreak havoc in India as the eastern state of Odisha on Monday reported eight deaths within a 72-hour period.", "Official figures released in May suggested 60 people died between March and May across India due to heat-related illnesses.", "But the number is likely to be much higher as heat-related deaths go under-reported in rural areas.", "Officials say India is in the middle of the longest heatwave it has seen since records began. Temperatures have crossed 50C in some areas recently.", "\"This has been the longest spell because it has been experienced for about 24 days in different parts of the country,\" Mrutyunjay Mohapatra of the India Meteorological Department (IMD) told the Indian Express newspaper.", "Parts of northern India have been experiencing extreme heat since mid-May, with temperatures hovering between 45-50C in several cities.", "Some areas of the country have also been impacted by water shortages, with extreme heat placing huge demands on supplies.", "Earlier this month, at least 18 polling officials deployed for the final phase of the general elections died of heat-related illnesses in Uttar Pradesh and Bihar states, authorities said.", "On 31 May, at least 33 people, including election officials, died of suspected heatstroke in Bihar, Uttar Pradesh and Odisha.", "The monsoon, which hit India's southern coast in Kerala state on 30 May, is expected to bring some relief as it spreads to northern parts of the country in the coming days.", "Is India ready to deal with extreme temperatures?", "Heat kills at least 15 in India as temperatures near 50C", "The IMD has predicted an above-average monsoon season for the country this year.", "But Mr Mohapatra said that \"heatwaves will be more frequent, durable and intense, if precautionary or preventive measures are not taken.\"", "The weather office has predicted heatwave conditions for northwest and eastern India for the next five days."]}