{"title": "‘Cull of the Wild’ questions sacrificing wildlife in the name of conservation", "timestamp": "\"2024-06-11 09:00:00\"", "content": ["Cull of the Wild", "Hugh Warwick", "Bloomsbury Wildlife, $28", "In the late 1860s, European colonists started importing hedgehogs into New Zealand. The goal: to make the unfamiliar landscape feel a bit more like home. Over the next 100 years, hedgehogs settled in most of New Zealand’s available habitat — and developed a taste for native bird eggs, lizards and invertebrates. Now, the hedgehogs are among the millions of animals killed worldwide each year in culls intended to protect vulnerable species and habitats. Some say culling is essential to conservation; others say it robs animals of their right to live.", "But for ecologist Hugh Warwick, the nuances of culling further complicate the already complex nature of conservation. In his latest book, Cull of the Wild, Warwick attempts to mediate between the wide-ranging approaches to culling (SN: 8/19/20; SN: 4/11/14). Part travel memoir, part philosophical treatise, Cull of the Wild is an honest, surprisingly tame read that asks hard questions of its sources, author and audience.", "“The essence of science is not that it knows everything, but that it continually challenges everything,” Warwick writes. “It is not just what we think, but how we think that needs challenging.”", "Warwick opens the book ready to do just that, laying out his prejudices as an ecologist, hedgehog expert and someone who is “vaguely vegan.” Though a bit winding, the resulting 300-page quest finds the author readily challenging these biases. Whether he’s interviewing a gamekeeper or diving into animal ethics, Warwick eagerly searches for middle ground in the ongoing battle that is wildlife management.", "The ecologist recruits an eclectic crew to highlight this middle ground. There’s Mike Swan, senior adviser to the Game & Wildlife Conservation Trust, who takes Warwick on a tour of the estate he manages for game bird shoots in Dorset, England. Swan culls foxes and crows to boost pheasant and partridge numbers for hunters. While Warwick is not a fan of hunting or culling, he recognizes Swan’s passion for nature, mind for conservation and desire to find humane ways to keep bird predators in check.", "Warwick also interviews Monica Engel, a conservationist from Brazil who earns a seal hunting license to better understand Canadian seal hunters and, in turn, natural resource management. “When I am out there, listening, I find it so sad that the hunters and the animal rights activists enter into this debate with often so much hate,” Engel tells Warwick. “It drowns out moderate voices, it stops progress.”", "These sources and their views make for the book’s most interesting parts. In one chapter, Warwick meets Tony Martin of the Waterlife Recovery Trust in East Anglia, England. Martin tracks American mink, imported into the British Isles in 1929 for the prized fur. Mink from fur farms soon started popping up in the British countryside; mink now prey on multiple riverside species, including the water vole, a rat-sized rodent already declining due to habitat loss. Using an armada of 800 floating traps, Martin’s team works to save the native species by culling this elusive predator.", "These “mink rafts” are live traps. The mink are later euthanized with an air pistol. Though gruesome, Martin’s approach has hints of compassion; he refuses to cull mink on England’s islands for fear that they’d starve to death in traps before anyone could collect them. He coauthored a 2020 paper outlining essential questions that ensure exterminations aren’t needlessly drawn out or doomed to fail. “I don’t enjoy killing animals,” says Martin, whose father ran a mink farm. “And if there was another way to restore our riparian ecosystems without killing mink, then I would be all for it. But until then, it is important that we do it as humanely as possible.”", "While much of the book focuses on species found in Warwick’s native United Kingdom, his pondering takes readers from a fenced-in preserve in New Zealand to the mouse-infested bird colonies of Gough Island in the South Atlantic.", "Warwick also touches on famous characters in the invasive species saga: Australia’s toxic cane toads, Burmese python escapees in the Florida Everglades, the “cocaine hippos” of Columbian drug trafficker Pablo Escobar (SN: 3/17/15). In many cases, eradication is either unfeasible or met with public opposition.", "Though culling is about invasive and native troublemakers, much of Cull of the Wild concerns itself with human exceptionalism. Dubbing us Homo occisor, or “man the killer,” Warwick likens humankind to “a fox in the chicken coop, instinctively driving the livable planet towards destruction.” Warwick reminds us that we often play “judge, jury and executioner — or at least supporters of those that are” when dealing with introduced species or damaged ecosystems. But to “play god” in the 21st century, Warwick warns, requires us to examine our prejudices about animal suffering and our motivations behind culling. “In its simplest form, this is head-versus-heart territory.”"]}