{"title": "Pfizer Stock Remains Near 11-Year Low Despite Promising Cancer Drug News — Is It Now A Sell?", "timestamp": "\"2024-06-12 16:57:19\"", "content": ["Despite a bevy of promising updates for its cancer treatments, Pfizer (PFE) stock remains trapped below a ceiling at its 200-day moving average in early June.", "X", "In one study, Pfizer's Seagen-acquired drug, Adcetris, reduced the risk of death by 37% for patients with diffuse large B-cell lymphoma. Patients who received Adcetris lived for a median of 13.8 months vs. 8.5 months for chemotherapy recipients.", "An Adcetris-containing regimen also succeeded in a Phase 3 study of patients with frontline Hodgkin lymphoma. Pfizer and partner Takeda Pharmaceutical (TAK) say the study adds to the body of evidence supporting Adcetris as a backbone treatment for specific lymphomas.", "And, last month, Pfizer unveiled positive results from a lung cancer study. The company tested its drug, Lorbrena, in patients whose tumors have a protein called ALK on the outside. After five years, 60% of patients were still alive. Lorbrena-treated patients had an 81% reduced risk of death.", "In other news, Pfizer beat first-quarter expectations thanks to a one-time benefit from its Covid drug, Paxlovid. Pfizer is also tacking on new drug approvals. The Food and Drug Administration signed off on Tivdak, another drug acquired alongside Seagen, for patients with recurrent or metastatic cervical cancer.", "U.S. regulators also approved Pfizer's gene therapy for hemophilia B, Beqvez. It will cost $3.5 million for a one-time treatment. And European regulators gave Pfizer the nod for Emblaveo, a treatment for some bacterial infections that resist other drugs.", "But Pfizer stock hit its lowest point since January 2013 in April. Shares have risen about 10% since then, as of the close Tuesday. So, is PFE stock a sell right now?", "Pfizer Stock Fundamentals: 'Massive' Upside", "Leerink Partners analyst David Risinger said there was \"massive\" upside in Pfizer's first-quarter report.", "Adjusted earnings fell 33% to 82 cents per share, but walloped expectations for 51 cents, according to FactSet. Sales also tumbled 20% to $14.88 billion, but topped forecasts for $13.87 billion.", "As expected, sales of Comirnaty, the Covid shot Pfizer developed with BioNTech (BNTX), plummeted 88% to $354 million. Sales also missed projections for $446.5 million. Excluding the impact from Paxlovid and Comirnaty, total sales rose 11%. Analysts polled by FactSet expect Comirnaty sales to hit annual low points each second quarter.", "Vyndaqel proved to be a bright spot in the quarter. Sales skyrocketed 66% to $1.14 billion, topping calls for $895.2 million. Vyndaqel treats cardiomyopathy due to hereditary transthyretin-mediated amyloidosis. In this condition, abnormal protein builds up on the heart tissues, causing problems.", "But sales of migraine treatment Nurtec came in at $178 million, up just 7% and below forecasts for $316.5 million.", "For the second quarter, Pfizer stock analysts forecast earnings of 45 cents per share and $13.03 billion in sales. Earnings are expected to dive 33%. But sales are expected to edge 2.3% higher. This could be the first quarter of sales growth since the fourth quarter of 2022.", "Investors are encouraged to seek stocks with 20%-25% recent sales and earnings growth. Pfizer is not hitting those marks. Big institutional investors — who account for up to 70% of all market trades — usually look for stocks with accelerating earnings and sales growth.", "Pharmaceutical Company's Annual Metrics", "Pfizer's sales have fallen markedly since hitting a record in 2022. Last year, sales tumbled 42% to nearly $58.5 billion. Top sellers included Comirnaty and Paxlovid, which brought in a $11.22 billion and $1.28 billion, though sales tumbled a respective 70% and 93% year over year.", "Blood thinner Eliquis generated $6.75 billion in sales, up 4% on a strict, as-reported basis. Prevnar sales inched 2% ahead to $6.44 billion.", "But other key products saw downfalls. Revenue from Xeljanz, which treats inflammatory conditions, fell 5% to $1.7 billion. Sales of Enbrel, developed with Amgen (AMGN), toppled 17% to $830 million. Pfizer sells Enbrel outside the U.S. and Canada.", "For 2024, Pfizer expects adjusted earnings of $2.15 to $2.35 per share and $58.5 billion to $61.5 billion in sales. At the midpoints, earnings would climb more than 22% as sales rise almost 3%.", "Pfizer Stock And Recent News", "Pfizer recently said its respiratory syncytial virus vaccine, Abrysvo, proved effective against both RSV A and B across two seasons. The company also unveiled promising results in people age 18 to 59 years old with underlying conditions.", "Pfizer is competing against GSK (GSK)'s Arexvy, which hit the market about the same time in 2023. Moderna (MRNA) also just gained approval for its RSV vaccine.", "Pfizer also won FDA approval for Beqvez, its gene therapy for hemophilia B. Beqvez will rival Hemgenix from CSL Behring and Uniqure (QURE). Hemgenix gained U.S. approval in late 2022 and also costs $3.5 million before insurance deductions and reimbursement.", "Pfizer also recently said its new drug, Adcetris, improved overall survival, progression-free survival and overall response rates in patients with diffuse large B-cell lymphoma. Progression-free survival is how long patients live before their cancer worsens. The company added Adcentris to standard cancer drugs lenalidomide and rituximab. It compared the regimen to lenalidomide and rituximab plus a placebo.", "\"The results are particularly encouraging because the study evaluated heavily pre-treated patients, including some who received prior CAR-T therapy,\" Pfizer's Chief Development Officer Roger Dansey said in a statement. CAR-T drugs are developed using a patient's own immune cells.", "Technical Analysis: PFE Stock Tops 50-Day Line", "Pfizer stock is trading just below its 200-day moving average, but topped its 50-day line on May 1 after reporting its first-quarter earnings, MarketSurge shows. It's important to note that shares are not forming a chart pattern for investors to watch.", "On April 18, shares hit their lowest point since January 2013.", "(Related: Keep tabs on chart patterns by visiting IBD's MarketSmith.com.)", "Shares of Pfizer have a Composite Rating of 30 out of a best-possible 99. The measure weighs a stock's key growth metrics against all other stocks. Leading stocks tend to have Composite Ratings of 95 or better, according to IBD Digital.", "Pfizer stock has a Relative Strength Rating of 22 out of a best-possible 99. The RS Rating measures a stock's 12-month running performance against all other stocks. That RS Rating means Pfizer stock ranks in the bottom 22% of all stocks in terms of performance over the last year.", "The pharmaceutical company's EPS Rating, a measure of profitability, is 32 out of a best-possible 99. The EPS Rating compares a stock's recent and longer-term earnings growth against all other stocks.", "Is PFE Stock A Sell?", "Based on savvy rules of investing, PFE stock isn't a sell right now. Shares haven't decisively undercut their key moving averages in some time. But shares also aren't a buy right now.", "Pfizer stock still has to prove its fundamental and technical merit. Also, shares aren't forming a chart pattern with a clear entry for investors, despite recently regaining ground and topping their 50-day moving average.", "It will be important to watch how Pfizer stock performs as the company shores up its pipeline and seeks new approvals in its efforts to move beyond the astronomical growth it saw at the height of the pandemic. Though it has a booster Covid shot, like rivals Moderna and Novavax (NVAX), analysts don't expect sales to ever hit their pandemic-era growth.", "Instead, the Street is closely watching the adult RSV vaccine, which hit the market at the same time as a competitor from GSK. Pfizer's efforts now that it owns Seagen could also be key to future growth.", "To find the best stocks to buy and watch, check out IBD Stock Lists. Make sure to also keep tabs on stocks to buy or sell.", "Follow Allison Gatlin on Twitter at @IBD_AGatlin.", "YOU MAY ALSO LIKE:", "Biotech Stocks To Watch And Pharma Industry News", "Want To Get Quick Profits And Avoid Big Losses? Try SwingTrader", "IBD Stock Of The Day: See How To Find, Track And Buy The Best Stocks", "Watch IBD's Investing Strategies Show For Actionable Market Insights"]}