{"title": "A Book Outlines the Social Study of Science", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["Until the middle of the 20th century, few thought of science as a social system, instead seeing scientific discovery as the work of individual geniuses. Columbia’s Department of Sociology played a pivotal role in advancing the social study of science. Researchers from the Columbia program analyzed how science works as a social institution, exploring its norms, values, and structure.", "Smoother Pebbles presents a collection of essays authored or co-authored by Jonathan Cole, John Mitchell Mason Professor in the Department of Sociology. The essays trace the development and institutionalization of the sociology of science. Spanning from the 1960s to the 2020s, and including both empirical and theoretical studies of science, the book is wide-ranging in its answers to core questions. Are scientists rewarded for the merits of their work or for other reasons? How does the system of social stratification in science operate? Has the funding of scientists been the result of an old boys’ network? How fair is the peer review process? In what ways does science fall short of its universalistic ideals? What factors have constrained opportunities for women in science? How has science fared amid attacks on academic freedom and free inquiry at universities?", "Columbia News caught up recently with Cole to discuss the book, along with what he’s read lately and what’s next on his reading list, and who he would invite to his ideal dinner party.", "Why did you write this book?", "Every scholarly and scientific specialty has a history. We often lose sight of how these specialties grow. I wanted to provide a historical record of the origins and early development of the sociology of science in the United States. There is rarely a definitive original work that spawns a specialty, but some people and their work can be located near or at the beginning.", "Columbia’s non pareil sociologist, Robert Merton (1910-2003), was one such person. The sociology of science might be traced back to his Harvard doctoral dissertation on science and technology in 17th-century England, or his paper on priorities in scientific discoveries, but the institutionalization of the specialty began in the 1960s and 1970s, when Merton recruited three of his students to begin systematic work in the study of the social structure of the scientific community.", "Scientists were initially quite skeptical about sociologists studying science. Some of Merton’s essays have been collected; I wanted to expand that corpus by publishing essays that were produced by me and some of those in collaboration with my two colleagues, Harriet Zuckerman and Stephen Cole, who was a sociology professor at Stony Brook University. I also wanted to provide examples of the theoretical and empirical work that Columbia’s program in the sociology of science produced. There were others who helped enormously in developing the specialty, but the Columbia program was certainly among the leaders of the movement.", "Can you provide some examples from the book of how Columbia’s sociology department advanced the social study of science?", "Our work in the sociology of science showed how faculty and students in the department approached sociological problems. First, we were always looking for interesting questions that needed to be addressed with empirical evidence. We rarely worked from data to theory. Second, we were interested in examining problems of values, norms, and social structures that would influence behavior. We collected data to test ideas. Much of the early work depended on the analysis of small datasets because we did not have the technology to analyze larger ones. For example, we used to calculate correlation coefficients by a hand machine. There were no high speed, or even low speed, computers at the time. Third, we were examining problems of reward systems, social stratification, inequality, and fairness within science to convince those skeptical scientists and others that their communities could be examined by sociologists and other social scientists in ways similar to their focus on other institutions.", "What books have you read lately that you would recommend, and why?", "In connection with my teaching, I’ve recently re-read some exceptional books about freedom, inequality, and democracy by Columbia scholars. One is Eric Foner’s The Second Founding: How the Civil War and Reconstruction Remade the Constitution. It is a beautifully written discussion of freedom and the passage of the post-Civil War 13th, 14th, and 15th amendments. I would also recommend his The Fiery Trial: Abraham Lincoln and American Slavery. Another book is Joseph Stiglitz’s The Price of Inequality, which is one of the most lucid and compelling works on the causes and consequences of inequality in the U.S.", "Andrew Delbanco’s The War Before the War, about the debates and commitments over the Fugitive Slave Act and its consequences, should be read by anyone interested in American history and the events leading up to the Civil War. Finally, everyone, I think, ought to read W.E.B. DuBois’s The Souls of Black Folks.", "What’s next on your reading list?", "As a Columbia undergraduate, I took a course on the modern novel offered by Lionel Trilling. A student in that class asked Trilling why he taught the same books each year for perhaps 20 years. Didn’t he get tired of teaching them? Trilling responded by saying, “The words on the page are the same, but I am different.” I believe this is true. So I re-read books I loved in the past. This summer, beyond my scholarly work, I hope to read again Jane Austen’s Persuasion, George Eliot’s Middlemarch, Mark Twain’s The Adventures of Huckleberry Finn, and Edith Wharton’s The Custom of the Country. I want to see how much my point of view has changed.", "What’s the most surprising and/or unexpected thing you learned recently from a book?", "Many Americans believe that the American dream is dead—that young people today, especially children of immigrants, have more limited opportunities for advancement than their parents. I just read a book by Ran Abramitzky and Leah Boustan, Streets of Gold: America’s Untold Story of Immigrant Success. Following 10 years of extensive research based on analysis of large numbers of immigrants and their children, the authors found that the prevailing belief is wrong. There is a great deal of social mobility among the children of immigrants—and this includes almost all immigrant groups. For me, this only reinforces the need for better ways for us to establish fact from fiction.", "Not long ago, I also read David Maraniss’s A Good American Family: The Red Scare and My Father, a very well written book about how a family lived through the second Red Scare and the harassment by the House Un-American Activities Committee during the McCarthy Era. Maraniss’s father was called to testify, refused to comply with the committee’s demands, and didn’t name names. He was subsequently fired from his job. Since I had a similar experience growing up, this book resonated with me, and should be on the reading list of anyone interested in populism and authoritarian movements in this country and abroad.", "What did you teach this semester?", "I taught two courses. In my undergraduate seminar, Law, Science, and Society, we discuss difficult subjects related to the interplay between law, the explosion of scientific knowledge and how that comes about, and the way fundamental problems in America today are affected by both the evolution of legal doctrine and the discoveries of science—made largely at our research universities.", "My graduate seminar, which I co-taught with Akeel Bilgrami, is called Freedom: Inequality, Populism, and Democracy. We have distinguished guest speakers—experts in these three areas—whose talks are followed by group discussions of each week’s major theme. These seminars with Professor Bilgrami have led to the publication of two volumes of essays: Who’s Afraid of Academic Freedom? and Unfreedom in Liberal Democracies.", "Any new projects you’re working on?", "I’m working on a book with a collaborator about what the modern research university ought to look like in 30 or 40 years. It is a normative book in which I discuss how I believe universities need to change to become better institutions and remain preeminent. It can be thought of as a follow-up to my two most recent books on universities: The Great American University and Toward a More Perfect University.", "Which three academics/scholars, dead or alive, would you invite to a dinner party, and why?", "I have a large dining room, so I’m going to invite five people (not alive, and not limited to scholars) to dinner. I would like to meet them, see them interact, and hear them discuss a wide variety of subjects. They are: Richard Feynman, Barbara McClintock, George Balanchine, Paul Robeson, and Edward Said.", "I would like to learn, if I could, how these enormously creative people think; how they arrived at the work that they did; how they persevered through hardship; and what some of their lesser-known passions were. I met McClintock once, and felt that she was capable of thought on a different plane from most of us. And I knew Said well before his untimely death. I want to hear their voices again."]}