{"title": "Consider higher prices for items with digestive, free-from claims", "timestamp": "\"2024-06-10 12:00:00\"", "content": ["WESTCHESTER, ILL. — During these inflationary times, consumers are being more selective when choosing to purchase higher-priced items. Free-from claims and health benefits, especially digestive health, are leading them to spend up to 30% more in some instances, according to data that Westchester-based Ingredion, Inc. gathered through its ATLAS database, which spans more than 33 global markets and over 100,000 consumer interviews.", "When asked what benefits they would pay more for, 78% of respondents in the 2023 data said natural/all natural, followed by health benefits such as digestive health and immunity in second place at 77%. Rounding out the top six answers were organic at 75%, no artificial ingredients at 74%, no additives/e numbers at 71% and non-GMO at 70%.", "When asked how much more they would pay for natural/all-natural products, 16% said they would pay 30% more, 17% said they would pay 20% more and 23% said they would pay 10% more. The percentages for digestive/health immunity benefits were 14%, 17% and 23%, and the percentages for no artificial ingredients were 12%, 16% and 22%. Protein scored highly, too, with the same percentages as no artificial ingredients: 12%, 16% and 22%.", "Recent news has spurred interest in digestive health and protein.", "“These are topics that have been on the media, on the news and addressed by athletes, by celebrities, by health officials for a long time, especially digestive health but also protein,” said Joana Maricato, global insights research manager for Ingredion.", "She added, “Digestive health products usually are bringing a benefit that consumers can feel in their bodies.”", "The data showed consumers of the ages 18 to 34 and those with children primarily are the ones who will pay more for added features and benefits.", "Ingredion has issued its clean label report from the ATLAS database every two years for a 10-year span. Three trends have emerged in that time, Maricato said.", "“Clean label started very much towards natural ingredients, no artificial ingredients, ingredients that were familiar to people,” she said. “It then moved onto a stage where there started to evolve free-from claims.”", "Claims such as gluten-free, non-GMO and free from soy became clean label as well.", "“Now we are seeing another interesting development as well, which is clean label being all about simpler ingredient labels but also a connection with sustainability,” Maricato said."]}