{"title": "Newsboys United Announces They Will Split After Summer Tour", "timestamp": "\"2024-06-13 00:00:00\"", "content": ["Christian band Newsboys United announced on Sunday that it will be disbanding following the impending departure of its two original members.", "In a Facebook post, the band members, including Michael Tait, Duncan Phillips, Jeff Frankenstein and Jody Davis, expressed their gratitude to Phil Joel and Peter Furler as they embark into a new journey in their career without the pair, Christian Headlines reported.", "\"Peter and Phil, we can't thank you enough for the time spent with us during this season, the creativity you have contributed, and the memories we have made together. We will always be your biggest supporters and friends,\" they said.", "The band members also shared how they enjoyed the time by having Joel and Furler in the group.", "\"Four years ago, when Peter joined us on The Cross Has the Final Word, we never could have dreamed that a collaboration on a single song would turn into what it did. After three years of Newsboys United with Peter and Phil, we've traveled North America together, performed hundreds of concerts, rekindled old friendships, made lots of new memories, had a LOT of laughs, and released an album.\"", "But the post mentioned that the group will be performing on four more live shows together before \"closing\" the chapter as Newsboys United. The band will be at the Lifest Music City in Tennessee on July 29, South Bend, Indiana on Aug. 13, as well as in Duluth and Albert Lea in Minnesota on Aug. 6 and 7, respectively.", "Last June, the Newsboys dropped the song, \"Magnetic,\" which is the lead single of their upcoming project in the fall.", "\"When we came up with the song title 'Magnetic', it was a pretty powerful and sobering thought to think how God continuously chases after us. He is relentless. His love and mercy are a force that constantly pull and draw us to Him. We can never escape, thank, God,\" Tait told The Christian Beat (TCB).", "In January this year, Joel also released his own EP, \"Better Than I Found It.\" Speaking to TCB, he said recording the songs was perfect timing since he has been thinking about the responsibility of mankind to take care of each other, the country and the world.", "He pointed out that the current circumstances have forced people to think about the future and the world they want to live in, adding that it is time to question \"where we are\" and how it came to be. He revealed that in the songs, he tackled those questions, reflected on the struggles and presented the hope of a better future.", "Newsboys is an Australian Christian rock band, founded in the late 1980's, with Furler, Joel and John James as core members. James left the group in 1998 and was succeeded by Furler as lead vocalist. But in 2009, Tait took over as the group's frontman when Furler pursued a solo career.", "In 2011, the band released the album, \"God's Not Dead.\" The title track of which became the soundtrack of the first installment of the movie series that bears the same title in 2014."]}