{"title": "Taylor Swift Claims Her Pro-Abortion, Pro-LGBT Stand Is ‘Real Christianity’", "timestamp": "\"2024-06-13 00:00:00\"", "content": ["Taylor Swift believes that upholding abortion and the LGBT agenda defines Christianity.", "Swift has been showing her support for the LGBTQ+ community and abortion through her music and endorsing a politician such as Phil Bredesen who aligns with her beliefs, CBN News wrote.", "In a clip of her Netflix documentary \"Miss Americana,\" Swift can be seen arguing with her dad and publicist over her stand on politics.", "\"This was a situation where, from a humanity perspective and from what my moral compass was telling me I needed to do, I knew I was right, and I really didn't care about repercussions,\" she said.", "The singer also stated that the policies of Republican Marsha Blackburn, a staunch conservative who opposes abortion and same-sex marriage, do not represent \"Tennessee Christian values.\"", "\"I can't see another commercial and see Marsha Blackburn disguising these policies behind the words 'Tennessee Christian values'. Those aren't Tennessee Christian values. I live in Tennessee. I'm a Christian. That's not what we stand for.\"", "Swift has also expressed her support to the LGBTQ+ community through her single, \"You Need to Calm Down.\"", "Swift articulated her stand on abortion while speaking to The Guardian in 2019.", "\"I mean, obviously, I'm pro-choice... I can't believe we're here. It's really shocking and awful. And I just wanna do everything I can for 2020. I wanna figure out exactly how I can help.\"", "In addition to Swift, other personalities have also declared their own definition of Christianity based on their unbiblical perspective.", "Lady Gaga has reportedly called herself a Christian but criticized Former Vice President Mike Pence on his biblical definition of marriage which is a union of a man and a woman. In her Las Vegas concert, she is said to have condemned Pence on his Christian views.", "\"And to Mike Pence, who thinks it's acceptable that his wife works at a school that bans LGBTQ, you are wrong. You say we should not discriminate against Christianity; you are the worst representation of what it means to be a Christian,\" she said.", "She further said that she is a Christian and that what she knows about Christianity is that they \"bear no prejudice and everybody is welcome.\"", "Meanwhile in the political scene, Pete Buttigieg, an openly gay former mayor from Indiana and Democratic presidential candidate, stated that he is a homosexual Christian. Evangelist Franklin Graham defied Buttigieg's statement saying that a person cannot change the Bible to fit his or her own beliefs.", "\"Mayor Buttigieg says he's a gay Christian. As a Christian, I believe the Bible which defines homosexuality as sin, something to be repentant of, not something to be flaunted, praised or politicized. The Bible says marriage is between a man & a woman-not two men, not two women,\" Graham said.", "\"Buttigieg made the comment, 'the condition of my soul is in the hands of God'...Mayor Buttigieg is absolutely right-His soul is in the hands of God, so is everyone's,\" he continued.", "\"He also says that he's a Christian and wants to become the first openly gay president in America's history. What's wrong with that picture? In reality, being a Christian isn't just a title we select or a church membership. It is a faith in God and His Word that transforms our lives to be more like the One we follow-Jesus Christ,\" the evangelist further said."]}