{"title": "Tony Parker Adéquat Academy: some news for the sport enthusiasts", "timestamp": "\"2024-10-31 14:00:00\"", "content": ["Everybody know Tony Parker, the international star of modern sport. Born in 1982 in Belgium, Tony Parker is a major international Franco-American basketball player. He is considered as one of the GOATs, and ended his professional career in 2019. But his career continued as manager and entrepreneur with the creation of the Tony Parker Adéquat Academy, a new format of sports-studies campus which main objective is to ensure a job to all its students.", "A school focused on professionalisation", "“The different experiences I had have led me to think an Academy which will do everything possible to get every young person to succeed in the professional world”, said Tony Parker on the school presentation website. Because, “it’s important to support young passionate by exposing them early to the business world”. This is the concept in focus: to benefit from an environment of partners, including companies and speakers from the territory, to build efficient bridges with the professional world.", "The Tony Parker Adéquat Academy is open to all young girls and boys aged 15 and up, recruited on application, to “fully live your passion” through a tailor-made programme supervised by a team of professionals with quality infrastructures. Official programmes are augmented and students benefit from an enriched learning experience, with an individual support, adapted school timetable and “adjusted teaching materials with the “the guarantee of getting a job offer at the end of studies”.", "More in the basket than basketball", "School education starts as early as high school up to degrees in higher education. Academy students may, depending on their age and recruitment level, study their Baccalauréat in the school, choose preparatory careers with intensive activities (basketball, esport, chess and more) or attend post-baccalauréat training courses in study courses leading to hobs in business or sport administration.", "For the teaching aspect, though sports, and specifically basketball, is a central part of education, additional trainings are possible, including in esport. Esport is an electronic sport including the individual or team practice of a videogame through electronic tools (computer, mobile phone, tablet, console). In addition to such sports practices, the Academy also offers training sessions or presentation courses and classical music courses.", "Saint-Ouen, for a better democratisation of excellence"]}