{"title": "BenFred: As preseason hype pours in for Mizzou football, this player doesn't seem to get enough", "timestamp": "\"2024-06-15 08:00:00\"", "content": ["Around this time last year, Missouri football coach Eli Drinkwitz was trying to convince his team few believed a special season was possible for the Tigers.", "He didn’t have to work very hard at it.", "Drinkwitz was entering a pressurized fourth season beneath a then (now former) athletics director who hadn’t been as warm as some others on his most recent contract extension. He was still searching for his first Mizzou season finished on the right side of .500.", "Among other reasons for hesitation ...", "New offensive coordinator Kirby Moore was unproven. No one knew much, if anything, about running back option Cody Schrader, who would emerge like a locomotive to lead the SEC in rushing. When Drinkwitz foreshadowed returning quarterback Brady Cook being the lead challenger in what was described then as a quarterback competition — it never turned out to be much of one — the feedback from fans was mixed, at best.", "My, how things have changed.", "Coming off an 11-win season and a crescendo that was a Cotton Bowl win against Ohio State, the Tigers finished the 2023 season ranked No. 8 in the final Associated Press Top 25. They will enter this 2024 season with a similar ranking and, compared to last season, a very different internal dialogue.", "Instead of hanging up bulletin board material at a rapid rate, Drinkwitz is now probably trying to convince his team to remember where all this new hype — former Alabama coach Nick Saban would prefer the term “rat poison” — is coming from. Answer: From the same folks who thought little of the Tigers not so long ago, back before Drinkwitz beat out the now-retired Saban for SEC coach of the year.", "ESPN’s Football Power Index recently assigned the Tigers the No. 10 spot in its preseason attempt to rank the nation’s best teams. That’s ahead of programs like Florida State, defending champion Michigan and LSU, the team that poached Mizzou’s defensive coordinator Blake Baker this offseason. Whatever numbers ESPN cooks into its FPI gumbo sees the Tigers as the sixth-best team in the SEC. Remember, there are 16 teams in it now. Its order is Georgia, Texas, Alabama, Oklahoma, Tennessee and then Mizzou. Not exactly insulting, is it?", "The preseason rankings from the notable college football magazines are trickling in as well, and feedback is warm and fuzzy there, too.", "Athlon has the Tigers No. 10 in the nation. Lindy’s has them No. 9. The most negative take you will read about Mizzou is accurate commentary on the Tigers’ schedule being very inviting for an SEC team; a counterpoint says that means a potentially easier path to the newly expanded College Football Playoff if all goes well.", "A good coach knows what his players need to hear and feeds them selected messaging accordingly. Last year’s MU group had, “something to prove.” This season’s team won’t find many naysayers. What it can find, though, is where the praise isn’t coming.", "For a team receiving as much preseason flattery as Mizzou, little of it seems to be going the way of the returning starting quarterback who came up big when it mattered most during a breakthrough campaign. It’s awful quiet around Cook.", "Last season Cook and his healed throwing shoulder completed 244 of 369 pass attempts (66.1 percent) for 3,317 yards. He averaged 9 yards per attempt and threw 15 more touchdowns (21) than interceptions (6). His passer rating read 157.2 at the end of a season in which he averaged 255.2 passing yards per game.", "Here’s where some of those numbers rank among returning SEC quarterbacks: 66.1 completion percentage (third); 9 yards per pass attempt (fifth); 157.2 passer rating (fifth); 255.2 passing yards per game (fourth).", "Ballyhooed Georgia quarterback Carson Beck and Alabama’s Jalen Milroe are tied for first among SEC returners who threw the most passes of 40-plus yards last season (15). It’s a three-way tie, though. Cook was right there with them, while doubling up Beck in rushing touchdowns. Milroe (12) is the league’s only returning QB who ran for more touchdowns than Cook and Ole Miss’ Jaxson Dart (eight each). You don’t hear much about Cook being one of the SEC’s most dangerous dual threat QBs. Maybe you should.", "ESPN unearthed this Cook nugget in a recent analysis piece on college football’s returning QBs. Since November 19, 2022, when Mizzou began a winning trend that now includes 13 wins in the last 16 games, Cook has completed 65.3 percent of his passes, averaged 7.7 yards per drop-back and protected a 4.83 touchdown to interception rate. Those somewhat wonky numbers are notable because of the few others who also checked the same boxes, or better. Cook’s company in this department includes LSU’s Heisman Trophy winner and No. 2 NFL draft pick Jayden Daniels, Oregon QB and No. 12 draft pick Bo Nix, Oklahoma turned Oregon star Dillon Gabriel and USC’s Caleb Williams, the No. 1 overall NFL draft pick. That same ESPN breakdown slotted Mizzou in college football’s third tier of 2024 quarterback situations. Huh?", "Cook will stiff-arm it. His coaches and teammates should chew and stew on it.", "Last season Cook improved in just about every single area, from accuracy, to executing deep throws, to being more efficient and effective with his ground game. It’s not outlandish to think he can build on all of those things again as a senior. He has loads of familiarity with Moore, a stocked stable of pass-catchers led by star receiver and Heisman Trophy hopeful Luther Burden and a reloaded offensive line, thanks to the transfer portal. A running back needs to step up, but remember, Cook can run, too.", "Normally the quarterback position is a nationally notable program’s most overhyped name. It’s something close to the opposite at Mizzou. If the Tigers indeed wind up being a top-10 team, will it not be because they are led by one of the most effective quarterbacks in the SEC?", "Even in an offseason full of fresh rat poison there’s always some good bulletin board material to be found.", "COLUMBIA, Mo. — Early in Laird Veatch’s tenure as Missouri’s athletics director, he did the rounds of the grounds.", "Veatch met with every head coach. He talked with sport-specific administrators, facility staff and business personnel. And he toured all of MU’s athletic facilities.", "His takeaway: There are some fixer-uppers.", "“The Memorial Stadium improvement project is unquestionably the No. 1 thing that we need to be focusing on,” Veatch told the Post-Dispatch. “But there are some key things that need to be done that aren’t wants, they’re needs — particularly related to our playing surfaces and a few of our sports: baseball, track, soccer, tennis. We have some things that just need to be done.”", "A planned renovation of Memorial Stadium’s north concourse that will add premium seating and event space to the tune of $250 million is expected to wrap up in time for the 2026 football season. Though the project was approved by university administration just before Veatch’s hire, fundraising for its completion has been one of his immediate priorities.", "Since seeing some of the other facilities, like baseball’s Taylor Stadium, soccer and outdoor track’s Walton Stadium, and the Mizzou Tennis Complex, which hasn't been hosting the Tigers' home events, Veatch has a sense of urgency about renovations to other facilities.", "He also sees a role for himself in making them happen.", "“The advocacy from me on those playing surfaces and the basic things needs to be, ‘We gotta find a way — we gotta find a way as soon as possible,’ ” Veatch said, “whether that’s working with donors, working with our institutional partners, finding a way within our budget process to make some of those things happen.”", "The sentiment that some of Mizzou’s athletic facilities — particularly the three Veatch highlighted — need upgrades is not a new one. Broad renovations across MU’s stadiums were part of a facilities master plan announced in October that never left a closed session UM System Board of Curators meeting.", "Specifics of the master plan have yet to emerge. When the Post-Dispatch submitted a public records request for the document, the university system declined to release the plan because “it was not presented in public session and the deliberative decision-making process related to the plan continues.”", "It seems there were quite a few facility upgrades included in the plan.", "The proposed course of action “would impact every Mizzou sports program and feature sequential construction projects to address current facility needs,” according to Mizzou Athletics’ announcement of the plan, which came before a November Board of Curators meeting. In addition to the north concourse project, the facilities master plan floated “the construction of several new competition venues and practice facilities,” per the same announcement.", "All that emerged from the Curators’ lengthy executive session in November was the Memorial Stadium upgrade.", "As a result, there’s a promise that the additional revenue created by that renovation will cover other athletics department expenses, like facility upgrades.", "“It’s been encouraging to me how the vast majority of people I speak to here see the big picture and they recognize the importance of football and the impact that has — not just for football but for everyone else,” Veatch said. “When I say, even in my (introductory) press conference, how important that is, it's not just because I played football or I love the game or recognize it's our biggest revenue driver. It's because it has such a bigger impact on everyone involved, and the best way for us to get to a point where we can really move some of these other projects forward is by getting the football stadium done.”", "Set in motion before Veatch’s arrival, that’s how facility renovations will proceed at Mizzou.", "“Really from a competitive, safety and security standpoint we’ve got to get some of those things shored up,” Veatch said. “And — let me say ‘and’ instead of ‘but’ — I do believe in the future there’ll be some significant developments we can do with our other sports as well. But for now, we’ve got to solidify our football resource and then be able to focus on some of the bigger things down the road.”", "Missouri is coming off its best football season in decades, has many key players returning including quarterback Brady Cook and hopes are soaring among the Ol’ Mizzou crowd.", "That expectation of another banner year has translated to the oddsmakers. Those who set the numbers for the three legal walk-in sportsbooks in the area have established the over/under for the number of regular-season games the Tigers will win as high as 9½. Any postseason play — league title game, bowl game, playoff contests — would not count in that betting total.", "That follows MU being at 6½ heading in to last season, after the Tigers hadn’t won more than six games in any of coach Eli Drinkwitz’s three previous seasons running the team. But they surged to a 10-2 regular-season record and capped that with a victory over Ohio State in the Cotton Bowl.", "As of Friday, two of the brick-and-mortar shops in the area had MU’s total at 9½, with the betting heavily shaded to “under.” At FanDuel (horse track in Collinsville), a bettor had to risk $180 to try to win $100 on the Tigers winning nine or fewer games. Conversely, over 9½ would return $146 for every $100 risked.", "At DraftKings (Casino Queen in East St. Louis), the line also was at 9½ with the vigorish on the under not as steep (-145) as at FanDuel. But the return on over 9½ was less than in Collinsville (+125).", "In Alton, the book in Argosy casino had MU’s victory total at 9, with the over the favorite (-124). Under was at even money. (If the Tigers would win exactly nine games, bets would be a “push” and be refunded.)", "SEC! SEC! SEC!", "Think the Tigers are poised to with the Southeastern Conference title now that Nick Saban finally has left Alabama after his dominating run in all of college football?", "Well, the odds say a newcomer to the league has a better chance to win. MU was at 12-1 at DraftKings and Argsoy, 15-1 at FanDuel. What a change from last summer, when the odds locally of MU prevailing in the SEC were as high as 200-1.", "All three books had Georgia as the favorite (odds between +150 and +190), with newbie Texas the second choice (ranging from +310 to +350). The other incoming team, Oklahoma, was 40-1 at all those shops.", "Vanderbilt, meanwhile, was the longest shot — 1,000-1 at DraftKings.", "Playoff push", "There is a lot of talk among MU faithful of the team’s chances to make the expanded college football playoffs, up to 12 teams from four last year, and the oddsmakers have the Tigers on the cusp.", "Argosy had them with 12th-lowest price to make the field, at +150 (a successful $100 bet would be worth at $150 profit). Georgia and Ohio State were massive favorites to qualify, at -670.", "DraftKings also had MU 12th on its list, at +175. The Tigers just miss the cut according to odds at FanDuel, at which they were 13th (+180).", "The big prize", "Last June, the return on the Tigers winning the national title were as lofty as 400-1, in Alton. While they certainly aren’t among the favorites to win this season, their championship price has had a profound dip.", "DraftKings had them at 35-1, FanDuel was at 38-1 and Argosy chimed in at 50-1. The favorites — Georgia (about 3-1), Ohio State (about 4-1) and Texas (about 8-1).", "How about Illini?", "The over/under for wins last season for Illinois was 6½, like Mizzou, but the Illini fell short in their 5-7 campaign.", "This summer the area books have dropped Illinois’ total to 5½, with the under being the favorite: -120 at DraftKings, -127 at Argosy and -130 at FanDuel. Over was even money at DraftKings, +105 at the others.", "The best price on the Illini to win the Big Ten crown was 300-1, at DraftKings. Argsoy had the Illini’s price to make the playoffs at 45-1 and FanDuel had them at 1,000-1 to win the national championship.", "NHL under thunder", "There was an offensive explosion, at least by recent standards in the NHL playoffs, on Thursday night when the Florida Panthers and Edmonton Oilers combined to score seven goals.", "Four of them came from the Panthers, who surged to a 3-0 lead in the Stanley Cup Final and positioned themselves to have a chance Saturday night to hoist the chalice.", "The game thus went over the betting line for the number of goals the teams would combine to score, which was 5½.", "“Overs” have been rare occurrences in the NHL postseason for a month. The game Thursday broke a streak of six consecutive “unders,” part of a 17-5 “under” run dating to May 14.", "All three area shops have the total for Saturday’s game at 5½, with bettors who want to ride the under wagon having to risk about $120 to try to win $100.", "Football finale", "The Battlehawks and Birmingham Stallions were preseason co-favorites to win the inaugural United Football League title, at odds of 3-1 or slightly higher depending on the house.", "The B-hawks fell flat last weekend in losing their semifinal game, stymied by San Antonio, but the Stallions beat Michigan to reach Sunday afternoon’s title tilt in St. Louis.", "All three area books as of Friday afternoon had Birmingham as a 3½-point favorite. The best money line (wagering merely to win without the pointspread being applied) on the Stallions was -177 (at Argosy), and on the Brahmas was +160 (FanDuel).", "Listen now and subscribe: Apple Podcasts | Spotify", "COLUMBIA, Mo. — As the college sports world prepares for the onset of revenue sharing with athletes and the wide-ranging, still nebulous shakeup it will bring, Missouri athletics director Laird Veatch has his fair share of questions.", "He has some optimism, too: Veatch sees a clear advantage for Mizzou when it comes to the future of name, image and likeness compensation, or NIL, for athletes. But after a month and change on the job in Columbia — and just a couple of weeks after the House v. NCAA settlement that will redefine the financial side of college sports — he told the Post-Dispatch there’s a lot to be determined.", "“The unknowns and the big questions that I have would, in many, many ways, be what you and others would have: just on the surface about the settlement and where it’s headed,” Veatch said. “It is a process that has to play out over the coming year. It’s going to be another one of those scenarios, in some ways sort of like COVID, where you feel like you’re trying to figure it out throughout the year as you go through the process.”", "One part of the settlement involves billions in back pay to affected athletes, but that’s not the aspect with so much landscape-shifting power. That power-conference schools will soon be able to distribute somewhere around $20 million in shared revenue each year to their athletes is the forward-leaning topic fueling discussions across athletics departments, including MU’s.", "The money is where Veatch’s questions become more concrete.", "“First of all, of course, the institutional NIL or that revenue-sharing piece: How will that be distributed?” he said. “What’s going to be the parameters around that — at the national, conference and institutional level? Then, of course, the above-and-beyond NIL: How is that going to be structured from an enforcement, accountability, transparency side? How do we position ourselves for that? That’s where it starts to get into, OK, once you understand the bigger picture and what the potential parameters may be, how do you start applying that to your organization? There’s going to be a lot of modeling, a lot of concept discussion.”", "And, perhaps, some room for creativity when it comes to getting money in the hands of athletes.", "Revenue sharing will only be a part of how athletes are compensated, and it comes with its own questions and spots of tension that could wind up in courtrooms down the road, like how Title IX comes into play and the potential status of athletes as employees. Some form of the more normalized NIL compensation, which pays athletes for the use of their likeness, usually in a marketing capacity, is likely to stick around.", "NIL collectives have become a core part of the latter operation as modernized, cash-hungry booster groups. The settlement, in some ways, could be at odds with their existence.", "“I wish the NCAA would get off this ridiculous and outdated notion and drive to kill collectives that are actively working to achieve what they want and what schools want,” Walker Jones, who leads an Ole Miss collective, told Yahoo Sports. “They’ve got to put this vendetta down. We’re trying to do the very thing they want — provide a system and process using our expertise and relationships to truly recognize our athletes’ market value.”", "But Missouri, in this regard, is set up differently from other schools in its structure and relationship with Every True Tiger, its collective. A state law passed last year allowed the collective to receive funds directly from MU for distribution, creating the “Mizzou model,” as it’s known beyond Columbia.", "Every True Tiger has since branded itself as a marketing agency that can arrange deals with athletes — a system that is more closely aligned with a post-revenue-sharing landscape.", "“You’re going to see a lot of continued innovation and restructuring of how NIL is managed at schools across the country,” Veatch said. “I think the Mizzou model is a model that many will end up trying to duplicate or reflect in some way, shape or form — because it is kind of the beginning of that institutional NIL in how it’s structured, how it operates.”", "That process has already begun. Two Circles, an international marketing agency with a base in Kansas City that was working with MU and Every True Tiger, hired Every True Tiger CEO Nick Garner to take the Mizzou model nationwide.", "The Two Circles move is an indication that the way MU has been handling its NIL setup over the past year is, nationally speaking, a path forward into the revenue-sharing era.", "“That’s one of the advantages we’ll continue to have,” Veatch said. “We’ve got an infrastructure already in place that in many ways suits the direction of where we’re headed.”", "With marketing as the new point of emphasis for NIL moving forward, schools could pivot from courting donors to fund athlete compensation to corporate partners for endorsement deals.", "“That’s where we’re really going to have to push to get to another level with our partnership with Learfield, working with Every True Tiger as well and their staff, and reaching out to corporations and organizations across the state to really get back to what NIL was intended to be on the front end,” Veatch said.", "The future of NIL is only one aspect of the college sports shakeup that has left administrators like Veatch with questions where they’d probably prefer to have answers. There’s a swath of other yet-to-be-resolved matters swirling around his office, waiting for models to follow and months to pass.", "To understand the current uncertainty from his perspective, just ask him what questions he has about the future.", "“There’s going to have to be a new model in how we operate, from a financial standpoint, from a resource standpoint, the types of services we provide,” Veatch said. “How does all that look? And of course, in the back of your mind, you’re always thinking about: How’s it going to impact your student-athletes and their experience and what they get? You can arguably say it’s going to be more and more and more positive, which is the huge upside of all this, right? But then, also, how’s it going to impact your stuff and the institution? And how do we take advantage of the opportunity for the university as a major branding, marketing arm of the institution in many ways?”"]}