{"title": "Nigeria democracy day: Why another coup is so unlikely", "timestamp": "\"2024-06-12 01:11:37\"", "content": ["Why another coup is so unlikely in Nigeria", "4 days ago", "By Azeezat Olaoluwa , BBC News, Lagos", "Nigeria, a nation once notorious for military rule, is marking 25 years of democracy, at a time when several of its West African neighbours have had coups in recent years.", "The brass bands will play, the crowd will cheer and the president will make a speech – but outside of Wednesday’s official event many may be wondering what the celebration is really for.", "“You cannot eat democracy” is a phrase often attributed to autocrats - but it has also been used by elected leaders as a warning about what a population might demand of them.", "As many Nigerians struggle to earn enough to live on, amid an economic crisis and dramatically rising prices, some appear to be very unhappy with how they are being governed.", "A survey by respected polling organisation Afrobarometer in 2022, before the current crisis, found that more than three-quarters of Nigerians surveyed were either “not very” or “not at all” satisfied with democracy.", "A worrying statistic for Africa’s most populous country.", "Nevertheless, the same survey found that a majority preferred democracy to any other system of governance.", "Perhaps because the bitter memories of military rule still linger for many.", "Since independence in 1960, the periods of civilian rule were short-lived with generals governing the country for most of the time up until 1999.", "“A military coup will be almost impossible in Nigeria now,” historian Prof Kayode Soremekun said.", "“The military itself has exhausted its own historic possibilities. Over time, the military has been shown to be as venal as the political class. So, the majority of Nigerians no longer see them as messiahs,” he added.", "The military regimes were filled with pain and oppression, 59-year-old Adedeji Adekunle told the BBC.", "Now an event planner, he recalled his experience as a student in early 1998.", "“Years back, I joined a ‘military-must-go’ protest in [the main city] Lagos and soldiers attacked and arrested us. Many were tortured. It was a traumatic experience,” he said.", "The period of military rule in the 1980s and 1990s was \"marked by economic collapse, political repression and systematic human rights violations”, according to New York-based campaign group Human Rights Watch.", "After the death of Nigeria’s head of state, Gen Sani Abacha in 1998, his successor, Gen Abdulsalami Abubakar promised elections, ushering in a new era of civilian rule a year later.", "“The return of democracy to Nigeria in 1999 raised a lot of expectations, dreams, and wishes for a free, secure, united, and peaceful country,” former Senator Shehu Sani said.", "Mr Adekunle breathed a sigh of relief at the time.", "“Many of us initially doubted if Gen Abubakar would hand over power, but after the election was held and the winner was announced, the atmosphere changed. It was like a fresh breeze blew on the nation.”", "But for today's youth, who were not politically aware or even born at that time, the folk memory of military rule is less important.", "Current President, Bola Tinubu, in power for just over a year, is facing the challenge of winning over the hearts and minds of young Nigerians amid a tough economic environment, some of which is of his own making.", "His ending of the fuel subsidy and allowing the currency to devalue have sent prices shooting up.", "These ambitious reforms were aimed at stabilising the economy and fostering sustainable growth in the long term, but that is no succour for those most affected.", "And taking the past 25 years in Nigeria as a whole, the fact that the average income per person has seen a more than four-fold increase is unimportant for many.", "It is how they perceive the current situation that counts.", "As a consequence some young Nigerians, such as 33-year-old screenwriter MI Thomas, would not mind a return to military rule.", "‘’I have voted since I turned 18 and all of the leaders have disappointed, every single one of them. Military regimes are decisive. They take swift action and bring effectiveness to governance,’’ he said.", "A number of other young Nigerians have expressed the same desire on social media.", "What may have encouraged this could be a lack of trust in the political class due to unfulfilled promises.", "But it could also be a rose-tinted view of the past, with people saying that there was not as much crime and corruption during military rule.", "But some may have forgotten, for example, that the late Gen Abacha looted and stashed a huge amount of public funds overseas. At least $6bn (£4.7bn) in cash and assets have been recovered so far.", "It would be expected that President Tinubu was particularly sensitive to talk of military rule as he himself was once imprisoned for pro-democracy activities.", "Very soon after coming to power, the president was faced with dealing with the coup in neighbouring Niger and was quick to condemn it and threatened military action – however his bold rhetoric came to nothing.", "But at home, for its part, the military leadership has said that it has no interest in retaking power.", "Chief of Defence Staff Gen Christopher Musa said in February that “people making such calls for a military takeover do not love Nigeria”.", "“We want to make it clear that the armed forces of Nigeria are here to protect democracy. We all want democracy; we do better during democracy, and so, the armed forces will continue to support democracy.”", "There have been episodes in the past 25 years – such as when the whereabouts of late President Umar Musa Yar’Adua were unknown – that the military could have seized power, but nothing happened.", "National lawmaker Senator Babangida Hussaini from Jigawa state in the north believes this is because reforms had been introduced to tame “the over-ambitious military and strengthen some institutions of governance and democracy”.", "The senator admits that while “we may not have met the expectations of Nigerians… overall, we have made progress”.", "There are also some, such as development studies professor Fidelis Allen, who have questioned whether the absence of military rule can be equated with true democracy.", "Nigerians have voted at regular intervals since 1999 but there are still questions over whether those in office are truly accountable to the electorate in terms of how public money is spent, and if they are honest and open about their decision making.", "Prof Soremekun believes that more work needs to be done to strengthen democracy.", "“It is good in itself; but it must also deliver dividends to the Nigerian people,” he said.", "And for those, like Mr Adekunle, who still remember military rule, there is no choice.", "“Democracy is sweet, it offers people freedom. There’s nothing good with military governance.”", "Additional reporting by Yusuf Akinpelu and Gift Ufuoma", "More BBC stories on Nigeria:", "Go to BBCAfrica.com for more news from the African continent.", "Follow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica"]}