{"title": "Texas Rangers News, Scores, Status, Schedule - MLB", "timestamp": "\"2024-06-12 11:54:07\"", "content": ["Gray will start Wednesday against the Dodgers, Evan Grant of The Dallas Morning News reports.", "The Rangers had held off on officially naming Gray their starter for Wednesday's game since he pitched 2.1 innings in relief in Saturday's loss to the Giants. He's evidently bounced back fine from that appearance and will pitch on short rest versus the Dodgers. It will be Gray's first start since he had to exit an outing more than three weeks ago with a right groin strain.", "Dunning (4-5) took the loss Tuesday against the Dodgers, allowing six runs on four hits and three walks while striking out two over 3.2 innings.", "Dunning dug the Rangers an early 3-0 hole after surrendering a three-run homer to Will Smith in the first inning. He kept the Dodgers off the board the next two frames but loaded up the bases in the fourth before being replaced by Jonathan Hernandez with two outs. Hernandez gave up a double to Mookie Betts, which plated two runs that were charged to Dunning. He's now given up 14 runs (12 earned) over his last 17 innings and hasn't pitched more than five frames since April 28. The 29-year-old owns a 4.80 ERA, 1.23 WHIP and 59:26 K:BB in 54.1 innings and will look to get back on track in a weekend start against Seattle.", "Lowe started at first base and went 1-for-4 in Tuesday's 15-2 loss to the Dodgers.", "Lowe, who had been held out of the starting lineup against the previous three left-handed starters the Rangers faced, was in the starting nine against lefty James Paxton. In those previous three games, Ezequiel Duran started at first base, but he was used at shortstop while Josh Smith was given a break and Corey Seager (hamstring) was unavailable. It's unclear if Lowe's start Tuesday signals that he's back in against lefties, or if it was a special case to give Smith a rest day.", "Duran started at shortstop and went 1-for-3 with a home run and two RBI in Tuesday's 15-2 loss to the Dodgers.", "Duran started in place of the injured Corey Seager (hamstring), who missed a fourth consecutive game. Josh Smith has served as the primary fill-in when Seager's been unavailable this season, but Smith was given a break Tuesday. Duran produced a run on a sacrifice fly in the second inning then popped his second home run of the season in the seventh. He has a modest seven-game hit streak (8-for-25, seven RBI) and hit safely in 14 of the previous 16 games. The Rangers maintain that Seager's injury is not serious and are not considering a stint on the IL.", "Smith is not in the lineup for Tuesday's game against the Dodgers.", "Smith has a .912 OPS through eight games in June but will take a seat Tuesday with southpaw James Paxton on the mound for Los Angeles. Davis Wendzel will receive a start at the hot corner and bat eighth.", "Seager (hamstring) is out of the lineup for Tuesday's game against the Dodgers.", "Despite a team day off Monday, Seager's absence will extend to four games as he continues to nurse the hamstring strain he suffered Wednesday versus Detroit. Ezequiel Duran will take over at shortstop and bat seventh Tuesday.", "Scherzer (back/arm) allowed one hit and one walk while striking out five over four scoreless innings in a rehab start for Triple-A Round Rock on Sunday.", "Scherzer restarted a rehab assignment after experiencing a setback late in April. He cruised through 53 pitches (37 strikes), induced 14 whiffs, and registered a fastball velocity of 94.8 mph, per Kennedi Landry of MLB.com.", "Garcia went 1-for-4 with a stolen base and a run scored in Sunday's 7-2 win over the Giants.", "Garcia stole home as part of a double-steal in the first inning, the third time he's stolen home in his career. It was his fifth theft of the season. The slugger has been grinding at the dish; his first-inning single snapped an 0-for-16 run. For the season, Garcia is batting just .217 with a career-low .699 OPS through 62 games.", "Semien went 1-for-3 with a home run, two RBI, a stolen base and an additional run scored in Sunday's 7-2 win over San Francisco. He was also hit by a pitch.", "Semien was integral as the Rangers built an early 5-0 lead after two innings. He was hit by a pitch to lead off the bottom of the first, stole second base, then came home on Wyatt Langford's single. An inning later, Semien deposited a first-pitch slider into the stands in left for a two-run home run. He's reached base safely in nine straight games, going 11-for-31 (.355) with seven walks, two homers, three RBI and eight runs scored.", "Langford went 2-for-4 with a triple and two RBI during Sunday's win over the Giants.", "Langford recorded his fourth multi-hit game in the last nine while collecting his fifth and sixth RBI over that same span. Langford is starting to show some positive signs after a slow start to the season, lifting his average to .234 with Sunday's effort and hitting .286 with a double and two triples over this most recent nine-game stretch.", "Eovaldi (3-2) earned the win Sunday, allowing two runs on five hits and a walk over seven innings against the Giants. He struck out five.", "Eovaldi was staked to a 5-0 lead after two innings and cruised through seven, merely allowing single runs in each of the third and fourth innings as he rolled to his third victory. More importantly, he was also extended to near his full workload, completing seven innings on 90 pitches after tossing 37 and 71 in his previous two starts following a nearly four-week stint on the IL with a groin injury. It was the seventh start out of 10 for Eovaldi with at least five innings while allowing two or fewer runs. He'll carry a 2.68 ERA and 1.09 WHIP into his next start, likely to take place next weekend when the Rangers travel to Seattle for a showdown against the Mariners.", "Seager (hamstring) is not in the starting lineup for Sunday's series finale against the Giants.", "Seager will miss his third straight game Sunday due to a left hamstring strain he sustained Wednesday against the Tigers. The Rangers have an off day Monday, so the 30-year-old will have four days off before the upcoming road series against the Dodgers starting Tuesday. Josh Smith will once again start at shortstop Sunday, while Ezequiel Duran serves at the hot corner against Giants right-hander Keaton Winn.", "Lowe went 0-for-2 with a walk, a sacrifice fly and an RBI in Saturday's 3-1 loss to the Giants.", "Lowe delivered the Rangers' lone run with a sacrifice fly in the first inning. It was just his fifth RBI over the last 17 games. The slumping first baseman was recently removed from starting lineups against left-handers and is batting .207 (12-for-58) over the last 19 contests."]}