{"title": "Columbia Libraries to Digitize Rare Muslim World Manuscripts", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["Scholars around the globe will soon be able to read 11th to 19th century archival items from the Muslim world that are now only accessible in the climate-controlled stacks of Columbia’s Rare Book & Manuscript Library.", "With the support of new technology and conservation techniques, Columbia University Libraries and a group of Philadelphia-area institutions have received a three-year $500,000 grant from the Council on Library and Information Resources, funded by the Andrew W. Mellon Foundation, to digitize hundreds of manuscripts and paintings. The project will shed light on both the rich cultural heritage of the Muslim world and the collaboration between Islamic civilizations and the West. Religion, medicine, history, literature, astronomy and mathematics are among the subjects in the collection.", "“This is important for any number of reasons,” said Sean Quimby, director of the Rare Book & Manuscript Library. “First and foremost, it will provide global access to unique research materials that have been hidden from view for too long.”", "Columbia Libraries’ preservation and digital conversion division will digitize 345 items, which is about one-quarter of the total covered by the grant. The documents are primarily from the collection of David Eugene Smith, a Teachers College mathematics professor who acquired them in the 1920s and ‘30s. The global studies division at Columbia Libraries and the Middle East Institute are providing funding for Columbia students to do some of the digital cataloging. “This is really a Columbia story,” said Manan Ahmed, assistant professor of history and cofounder of Columbia’s Group for Experimental Methods in the Humanities.", "The manuscripts originated in countries from southern Spain to India and are in a mix of languages, including Arabic, Persian and Ottoman Turkish and have been used by professors of Middle Eastern Studies and history for teaching and research. Ahmed first encountered the archive when he was teaching in the Core Curriculum and students were assigned readings from the Quran. He wanted to show them the manuscripts but found that they were not in the libraries’ online database, CLIO, but instead cataloged by decades-old cards.", "Sadegh Ansari, a graduate student in the department of Middle Eastern, South Asian and African Studies, was interested in working with the manuscripts and set off the events that lead to the grant. He partnered with a history graduate student, Zeinab Azarabadegan; a religion graduate student, Mahmood Gharavi; and an art history graduate student, Matthew Gillman. They approached Ahmed, who agreed to become their faculty advisor.", "“It cuts across so many departments,” said Jane Siegel, rare book librarian at the Rare Book and Manuscript Library. “It’s great for the students to have exposure to manuscripts, but it’s great for us because they have the language expertise to help us describe them.”", "The graduate students, who began cataloging the manuscripts under the tutelage of Middle East and Islamic Studies librarian Peter Magierski, held a conference in 2017 to highlight the importance of the collection as well as the difficulties of cataloging Islamic manuscripts.", "Quimby and Janet Gertz, director of the preservation and digital conversion division at Columbia Libraries, drafted the digitization grant proposal. Along the way, they learned that institutions in Philadelphia were seeking funding to digitize their own Muslim-world manuscripts. “We said, ‘Let’s do it together’” said Siegel, the rare book librarian.", "The grant recipients include the Free Library of Philadelphia, the University of Pennsylvania and Bryn Mawr and Haverford colleges. The digitized manuscripts will be available to anyone, accessible via OPenn, a site run by the University of Pennsylvania, and the Internet Archive, a non-profit digital library.", "“Granting agencies like collaboration; it makes their money go further and fosters better relations, in this case among libraries,” said Gertz. “It’s a win-win.” But she added that funds are still needed to digitize more than half of what Columbia holds and to conserve damaged manuscripts that cannot be digitized in their current state.", "The manuscripts—both those recently digitized and those awaiting digitization—may hold new discoveries about the Islamic history of science, Magierski added, “Since we’re opening these up to the world, we may find out.”"]}