{"title": "skin health devices // Show Me Mizzou // University of Missouri", "timestamp": "\"2024-06-13 00:00:00\"", "content": ["Feb. 8, 2023", "Contact: Eric Stann, 573-882-3346, StannE@missouri.edu", "With cancer, diabetes and heart disease among the leading causes of disability and death in the United States, imagine a long-term, in-home monitoring solution that could detect these chronic diseases early and lead to timely interventions.", "Zheng Yan and a team of researchers at the University of Missouri may have a solution. They have created an ultrasoft “skin-like” material — that’s both breathable and stretchable — for use in the development of an on-skin, wearable bioelectronic device capable of simultaneously tracking multiple vital signs such as blood pressure, electrical heart activity and skin hydration.", "“Our overall goal is to help improve the long-term biocompatibility and the long-lasting accuracy of wearable bioelectronics through the innovation of this fundamental porous material which has many novel properties,” said Yan, an assistant professor in the Department of Chemical and Biomedical Engineering and the Department of Mechanical and Aerospace Engineering.", "Made from a liquid-metal elastomer composite, the material’s key feature is its skin-like soft properties.", "“It is ultrasoft and ultra-stretchable, so when the device is worn on the human body, it will be mechanically imperceptible to the user,” Yan said. “You cannot feel it, and you will likely forget about it. This is because people can feel about 20 kilopascals or more of pressure when something is stretched on their skin, and this material creates less pressure than that.”", "Its integrated antibacterial and antiviral properties can also help prevent harmful pathogens from forming on the surface of the skin underneath the device during extended use.", "“We call it a mechanical and electrical decoupling, so when the material is stretched, there is only a small change in the electrical performance during human motion, and the device can still record high-quality biological signals from the human body,” Yan said.", "While other researchers have worked on similar designs for liquid-metal elastomer composites, Yan said the MU team has a novel approach because the breathable “porous” material they developed can prevent the liquid metal from leaking out when the material is stretched as the human body moves.", "The work builds on the team’s existing proof of concept, as demonstrated by their previous work including a heart monitor currently under development. In the future, Yan hopes the biological data gathered by the device could be wirelessly transmitted to smartphone or similar electronics for future sharing with medical professionals.", "“Porous liquid metal–elastomer composites with high leakage resistance and antimicrobial property for skin-interfaced bioelectronics” was published in Science Advances, a journal of the American Association for the Advancement of Science (AAAS). Co-authors on the study include Yadong Xu, Yajuan Su, Xianchen Xu, Brian Arends, Ganggang Zhao, Daniel Ackerman, Henry Huang, St. Patrick Reid, Joshua Santarpia, Chansong Kim, Zehua Chen, Sana Mahmoud, Yun Ling, Alexander Brown, Qian Chen, Guoliang Huang and Jingwei Xe.", "This study was supported by grants from the National Science Foundation (2149721), Office of Naval Research (FA9550-21-1-0226), National Institute of General Medical Sciences (P30GM127200), National Institute of Arthritis and Musculoskeletal and Skin Diseases (R21AR080906), and the Air Force Office of Scientific Research (AF 9550-20-1-0279 and AFOSR FA9550-20-1-0257). The content is solely the responsibility of the authors and does not necessarily represent the official views of the funding agencies.", "Editor’s note:", "For more on the story, please see:"]}