{"title": "Nina Dobrev recovering from dirt bike crash", "timestamp": "\"2024-06-13 15:52:00\"", "content": ["Nina Dobrev can't walk on her own yet after her knee \"snapped\" following a dirt bike crash.", "The 35-year-old actress has opened up for the first time about the accident that left her recently requiring knee surgery, and admitted she \"lost control\" of her dirt bike, but the star was lucky it didn't land on her.", "Speaking on The Talk, she said: \"I don't recommend it, guys. It's okay, I learned a lesson, don't ever get on a dirt bike. I was in a wheely, lost control, whisky throttled, bike flew.", "\"Luckily, it didn't fall on me, which is what the doctor said would have been a lot worse. But when I landed, I landed on one leg, straight, and my knee just like snapped.\"", "Nina recently underwent surgery to repair her fractured knee.", "She said: \"I had knee surgery; I got a giant brace. I can't really walk on my own yet...I had a fractured knee as well as ACL repair and meniscus.\"", "During her appearance on the talk show, Nina admitted it was her \"first time actually leaving the house in over two months\", aside from a recent hospital visit.", "Last week, The Vampire Diaries star told how her surgery had been a \"success\".", "She wrote on Instagram: \"Surgery was a success. Thank you to everyone who has been sending kind messages, thoughts, prayers, and good vibes.", "\"I have been feeling the support and positive energy. It means more than you will ever know.\"", "Before going under the knife, Nina admitted she was \"scared\" to have the procedure.", "She wrote on her Instagram Story: \"Anyone else get scared before surgery? I'm such a baby when it comes to needles, blood or procedures of any kind.\"", "In a video she shared with followers, the star showed herself leaning forward and writing \"Yes\" with an arrow on her knee.", "She said: \"Fun fact: they make you draw on whatever extremity is being operated on to confirm that is the correct limb.", "\"(Because I guess it's happened in the past that some surgeons have accidentally operated on the wrong limb.) Yikes!!! (sic)\""]}