{"title": "Daisy Ridley feels 'deeply uncomfortable' confronting sexism on sets", "timestamp": "\"2024-06-12 13:52:48\"", "content": ["Daisy Ridley admits it still feels \"deeply uncomfortable\" to confront sexism on film sets.", "The Star Wars actress has reflected on her experiences on another project — which she hasn't named — when she noticed she was being treated differently to one of her male co-stars.", "Appearing on the Reign with Josh Smith podcast, she said: \"I did a job and I was doing something physical in the same way that the male character was doing something physical.", "\"And one of the stunt team was coming over to pat the man on the back and it got to a point where I said, 'Are you not gonna do the high fives and all the stuff to me?'", "\"And he was really thrown by it. I think it was really difficult for him because it was not badly intended he was just they were doing the 'the male thing,' that they're comfortable doing and that didn't include me even though I was doing exactly the same thing as the man that he was congratulating.", "\"Then of course it's deeply uncomfortable because when you do speak up, the person that's speaking up feels really uncomfortable.\"", "The Young Woman and the Sea actress described the behaviour as something that was \"learnt\", while she was disappointed the person in question didn't apologise for his actions.", "She added: \"It's behaviour that's learnt… it was just one of those things that I really, really noticed because it happened again and again.", "\"And then when I said it to the person — I think being able to apologise is really important.", "\"If you do speak up for something, it takes a lot of bravery for the other person to say, 'I'm really sorry. I actually did not realise I was doing that. I see you both in the same way,' and the person couldn't do that.", "\"But you know, maybe on the next job he does, which would be great.\"", "While she can't control what other people do, the 32-year-old star focuses on keeping her \"side of the street clean\" in the hope it can \"help change\" things for others in the industry.", "She said: \"I think small acts of courage do something and I try to keep my side of the street clean and I try to advocate for what I can for the next person that's going to be in that situation.", "\"I think that oftentimes what we can all do is the small things that really make a huge difference… it's really scary a lot of the time but the small thing might help change for the next person in the industry.\""]}