{"title": "Robert Irwin threatens to sue Pauline Hanson's One Nation over Please Explain cartoon about his Queensland tourism campaign with Bluey", "timestamp": "\"2024-06-15 02:00:13\"", "content": ["Robert Irwin, the son of legendary wildlife warrior Steve, has sent legal letters to Pauline Hanson's One Nation insisting a cartoon he claims is defamatory be taken down.", "Daily Mail Australia highlighted the recent episode of the firebrand senator's Youtube series Please Explain titled 'The State of Queensland' after it was published on Friday.", "The skit satirically depicts Irwin and ABC children's cartoon character, Bluey, after the pair were unveiled as the faces of the state's new tourism campaign.", "However, just hours after the video was published, FC Lawyers on behalf of Irwin sent a cease and desist letter to StepMates Studios, the series' production team.", "One Nation's chief of staff, James Ashby, told Daily Mail Australia that the party would oppose the contents of the letter and have brought in defamation expert Sue Chrysanthou SC.", "The letter from FC Lawyers' Zoe Naylor to the animation studio's founders, Mark Nicholson and Sebastian Peart, said their depiction of Irwin 'constitutes defamation'.", "Adding that the cartoon was an 'unauthorised and deceptive use of our client's image', Ms Naylor demanded the studio remove the video from all platforms.", "In the episode, the enthusiastic Irwin character attempts to show Bluey all the positive things the Sunshine State has to offer.", "But the pair are met with the very same problems residents there are struggling with everyday.", "The duo at one point mistake a long queue at the famed Movie World theme park for a rental inspection, highlighting Queensland's dire housing crisis.", "They are also targeted by foul-mouthed delinquents who steal their vehicle and 'bash' Bluey.", "When he is taken to hospital, they are told it will be a 'six-month' wait.", "The episode ends with a downbeat Irwin, saying 'I can't believe this is the state of Queensland'.", "The letter from Ms Naylor claims the cartoon 'not only tarnished our client's reputation but also misled the public, causing significant harm to our client’s brand and image'.", "'The unauthorised use of our client’s image in this context is particularly egregious, as it manipulates the truth and misrepresents our client's personality, values, and beliefs.'", "The lawyer demanded StepMates Studios to take down the cartoon from all social media platforms and elsewhere online.", "Ms Naylor also ordered them to no longer portray Irwin in the future without permission.", "They have until 5pm on Monday to meet the demands or the firm may escalate the issue to the Federal Court."]}