{"title": "Johnstown Central Cambria Red Devils", "timestamp": "\"2024-06-12 20:55:10\"", "content": ["hace 3 años", "H.S. Roundup 2-24: Wednesday slate features all hoops", "JOHNSTOWN -- The local circuit was made up solely of basketball Wednesday night. In boys action, Westmont Hilltop defeated Bishop McCort, Cambria Heights defeated Central Cambria, and Bald Eagle fell to Penns Valley. In girls' games, Bishop McCort defeated Westmont...", "hace 3 años", "H.S. Roundup 2-12: Friday comprised of 8 local basketball match-ups", "JOHNSTOWN -- Friday night was another busy one for action across the coverage area. In boys' action, Richland picked up an LHAC victory over Bishop McCort, Bishop Carroll needed double overtime to hold off rival Central Cambria, Conemaugh Township defeated...", "hace 3 años", "H.S. Roundup 2-11: Thursday features local basketball, wrestling, and hockey", "JOHNSTOWN -- Thursday night was a busy one for local sports in the area. In boys hoops, Berlin picked up a non-conference road win over Bishop Guilfoyle, Penn Cambria defeated Hollidaysburg, and Dubois Central Catholic defeated Saint Joseph's Catholic Academy...", "hace 3 años", "H.S. Roundup 2-9: basketball makes up Tuesday slate", "JOHNSTOWN -- Tuesday night featured a lighter slate made up of mainly basketball. In girls' action Forest Hills remained unbeaten with a road win over Central Cambria, Bishop Carroll topped Penn Cambria by a bucket, and Conemaugh Valley fell on...", "hace 3 años", "H.S. Roundup 2-5: milestones galore on Friday full of basketball", "JOHNSTOWN -- Friday night featured a busy night of basketball and there were a few milestones reached in the area. At North Star, Tyler Poznanski topped 1,000 career points in a Conemaugh Township win over the host Cougars. Also in...", "hace 3 años", "H.S. Roundup 2-3: hoops, wrestling, and hockey featured Wednesday", "JOHNSTOWN -- Wednesday's local coverage featured highlights of basketball, wrestling, and hockey. In boys basketball, it was Richland getting the best of Bishop Carroll, Johnstown defended home court against Chestnut Ridge, and Westmont Hilltop did the same against Penn Cambria...", "hace 3 años", "H.S. Roundup 1-29: high school hoops dominates Friday slate", "JOHNSTOWN -- Friday was furiously busy with high school basketball, check out the video above for highlights from around the area. The scores of the games featured are listed below."]}