{"title": "World's Largest Tornado Experiment Heads for Great Plains", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["News Release", "Multimedia Gallery", "BOULDER—The largest and most ambitious tornado study in history will begin next week, as dozens of scientists deploy radars and other ground-based instruments across the Great Plains to gain a better understanding of these often deadly weather events.", "NCAR scientists and technicians will launch weather balloons at VORTEX2 with their Mobile GPS Advanced Upper-Air Sounding System. Shown here are (left to right) William Brown, Jennifer Standridge, and Tim Lim testing a balloon launch [ENLARGE] (Photo by Carlye Calvin.) News media terms of use*", "The collaborative international project, involving scientists from the National Center for Atmospheric Research (NCAR) and a number of other organizations, will examine in detail how tornadoes form and the patterns of damage they cause. The findings are expected to improve tornado warnings and short-term severe weather forecasts.", "The field campaign, known as VORTEX2 (Verification of the Origins of Rotation in Tornadoes EXperiment 2), will run from May 10 to June 13. A second phase is planned for the spring of 2010.", "\"We still do not completely understand the processes that lead to tornado formation and shape its development,\" says Roger Wakimoto, director of NCAR's Earth Observing Laboratory and a principal investigator for VORTEX2. \"We hope that VORTEX2 will provide the data we need to learn more about the development of tornadoes and in time help forecasters give people more advance warning before a tornado strikes.\"", "The $11.9 million VORTEX2 program is funded primarily by the National Science Foundation, which sponsors NCAR, and by the National Oceanic and Atmospheric Administration.", "In addition to NCAR, participants include the Center for Severe Weather Research, Rasmussen Systems, NOAA National Severe Storms Laboratory, NOAA Cooperative Institute for Mesoscale Meteorological Studies at the University of Oklahoma, Pennsylvania State University, University of Oklahoma, Texas Tech University, Lyndon State College, University of Colorado, Purdue University, North Carolina State University, University of Illinois, University of Massachusetts, University of Nebraska, Environment Canada, and the Australian Bureau of Meteorology.", "NCAR's Roger Wakimoto, a principal investigator for VORTEX2, explains some of the science behind the field project. He will be using video and damage surveys to analyze the structure of tornadoes.", "This one-minute animation (QuickTime) gives a 3-D overview of the VORTEX fleet, with descriptions of instruments as they might be deployed around a potentially tornadic thunderstorm.", "The crucial zone", "The first VORTEX project, conducted in 1994 and 1995, gathered critical data on supercells, the severe and long-lived thunderstorms that give birth to the most destructive and deadly tornadoes. VORTEX findings are credited for improving National Weather Service tornado warnings, which now have a lead time of about 13 minutes.", "Building on that progress, VORTEX2 researchers will use enhanced mobile radars and other new weather-sensing tools to gather far more detail on the crucial zone where tornadoes develop. Rapidly changing contrasts in wind and temperature in this zone, which is only a few miles across, can spawn a tornado within minutes. However, such an event happens in only a small fraction of supercell storms, and standard observing networks and radars often fail to capture the atmospheric conditions that lead to a tornado.", "\"VORTEX2 will help us better understand the difference between thunderstorms that produce tornadoes and those that don't,\" says NCAR scientist David Dowell, a VORTEX2 field coordinator. \"By identifying the characteristics of severe thunderstorms that produce tornadoes, forecasters will be able to issue tornado warnings further in advance and potentially save lives.\"", "Probing a vast region with high-tech tools", "A high-resolution version of this animation (1920 x 1080 pixels) suitable for HD broadcast can be downloaded via FTP at ftp://ftp.ucar.edu/communications/vortex_2_HD.mov. This version of the animation omits the text that details each type of instrument.", "The radar fleet for VORTEX2, including 10 mobile radars, will track winds and precipitation in and near tornadoes in unprecedented detail. The instruments will have a resolution as fine as 300 feet and time steps as small as 15 seconds. More than three dozen portable surface weather stations will blanket the area in and near a target storm.", "The VORTEX2 study area spans more than 900 miles, stretching from west Texas to southwest Minnesota. On each day of operations, participants will position equipment about an hour ahead of a potentially tornadic storm and remain in place until the storm arrives. NOAA forecasters and partners will provide intensive guidance on short-fuse weather events as each day unfolds.", "The VORTEX2 study area (left), shown as a red loop, stretches some 900 miles from north to south across the Great Plains. Shown at right is a supercell thunderstorm surrounded by VORTEX2 observing teams. The heaviest precipitation, in green, loops around the target area where a tornado might occur. (Image courtesy VORTEX2.) News media terms of use*"]}