{"title": "Man Utd boss Erik ten Hag gets vote of confidence from INEOS but numbers show he faces uphill task", "timestamp": "\"2024-06-12 15:30:00\"", "content": ["Manchester United are sticking with Erik ten Hag, but the alarming numbers from the past season show he has his work cut out for him.", "United ended the campaign eighth, their worst finish in the Premier League era, after Ten Hag failed to curb the team's worrying performances amid an almost constant injury crisis.", "Their unlikely win over Manchester City in the FA Cup final was the only saving grace, and perhaps what kept Ten Hag from being sacked, as his team saved their best until last. Helped, importantly, by key players returning from injury.", "Man Utd transfer news and rumours | Transfer Centre LIVE!", "Premier League 2024/25 season dates, schedule, fixture release", "Stream the Premier League with NOW | Get Sky Sports", "Seventy per cent of you voted that this had been United's worst season since Sir Alex Ferguson retired when asked with four games to go. The outlook, of course, has changed a lot since then.", "Rightly so, an FA Cup trophy and Europa League qualification after a season with so many issues is admirable. Ten Hag has now won two trophies in as many seasons, none of Ferguson's successors can boast a better return.", "He and Jose Mourinho are the most successful United managers of the past decade.", "Bridging the gap", "Scenes of jubilation at Wembley have somewhat pushed the memories from the rest of United's season to the back of our thinking, however. Ten Hag is yet to find anywhere near the consistency required to make this an elite side.", "That is reflected in the 31-point gap between themselves and champions Manchester City in the table.", "Arsenal were only two points from finishing above City, but in some quarters the question of whether United have enjoyed a better season has been raised because of their cup success.", "That argument only has legs if Mikel Arteta's side never go on to achieve more, though. Arsenal have built a team capable of pushing the Premier League's most successful side all the way. United can't dream of that right now.", "Replicating a rise akin to that of Arsenal is the end goal for INEOS and Sir Jim Ratcliffe, who has set an optimistic timeline of three years to knock City off their perch.", "That will take some going considering United rode their luck this season, according to the data.", "The table based on xG has them finishing in 14th, six places lower than they actually did, with a paltry 40 points, often the target for teams hoping to avoid relegation. Things could've been a lot worse.", "Easy to play against", "Across Europe's top five leagues, with 96 teams competing, only Sheffield United - relegated to the Championship with 16 points and 104 goals shipped - conceded more shots than Manchester United over the whole season.", "Ten Hag puts this down to the injuries he has had to contend with, particularly in defence. Luke Shaw and Lisandro Martinez, the left side of a solid United defence last season, were more absent than present.", "The volume of injuries, no side in the league had more injuries resulting in a player missing one or more games (Premier Injuries), also prevented United from finding any consistency when Ten Hag was forced to make alterations.", "United used 15 different centre-back pairings this season, closing the campaign with Casemiro at the heart of defence for the final six league games. He had three separate centre-back partners in that time.", "There were signs of Casemiro finding his feet at centre-back by the end, although it was his performances in midfield that drew most criticism. Ten Hag's set-up didn't help the 31-year-old.", "The chasm so often seen between United's midfield and defence was alarming. A high press with a low block? \"They defend like no team I've seen before,\" said Sky Sports' Jamie Carragher in a scathing assessment in February on Monday Night Football.", "Casemiro's time could be up at the top level and a transfer this summer has been widely mooted. On-loan midfielder Sofyan Amrabat appears unlikely to remain, either. Finding a more suitable defensive midfielder will be crucial.", "United need a player who can also bring control after recording their lowest average possession for a season since records began.", "Conceding goals", "Ten Hag defended the way his side were set up when they conceded 31 shots in a 1-1 draw at Brentford, a game United were very fortunate not to lose. \"We concede shots, but we don't concede so many goals\", he said.", "True on that occasion, but not an accurate reflection of the whole season. United have never conceded so many goals in a Premier League season. The 58 goals let in this season surpasses the year when the wheels came off for Ole Gunnar Solskjaer in 2021/22.", "Unsurprisingly, a team that ships so many goals tends to lose quite often. Ten Hag lost more games this season than any other United manager has in the Premier League era.", "They lost 14 times in the league, twice more than in 2021/22. Going further back, this is United's most league defeats since 1989/90, when they lost 16 times under Ferguson.", "It has been the nature of certain defeats which has made the season particularly painful for United. They've lost by two or more goals on nine occasions across all competitions.", "Results such as the 4-0 thrashing at Crystal Palace and being comfortably beaten 3-0 at home by Bournemouth paint a picture of a side that has the propensity to crumble.", "Reasons for optimism", "Ten Hag kept his job in part because of his work developing academy products Kobbie Mainoo and Alejandro Garnacho. The two teenagers being the match-winners in the game that may have saved his job was apt.", "Garnacho's opener was the first goal a teenager had scored in an FA Cup final since 2004. That was Cristiano Ronaldo for United against Millwall. Sir Matt Busby's, 'If you're good enough, you're old', philosophy endures at United under Ten Hag.", "The manager's faith in youth was perhaps one of the most powerful arguments for staying on. It would've felt like a case of unfinished business had he been let go.", "On top of Mainoo and Garnacho, there are a raft of promising young players coming through the academy and Ten Hag is not afraid to use them.", "Ethan Wheatley became the 250th academy player to represent United at senior level earlier this season. He is part of a cohort that just won a domestic treble at U18 level. Financial constraints could open the door for some to make the leap.", "United, of course, have had an academy player in every matchday squad since 1937. Under Ten Hag there appears to be no chance of that run, lasting more than 4,000 matches, ending anytime soon.", "Add in the likes of Rasmus Hojlund to that equation and Ten Hag is building a young core of players to develop over the next season at the very least.", "This injection of enthusiasm has been vital for Ten Hag to instil his high-energy approach - United were pressing more than ever this season.", "There have been signs of the out-of-possession work paying off - take Garnacho's goal against City when he forced an error by Josko Gvardiol. The hope is another season with the same ideas brings more consistency.", "Ten Hag's first season, which secured a third-place finish and success in the Carabao Cup, provides more room for optimism. For now, he's been given the benefit of the doubt that he can deliver when not dealing with an injury crisis."]}