{"title": "COVID-19 lockdowns temporarily raised global temperatures", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["The lockdowns and reduced societal activity related to the COVID-19 pandemic affected emissions of pollutants in ways that slightly warmed the planet for several months last year, according to a new study by the National Center for Atmospheric Research (NCAR).", "The counterintuitive finding highlights the influence of airborne particles, or aerosols, that block incoming sunlight. When emissions of aerosols dropped last spring, more of the Sun’s warmth reached the planet, especially in heavily industrialized nations, such as the United States and Russia, that normally pump high amounts of aerosols into the atmosphere.", "“There was a big decline in emissions from the most polluting industries, and that had immediate, short-term effects on temperatures,” said NCAR scientist Andrew Gettelman, the study’s lead author. “Pollution cools the planet, so it makes sense that pollution reductions would warm the planet.”", "Temperatures over parts of Earth’s land surface last spring were about 0.2-0.5 degrees Fahrenheit (0.1-0.3 degrees Celsius) warmer than would have been expected with prevailing weather conditions, the study found. The effect was most pronounced in regions that normally are associated with substantial emissions of aerosols, with the warming reaching about 0.7 degrees F (0.37 C) over much of the United States and Russia.", "The new study highlights the complex and often conflicting influences of different types of emissions from power plants, motor vehicles, industrial facilities, and other sources. While aerosols tend to brighten clouds and reflect heat from the Sun back into space, carbon dioxide and other greenhouse gases have the opposite effect, trapping heat near the planet’s surface and elevating temperatures.", "Despite the short-term warming effects, Gettelman emphasized that the long-term impact of the pandemic may be to slightly slow climate change because of reduced emissions of carbon dioxide, which lingers in the atmosphere for decades and has a more gradual influence on climate. In contrast, aerosols – the focus of the new study – have a more immediate impact that fades away within a few years.", "The study was published in Geophysical Research Letters. It was funded in part by the National Science Foundation, NCAR’s sponsor. In addition to NCAR scientists, the study was co-authored by scientists at Oxford University, Imperial College, and the University of Leeds.", "Teasing out the impacts", "Although scientists have long been able to quantify the warming impacts of carbon dioxide, the climatic influence of various types of aerosols – including sulfates, nitrates, black carbon, and dust – has been more difficult to pin down. One of the major challenges for projecting the extent of future climate change is estimating the extent to which society will continue to emit aerosols in the future and the influence of the different types of aerosols on clouds and temperature.", "To conduct the research, Gettelman and his co-authors used two of the world’s leading climate models: the NCAR-based Community Earth System Model and a model known as ECHAM-HAMMOZ, which was developed by a consortium of European nations. They ran simulations on both models, adjusting emissions of aerosols and incorporating actual meteorological conditions in 2020, such as winds.", "This approach enabled them to identify the impact of reduced emissions on temperature changes that were too small to tease out in actual observations, where they could be obscured by the variability in atmospheric conditions.", "The results showed that the warming effect was strongest in the mid and upper latitudes of the Northern Hemisphere. The effect was mixed in the tropics and comparatively minor in much of the Southern Hemisphere, where aerosol emissions are not as pervasive.", "Gettelman said the study will help scientists better understand the influence of various types of aerosols in different atmospheric conditions, helping to inform efforts to minimize climate change. Although the research illustrates how aerosols counter the warming influence of greenhouse gases, he emphasized that emitting more of them into the lower atmosphere is not a viable strategy for slowing climate change.", "“Aerosol emissions have major health ramifications,” he said. “Saying we should pollute is not practical.”"]}