{"title": "Pat Angerer named color analyst for Iowa football", "timestamp": "\"2024-06-11 00:00:00\"", "content": ["IOWA CITY — Former University of Iowa All-America linebacker Pat Angerer has been named the color analyst for the Iowa football program, it was announced Monday by Hawkeye Sports Properties, the locally based team of Learfield, the media and technology company powering college athletics.", "Angerer will join the Voice of the Hawkeyes Gary Dolphin in the booth beginning Aug. 31 in the season opener against Illinois State inside Kinnick Stadium.", "“I would like to thank Learfield and the University of Iowa for this amazing opportunity,” said Angerer. “Since the beginning of this process, they have been nothing but professional and gracious. I am incredibly honored to be a small part of a program that has been so good to me and teammates over the years.", "“Ed (Podolak) and Gary (Dolphin) have been a huge part of my Hawkeye football experience as a player and fan, and I hope that I can do them, the university, the football program, and the fans justice. I plan to take the same passion I had as a player to the booth.”", "Angerer played for the Hawkeyes from 2005-09, where he compiled 258 tackles, including 11.5 tackles for loss, two sacks, and six interceptions. The Bettendorf, Iowa, native was a member of four bowl teams — 2005 Outback, 2006 Alamo, 2008 Outback, 2009 Orange — during his Iowa career.", "“Pat’s passion for Hawkeye football has been evident from the moment he set foot on campus nearly 15 years ago,” said Moon Family Head Football Coach Kirk Ferentz. “He was the heartbeat of our team throughout his career, and I am confident that he will do a great job on the air.”", "As a senior in 2009, Angerer earned first-team All-America honors by the Football Writers Association of America and Phil Steele’s College Football, while being a second-team All-American by Walter Camp and the Associated Press. He was also a finalist for the Bronko Nagurski Award.", "Angerer led the Big Ten in tackles, averaging 12.8 stops per contest in league games (and he was second in all games at 11.2 tackles per game). He was a first-team All-Big Ten selection after leading Iowa to an 11-2 record (6-2 in Big Ten) and an Orange Bowl victory over Georgia Tech. The team finished the season ranked seventh nationally.", "After two seasons as a reserve linebacker, Angerer burst onto the scene in 2008, earning second-team All-Big Ten honors. He led the team with 107 tackles during a season in which he was named the Big Ten Defensive Player of the Week following a victory over Wisconsin.", "Following his Hawkeye career, Angerer was selected with the 63rd pick in the 2010 NFL Draft by the Indianapolis Colts. He played four seasons in Indy, where he accumulated 328 career tackles, 2.5 sacks, 14 tackles for loss, four forced fumbles and two interceptions.", "Angerer, who was named to PFWA and The Sporting News All-Rookie teams in 2010, was a member of two playoff teams (2010, 2012) during his NFL career.", "“We are excited to welcome Pat to the Hawkeye Radio Network,” said Gabe Aguirre, Vice President & General Manager of Hawkeye Sports Properties. “In his playing days, he brought passion and energy to every game day and we have no doubt he will do the same as our color analyst. It’s never easy replacing a legend, but I think Pat is the perfect fit to join Gary in the booth, given his experience in college and the NFL and his love for the Hawkeyes.”", "Angerer currently resides in Bettendorf with his wife Mary Beth, who he proposed to following the Orange Bowl victory in 2009. The couple has three children — sons Cael and Emmett and daughter Avery."]}