{"title": "6 new restaurants open in metro-east, plus updates on other planned businesses", "timestamp": "\"2024-06-10 05:30:00\"", "content": ["It’s been a while since I took one of my road trips around the area to see what new developments I could find.", "It was worth the trip, and I have a sampling (mostly photos) of the progress being made in the 618, including some restaurants that are now open.", "Most of these are updates from earlier stories, with one new item.", "Here’s what I have for you:", "Fairview Heights", "Things are moving along in Fairview Heights with the construction of a Starbucks and relocation of Burlington and Golf Galaxy from Marketplace Shopping Center.", "Starbucks should open later this year. I’m still on the lookout for updates on Burlington and Golf galaxy and left a message for Dallas Alley, director of land use & development for Fairview Heights.", "O’Fallon", "A new Starbucks location is currently under construction as part of O’Fallon’s Southview Plaza development.", "This new Starbucks will join other area locations that include 1126 Central Park Drive, 1411 W. Highway 50 in O’Fallon and 3400 Green Mount Crossing Drive (inside Target) in Shiloh.", "Zaza Nails & Spa will open a new location in the former O’Charley’s Restaurant & Bar in O’Fallon.", "The property was sold to Zaza Nails & Spa Inc. in October, according to county records.", "The salon has an existing Glen Carbon location. For info about the business, visit zazanailspaglencarbon.com or facebook.com/zazanailsandspa.", "Dunkin’, 1755 Frank Scott Parkway East", "If you wondered about the big patch of dirt between Burger King and Popeyes on Frank Scott Parkway East, I can tell you that this is the future site of a new Dunkin’ location.", "The new location is owned by siblings Sim Patel and Krishna Patel, who also own the Fairview Heights store and more than 40 others in four states.", "Dunkin in O’Fallon is slated to open later this year.", "Shiloh", "The new Auffenberg Hyundai facility is under construction on Frank Scott Parkway East in Shiloh, across from the Auffenberg Dealer Group, which moved from O’Fallon to Shiloh in 2022.", "Belleville", "Construction continues at the new O’Reilly Auto Parts on Carlyle Plaza Drive in the former Schnucks, which closed in March 2019.", "Dollar Tree at 656 Carlyle Ave. is still closed for a remodel project that started in February.", "Workers are removing an interior wall between two suites to provide around 5,900 more square feet of space for the existing store.", "Just before the remodel started, Carlyle Plaza developer Alex Apter said the Dollar Tree expansion would likely take 3-4 months to complete.", "A message left for Apter regarding both the Dollar Tree and O’Reilly Auto Parts projects was not immediately returned.", "I’m also awaiting a response from Dollar Tree about the Carlyle Avenue store.", "Hungry? These places are now open", "If you haven’t tried them yet, or if you missed them, here are some restaurants that are now open in the metro-east.", "Chaos Sushi Bar & Grill, 126 E. Main St., Belleville. Hours: 11 a.m. to 1 a.m. Tuesday-Sunday. 618-416-1000 or facebook.com/profile.php?id=100091581854397.", "Maya, 106 E. Main St., Belleville. Current hours: 8 a.m. to 7 p.m. Tuesday-Sunday. 618-416-1246 or facebook.com/profile.php?id=61558885017561.", "Smoke & Kettle by David Sandusky, 5420 Old Collinsville Road (KC Club and Event Center), O’Fallon. Hours: 4-8 p.m. Wednesday-Sunday. 618-972-5749 or smokeandkettle.com. A second location is coming soon to Catholic War Veterans, 3535 S. Route 159, Freeburg, between Belleville and Smithton.", "Wahaka Margarita Bar and Grill, 1405 N. Green Mount Road, O’Fallon. Hours: 11 a.m. to 9:30 p.m. Monday-Wednesday, 11 a.m to 10:30 p.m. Thursday-Saturday, 11 a.m. to 9 p.m. Sunday. 618-726-7146 or wahakamargaritabar.com.", "Los Amigos Belleville, 2630 Mascoutah Ave., Belleville. Hours: 11 a.m. to 9 p.m. Sunday-Thursday, 11 a.m. to 10 p.m. Friday-Saturday. 618-416-1942 or losamigosbelleville.com.", "American Kolache, 521 W. Highway 50, O’Fallon. Hours: 6 a.m. to 2 p.m. Monday-Saturday, 7 a.m. to 2 p.m. Sunday. 618-589-3235 or ofallonil.stlkolache.com.", "* * *", "What new developments are you seeing in your community? Share your comments and questions by sending an email to newsroom@bnd.com with the subject line: Business News."]}