{"title": "Photos: The world’s displaced population equivalent to 12th largest country", "timestamp": "\"2024-06-13 00:00:00\"", "content": ["A report by the United Nations refugee agency says forced displacement surged to historic new levels across the globe last year.", "Some 120 million people were displaced globally due to wars and conflicts, the UNHCR’s flagship Global Trends Report published on Thursday said.", "The figure would make the global displaced population equivalent to the 12th largest country in the world, about the size of Japan.", "“One hundred and twenty million is a pretty high figure and also very significant,” said Filippo Grandi, the UN high commissioner for refugees.", "“Most regrettably, it is the 12th consecutive year in which this figure goes up. Behind these stark and rising numbers lie countless human tragedies. That suffering must galvanise the international community to act urgently to tackle the root causes of forced displacement,” added Grandi.", "Recent situations in Sudan, Gaza, the Democratic Republic of the Congo (DRC) and Myanmar are also creating new displacements.", "At the end of 2023, 10.8 million Sudanese remained uprooted, while UNRWA estimates at that time said 1.7 million people had been displaced in the Gaza Strip due to Israeli attacks – 75 percent of the Strip’s population. Syria remains the world’s largest displacement crisis, with 13.8 million forcibly displaced in and outside the country.", "The largest increase in displacement came from people fleeing conflicts in their own countries, rising to 68.3 million people – up almost 50 percent over five years.", "The number of refugees in need of international protection climbed to 43.4 million, the vast majority of them being hosted in countries neighbouring their own, with 75 percent residing in low and middle-income countries that together produce less than 20 percent of the world’s income.", "The UNHCR warned that without better cooperation and concerted efforts to address the conflicts, human rights violations and the climate crisis, displacement figures will keep rising, bringing more misery and costly humanitarian responses."]}