{"title": "Domino’s prioritizes product innovation", "timestamp": "\"2024-06-14 08:10:00\"", "content": ["ANN ARBOR, MICH. — Product innovation is a top priority at pizza chain Domino’s, Sandeep Reddy, executive vice president and chief financial officer, told participants during the Oppenheimer Consumer Growth and E-Commerce Conference held June 10.", "“Newness and freshness on the menu is very important, to continue to keep excitement high from a consumer perspective,” Reddy said.", "Some of Domino’s product innovations that Reddy discussed include the pepperoni stuffed cheesy bread from 2023 and the New York style pizza that debuted earlier this year. The pepperoni stuffed cheesy bread was a renovation of an existing item, while the New York style pizza was developed in response to a specific request for a crust that was foldable, Reddy said.", "Discussing the pizza chain’s evolving strategy to new product innovation, Reddy said Domino’s will take items off the menu because it wants to retain “operational complexity” in stores.", "“We’ve done that in the past, and we may do that in the future as well,” he said. “Just to make sure they deliver newness and just proliferate. And we don’t have a lot of waste building into the menu as we go through this to maximize franchisee profitability again.”", "He also discussed how marketing and deals with other companies such as Uber Eats will impact its goal of at least 3% mix of sales by the end of this year.", "“And I think the 3% mix was an important milestone to set for investors to understand what the expected cadence was going to be,” Reddy said. “And what I would say is if you go and look at the launch quarter was Q4 where we initially started, we had a 0.4% mix in Q4, we ended up with a 1.4% mix in Q1. And we did say we’re going to build steadily as we continue to ramp up the marketing toward the 3% exit rate at the end of the year.", "“And we feel that we’re on track. I mean that all the plans that we had in the beginning of the launch period, we are actually seeing it materialize. And I think as we go along, we will actually evaluate how things are going and what tweaks to make, if any. But what I would say is the 3% was more a mix input that we provided to investors to help everybody to model and think about it, but really what’s most fundamental to our story is the algorithm.”", "Reddy went on to discuss how retail sales growth and operating income growth factor into this 3% mix goal.", "“We may focus on 7% retail sales growth at 8% operating income growth and how the 3% mix plays into that is good but it’s less relevant than they are going to mature at 10% retail sales growth, 8% operating income growth and we’ll continue to toggle that,” Reddy said."]}