{"title": "Protein study could help researchers develop new antibiotics", "timestamp": "\"2024-06-10 09:00:00\"", "content": ["A bacterial enzyme called histidine kinase is a promising target for new classes of antibiotics. However, it has been difficult to develop drugs that target this enzyme, because it is a “hydrophobic” protein that loses its structure once removed from its normal location in the cell membrane.", "Now, an MIT-led team has found a way to make the enzyme water-soluble, which could make it possible to rapidly screen potential drugs that might interfere with its functions.", "The researchers created their new version of histidine kinase by replacing four specific hydrophobic amino acids with three hydrophilic ones. Even after this significant shift, they found that the water-soluble version of the enzyme retained its natural functions.", "No existing antibiotics target histidine kinase, so drugs that disrupt these functions could represent a new class of antibiotics. Such drug candidates are badly needed to combat the growing problem of antibiotic resistance.", "“Each year, more than 1 million people die from antibiotic-resistant infections,” says Shuguang Zhang, a principal research scientist in the MIT Media Lab and one of the senior authors of the new study. “This protein is a good target because it’s unique to bacteria and humans don’t have it.”", "Ping Xu and Fei Tao, both professors at Shanghai Jiao Tong University, are also senior authors of the paper, which appears today in Nature Communications. Mengke Li, a graduate student at Shanghai Jiao Tong University and a former visiting student at MIT, is the lead author of the paper.", "A new drug target", "Many of the proteins that perform critical cell functions are embedded in the cell membrane. The segments of these proteins that span the membrane are hydrophobic, which allows them to associate with the lipids that make up the membrane. However, once removed from the membrane, these proteins tend to lose their structure, which makes it difficult to study them or to screen for drugs that might interfere with them.", "In 2018, Zhang and his colleagues devised a simple way to convert these proteins into water-soluble versions, which maintain their structure in water. Their technique is known as the QTY code, for the letters that represent the hydrophilic amino acids that become incorporated into the proteins. Leucine (L) becomes glutamine (Q), isoleucine (I) and valine (V) become threonine (T), and phenylalanine (F) becomes tyrosine (Y).", "Since then, the researchers have demonstrated this technique on a variety of hydrophobic proteins, including antibodies, cytokine receptors, and transporters. Those transporters include a protein that cancer cells use to pump chemotherapy drugs out of the cells, as well as transporters that brain cells use to move dopamine and serotonin into or out of cells.", "In the new study, the team set out to demonstrate, for the first time, that the QTY code could be used to create water-soluble enzymes that retain their enzymatic function.", "The research team chose to focus on histidine kinase in part because of its potential as an antibiotic target. Currently most antibiotics work by damaging bacterial cell walls or interfering with the synthesis of ribosomes, the cell organelles that manufacture proteins. None of them target histidine kinase, an important bacterial protein that regulates processes such as antibiotic resistance and cell-to-cell communication.", "Histidine kinase can perform four different functions, including phosphorylation (activating other proteins by adding a phosphate group to them) and dephosphorylation (removing phosphates). Human cells also have kinases, but they act on amino acids other than histidine, so drugs that block histidine kinase would likely not have any effect on human cells.", "After using the QTY code to convert histidine kinase to a water-soluble form, the researchers tested all four of its functions and found that the protein was still able to perform them. This means that this protein could be used in high-throughput screens to rapidly test whether potential drug compounds interfere with any of those functions.", "A stable structure", "Using AlphaFold, an artificial intelligence program that can predict protein structures, the researchers generated a structure for their new protein and used molecular dynamics simulations to investigate how it interacts with water. They found that the protein forms stabilizing hydrogen bonds with water, which help it keep its structure.", "They also found that if they only replaced the buried hydrophobic amino acids in the transmembrane segment, the protein would not retain its function. The hydrophobic amino acids have to be replaced throughout the transmembrane segment, which helps the molecule maintain the structural relationships it needs to function normally.", "Zhang now plans to try this approach on methane monooxygenase, an enzyme found in bacteria that can convert methane into methanol. A water-soluble version of this enzyme could be sprayed at sites of methane release, such as barns where cows live, or thawing permafrost, helping to remove a large chunk of methane, a greenhouse gas, from the atmosphere.", "“If we can use the same tool, the QTY code, on methane monooxygenase, and use that enzyme to convert methane into methanol, that could deaccelerate climate change,” Zhang says.", "The QTY technique could also help scientists learn more about how signals are carried by transmembrane proteins, says William DeGrado, a professor of pharmaceutical chemistry at the University of California at San Francisco, who was not involved in the study.", "“It is a great advance to be able to make functionally relevant, water-solubilized proteins,” DeGrado says. “An important question is how signals are transmitted across membranes, and this work provides a new way to approach that question.”", "The research was funded, in part, by the National Natural Science Foundation of China."]}