{"title": "Lamborghini Revuelto: the first super sports V12 hybrid HPEV", "timestamp": "\"2024-06-11 00:00:00\"", "content": ["In the marque’s 60th anniversary year, Automobili Lamborghini presents Revuelto, the first super sports V12 hybrid plug-in HPEV (High Performance Electrified Vehicle). Revuelto defines a new paradigm in terms of performance, sportiness and driving pleasure from its unprecedented new architecture; innovative design; maximum-efficiency aerodynamics; and a new carbon frame concept. An output of 1015 CV is delivered from the combined power of an entirely new combustion engine together with three electric motors, alongside a double-clutch gearbox that makes its debut on a 12-cylinder Lamborghini for the first time.", "The powertrain combines high specific power elements: the new 127 CV/liter combustion engine works synergically with two front axial flux motors that deliver an outstanding weight-to-power ratio, with a radial flux electric motor positioned above the first eight-speed double-clutch gearbox debuting on a 12-cylinder Lamborghini. The three electric motors are powered by a lithium-ion high specific power (4500 W/kg) battery pack that also supports a fully-electric drive mode.", "Revuelto brings the future of Lamborghini design to the road today. It stays constant to the exclusive Lamborghini design DNA but establishes an entirely new stylistic language. It links with the iconic and legendary Lamborghini V12 cars of the past throughout the new shape, while the new proportions open the door towards the future. With the Revuelto, Lamborghini launches a new Space Race, ushering in a design language that adapts to the challenges imposed by electrification, and presaging the shapes and proportions of super sports cars of the near future. The design is inspired by aerospace elements, characterized by sculpted surfaces encompassed by two lines that start from the front and embrace the cabin and engine, tapering down to the hexagonal-shaped exhausts.", "Carbon fiber, produced via artisan craftmanship in the Sant’Agata Bolognese factory, is the principal structural element within the new car, used not only in the monofuselage and frame but also for many elements of the bodywork.The extensive use of carbon fiber and lightweight materials, combined with the potent engine power, contributes to achieving the best weight-to-power ratio in the history of Lamborghini: 1,75 kg/CV.", "“With Revuelto we take the experience of driving a Lamborghini to a superior level,” said Rouven Mohr, Lamborghini Chief Technical Officer. “Revuelto takes a significant step forward in terms of reactivity and responsiveness to ensure the most emotive and natural driving in every environment. Revuelto is a car delivering the highest performance but our objective right from the start was to confirm it at the very summit of driving emotions.”", "Lamborghini’s tyre partner for Revuelto is Bridgestone, which developed bespoke Potenza Sport tyres to enhance the new car’s sporty and high-speed capabilities. The premium high-performance Potenza Sport tyres are available as mixed fitment with 265/35 ZRF20 on the front axle and 345/30 ZRF21 on the rear axle, as well as with 265/30 ZRF21 on the front and 355/25 ZRF22 on the rear, both featuring run-flat technology. This technology supports drivers to continue driving safely even after a puncture; for at least 80km at 80kph with 0-bar pressure for drivers’ additional peace of mind.", "The Revuelto offers a completely new Human Machine Interface (HMI) system consisting of three displays: a 12.3' instrument cluster, 8.4' central display, and in addition a 9.1' display. The system has a fresh look and feel, with 3D graphics, animations, widgets and styling. The three displays are managed by one technological ‘brain’ within a unified design, ensuring both a consistent user interface in terms of colors and graphics, as well as coherent interaction across all displays.", "The new Revuelto infotainment system offers new functions that allow personalization and customization to create an authentic, immersive Lamborghini experience.", "The vehicle is equipped with 5 years “Manutenzione originale” that is a maintenance plan of 5 years or 75.000 km (46.000 mls) that covers all the planned standard services required to maintain the car in perfect condition. With this program Lamborghini underlines the attention to its customers and the excellence of its services.", "The Lamborghini Revuelto is also offered with a standard genuine warranty for a period of 3 years and with a standard warranty coverage of the High Voltage battery for a period of 8 years or 160.000 km (100.000 mls).", "Discover Revuelto >"]}