{"title": "Downtown Debuting New Science and Tech Building", "timestamp": "\"2024-09-04 13:30:00\"", "content": ["Thousands of students are returning to college classes across the Houston region in the coming weeks. For science and technology students at the University of Houston-Downtown, the new school year brings with it a brand new College of Science & Technology building.", "The university’s newest academic facility includes nearly 30 laboratories for teaching and research, high tech classrooms and meeting/study spaces . Officials say the $73 million building is also sustainable one as the University of Houston System’s only LEED Gold-certified building, rated for its energy-saving design and sustainable features, which include solar panels that’ll power two environment labs and air conditioning flow creating condensation into a 6,000 gallon cistern, providing water for the building’s urban gardens.", "“The College of Sciences & Technology Building will be a center for academic exploration and a catalyst for community collaborations,” said UHD President, Dr. Juan Sánchez Muñoz. “Its labs and learning spaces will elevate UHD’s ability to prepare the next generation of Houston’s scientists and innovators. The facility also will serve as a place where Houstonians can gather to address issues affecting our city and to learn how UHD is leading positive change in the region. It’s a major addition to our campus and an incredible asset to Houston.”", "Houston is a top U.S. city for STEM grads and engineering talent with more than 300,000 educated millennials and 240,000 STEM workers. STEM talent powers some of the largest industries in Houston, from energy to life science and manufacturing.", "Houston also offers these UHD and other STEM students a top-tier job market. According to the American Enterprise Institute’s Housing Center, Houston is the second best U.S. metro area for STEM workers.", "Technology, in particular, is thriving. According to the Partnership's most recent edition of Houston Facts, with more than 223,000 tech workers, Houston has the 12th largest tech sector in the U.S. Nearly two-thirds of Houston’s high-tech workers are employed in industries other than computers and software."]}