{"title": "Justice Alito, in secret recording, agrees nation needs to return to place of 'godliness'", "timestamp": "\"2024-06-11 14:34:00\"", "content": ["Supreme Court Justice Samuel Alito and Chief Justice John Roberts had no comment Tuesday after a woman posing as a conservative Catholic allegedly secretly recorded them at a black-tie event last week.", "Lauren Windsor -- seeking out the justices at the Supreme Court Historical Society's annual gala -- apparently attempted to engage them in the nation's culture wars.", "At one point, the liberal filmmaker started a conversation with Justice Alito, a well-known staunch conservative on the court.", "She posted what appears to be edited audio of that exchange on X, detailed in an account first published by Rolling Stone.", "ABC News has not authenticated the audio.", "In one exchange, Windsor poses a leading question to Alito, suggesting that there can be no compromise between the right and the left.", "Alito appears to agree, saying there are fundamental differences that are difficult to resolve.", "In the edited recording, Windsor keeps pushing Alito, saying, \"people in this country who believe in God have got to keep fighting for that, to return our country to a place of godliness.\"", "Alito responds, saying, \"I agree with you, I agree with you.\"", "Windsor also posted an exchange with Chief Justice Roberts, a moderate conservative, at the same event, in which she suggests to him that America is a Christian nation.", "Roberts pushes back, saying, \"Yeah. I don't know that we live in a Christian nation. I know a lot of Jewish and Muslim friends who would say, maybe not. And it's not our job to do that. It's our job to decide the cases as best we can.\"", "The Supreme Court Historical Society on Tuesday condemned the surreptitious recording of Roberts and Alito at the private gala, where Windsor said tickets cost $500 each.", "\"The Annual Dinner of the Supreme Court Historical Society is an occasion to recognize and support the educational and historical work of the Society over the last year. Society members are allowed to purchase two tickets, one for themselves and one for a guest,\" James C. Defer, the society's executive director, said in a statement.", "\"Our policy is to ensure that all attendees, including the Justices, are treated with respect. We condemn the surreptitious recording of Justices at the event, which is inconsistent with the entire spirit of the evening. Attendees are advised that discussion of current cases, cases decided by this Court, or a Justice's jurisprudence is strictly prohibited and may result in forfeiture of membership in the Society,\" he said.", "ABC News has reached out to the chambers of the chief justice, Justice Alito and the court itself and received no response.", "The secret recording controversy comes as the court prepares to release more than a dozen major decisions in the next three weeks and remains under close public scrutiny for its ethical practices and transparency.", "Martha-Ann Alito also secretly recorded after flag controversies", "Windsor also apparently sought out Alito's wife, Martha-Ann, at the event.", "Their conversation appeared focused on the flag controversies that have engulfed the couple in recent weeks. The incidents, first reported by the New York Times, included an upside-down American flag outside their Virginia home in 2021 and an \"Appeal to Heaven\" flag at their beach house in 2023 -- both symbols carried by some rioters who attacked the U.S. Capitol on Jan. 6.", "Alito, in a letter to Democratic lawmakers rejecting their request he recuse himself from certain cases, said he was not involved in the incidents and asked his wife to take down the upside-down flag at their Virginia home but she refused. Alito also contended his wife wasn't conscious of the \"Appeal to Heaven\" flag's connections to Jan. 6 or the \"Stop the Steal\" movement.", "In the edited clips that were posted to X, Windsor approached Martha-Ann Alito at the event and seemingly expressed sympathy for \"everything that you're going through\" and that it \"was \"not okay.\"", "\"It's okay because if they come back to me, I'll get them,\" Martha-Ann Alito said, referring to the news media. \"I'm gonna be liberated, and I'm gonna get them.\"", "Martha-Ann Alito then went on to criticize media coverage of herself, saying she was \"denigrated early on.\"", "Windsor then turned the conversation to the stir caused by the \"Appeal to Heaven\" flag, to which Martha-Ann Alito said the \"feminazis believe that [Justice Alito] should control me.\"", "\"So, they'll go to hell, he never controls me,\" she added.", "Later in the conversation, Martha-Ann Alito signaled she was deferring to her husband by not flying a flag to counter a LGBTQ Pride flag she said was flying -- apparently near their vacation home in New Jersey.", "\"I want a Sacred Heart of Jesus flag because I have to look across the lagoon at the Pride flag for the next month,\" Martha-Ann Alito told Windsor.", "\"And he's like, 'Oh, please don't put up a flag.' I said, I won't do it because I'm deferring to you,\" she is heard saying. \"But when you are free of this nonsense, I'm putting it up and I'm gonna send them a message every day, maybe every week. I'll be changing the flags. They'll be all kinds.\"", "Martha-Ann Alito also has declined to comment on the controversial recordings."]}