{"title": "Norway baseball punches ticket to state title game", "timestamp": "\"2024-06-15 00:00:00\"", "content": ["EAST LANSING — Tied at two with two outs in the bottom of the sixth inning, the Norway varsity team headed to the batter’s box looking to take control of the MHSAA Division 4 state semifinals on Friday in East Lansing.", "After senior Ian Popp reached on a single to center field, stole second and made it to third on a Cardinal Mooney Catholic error, sophomore Cameron Varda stepped up to the dish.", "“I was rounding (second) and he said to keep going, I thought Varda put it in play,” Popp said. “Right when I’m about to stand up, he goes, ‘Slide, slide, slide.’ So I just got down. I had no idea where the ball was, but it all worked out very well.”", "Varda sent the third pitch he faced to left field, bringing Popp home to give the Knights a 3-2 advantage.", "Owen Baij slammed the door on the Cardinals in the bottom of the seventh and Norway secured its spot in the Division 4 state title game on Saturday.", "“I was just trying to throw strikes, make them hit the ball and let my team do the other work,” Owen Baij said.", "Although things were tight throughout, Norway head coach Tony Adams was expecting that type of contest.", "“It’s exactly the way it needed to play out,” coach Adams said. “We needed to be in a tight ball game. We learned, in the first inning, that their best pitcher, we’ve seen. So any sort of fear, if there was any, was gone.”", "The Knights face Beal City at 1:30 p.m. Central standard time at Drayton McLane Stadium in East Lansing. The Aggies are the reigning champions in Division 4.", "“I was told we’re the second team ever from the U.P. to make the championship game,” coach Adams said. So, we’re on Cloud 9 and we’re looking forward to taking a shot at Beal City.”", "Junior Cole Baij picked up the win on the mound for Norway. He struck out three in six innings of work while surrendering four hits and an earned run.", "“First one wasn’t on him and that happens. But that’s Cole (Baij),” coach Adams said. “He does not lose his composure. He battled through six against a team that is a good hitting team. They don’t chase the ball and our defense held up.”", "Owen Baij picked up the save. He struck out one in one inning on the bump.", "“It was a little tougher, I mean, the strike zone just keeps shrinking every week,” Cole Baij said. “I just battled through it. I went to many pitches on a couple of kids … And then my brother came in and saved the day.”", "Cardinal Mooney Catholic looked to be threatening at the start of the seventh inning, however, senior Hayden Amundson made a spectacular catch, on a shallow fly ball, in the outfield to help secure the win.", "“That ball, honestly, didn’t think it was catchable,” Amundson said. “I ran up and realized it was last minute, made the catch. Honestly, I was hoping all three of those last outs would go to me.”", "He caught six fly balls in the game.", "“I was hoping for something more exciting, they just hit them right at me for the most part,” Hayden Amundson said. “The whole time I was sitting there, in my mind, I begged them to hit it to me. Anything I can do to help the defense.”", "The Cardinals took advantage of a Norway error in the bottom of the first inning to open the scoring. However, they only got one run across and they held a 1-0 advantage.", "Norway responded in the next half inning, using back-to-back walks to score Maddex Burklund. Owen Baij drove in run in the frame as well and the Knights held a 2-1 lead.", "“It’s really easy, we don’t ask our kids to be perfect, we just ask them to present and they’ve been present,” coach Adams said.", "Cardinal Mooney Catholic tied the game at two in the bottom of the fourth, on a wild pitch. However, that was the last run the Cardinals would muster.", "“Going into this game, we kind of had a normal mood,” Amundson said, “Just another game. But as it went on, nearing the end there, I was pretty hyped. I was like, ‘Oh my God. We’re going to the state championship.”", "Not only are the Knights in the final game, they’re looking to get it done for their senior teammates.", "“They’re great teammates, great friends and we want to win it for them,” Cole Baij said about Norway’s seniors.", "But, that doesn’t mean the seniors aren’t just as invested.", "“It’s just such an amazing feeling that everybody on our team wants it as bad as we do,” Popp said.", "Offensively, Norway received contributions from multiple players. Varda, Landon Amundson and Owen Baij each tallied one RBI. Owen Baij and Alex Ortman had two hits apiece while Cole Baij, Varda, Bryce Adams, Burklund and Popp each had one. Varda, Landon Amundson and Burklund each drew a free pass while Varda joined Adams with one stolen base."]}