{"title": "Brian Greene Popularizes Science for the Public", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["Brian Greene, physicist and mathematician, is widely recognized for his groundbreaking discoveries in the field of superstring theory. He has been a professor at Columbia University since 1996. Greene is also the co-founder of the World Science Festival, an annual New York City event that aims to make complex scientific concepts accessible to the public—as well as fun.", "The weeklong Festival, launched in 2008 by Greene and his wife, Tracy Day, a four-time Emmy Award-winning journalist, takes place this year May 28-June 2, when over a hundred thousand people are expected to descend on venues throughout the five boroughs to take part in thought-provoking conversations, interactive installations, musical performances, salons and outdoor activities. Programming ranges from debates on such topics as the ethics of genetically engineered babies and the promise of psychedelics, to family activities, such as stargazing at the Brooklyn Bridge and exploring marine life in city waterways.", "“We’re in an era that none of us ever thought that we would see, in which there is blatant disregard for facts about how the world works,” Greene said. “And it’s vital that we have voices, organizations and activities that inform, inspire and celebrate the power of science and prepare the public to engage with its implications for the future.”", "Columbia News sat down with Greene to discuss the importance of communicating science, the World Science Festival and his work at Columbia.", "Q. What inspired you and Tracy Day to launch the Festival? How has it grown in the last decade?", "A. Tracy is a former broadcast journalist who spent her career distilling politics and world affairs for a broad audience. We realized that those very same storytelling techniques could be applied to bring science to the public. Our motivation was largely the recognition that there’s a great public hunger for the ideas of science, but only if those ideas are presented in a way that captures the drama of discovery. In the early years, we had about 120,000 attendees during the course of the festival. Now, we typically get 175,00 to 200,000. We’ve made a conscious effort not to increase the size of the festival. Most of our ticketed programs sell out, and the free outdoor events are packed. But to go beyond the 60 to 70 events each year would likely result in a decrease in quality.", "Q. How has the production of the Festival changed over the years?", "A. When we started back in 2008, Tracy and I worked out of our son’s bedroom; today the World Science Festival is a nonprofit organization that employs more than 30 people. Another change is that in 2016 we expanded our work to Australia, where we partner with the Queensland Museum and the Queensland government to produce each March, the World Science Festival Brisbane.", "Q. How does your work at Columbia intersect with the Festival?", "A. My work at Columbia is part of a spectrum of activities that go from trying to figure out new ideas and new truths about reality through physics research to educating students and the public about these concepts and theories. The festival headquarters are just a block away from my office on the Morningside Campus, and a number of Columbia students have volunteered or interned with us. We also host events at the University; for example, on May 30 as part of the festival, we are offering an all-day workshop at the Columbia Center for Theoretical Physics on new theories and probes of dark matter. This event is for postdocs, graduate and undergraduate students, and well-informed members of the public. The festival also has a new initiative called World Science Scholars, aimed at the most talented high school math students in the world, which involves mentors that were themselves math prodigies. We anticipate the program will involve some Columbia faculty.", "Q. What are the highlights of World Science Festival 2019?", "A. This year celebrates the 100th anniversary of the confirmation of Einstein’s general theory of relativity, and at our opening gala May 22 at Jazz at Lincoln Center we premiered a theatrical production that brings to life the story of Einstein’s electrifying discovery. The production, Light Falls: Space, Time, and an Obsession of Einstein, airs May 29 on PBS. [Tune-in for PBS Night Falls] We also have wonderful programs spanning space travel, genetic engineering, dark matter, psychedelics and, well, so many topics that you should check out the listings on worldsciencefestival.com.", "Q. Tell us a bit about your path to science.", "A. I grew up on 81st Street across the street from the Hayden Planetarium. My dad was a composer and vocal coach who was interested in big ideas and taught me to look at the world in different ways. He also taught me the basics of mathematics, which set me on a path I have been following ever since. I went to Stuyvesant High School, here in the city, on to Harvard and then, for graduate studies at Oxford as a Rhodes Scholar. At that time, a new theory purporting to give us what might be the deepest understanding of the physical universe, called string theory, had just come to light. I had the great opportunity to start working in this field at such an early stage of its development. It was enormously exciting. We would work 12, sometimes 14-hour days as we sought to unravel some of the mathematical complexities of string theory.", "Q. Finally, we can’t end this interview without asking you to tell us, in a few sentences, what is superstring theory?"]}