{"title": "Warning on air pollution-related deaths, plus other top health stories", "timestamp": "\"2024-06-10 17:59:00\"", "content": ["Jun 10, 2024", "In other health news: 'major increase' in sexually transmitted infections and new research on colorectal cancer. Image: Reuters/Amr Abdallah Dalsh", "This article is part of: Centre for Health and Healthcare", "This global round-up brings you health stories from the past fortnight.", "Top health news: Air pollution-related deaths rising; 'major increase' in sexually transmitted infections; new research on colorectal cancer.", "1. Air pollution a No 1 health risk", "Air pollution has been called the “greatest single environmental health risk” by a new report, which says deaths from cardiovascular conditions caused by air pollution have been rising for a decade and will continue to rise.", "The 2024 World Heart Report says air pollution has been shown to have damaging effects on most organs of the body, and that global rates of death caused by heart conditions, diabetes and obesity due to air pollution increased significantly in the past decade.", "Air quality levels have shown little improvement despite measures recommended by the World Health Organization (WHO), it says. This has led to as many as 1.9 million people die every year from heart disease and just under a million from strokes due to outdoor air pollution alone.", "The global cost of health damages associated with exposure to air pollution is equivalent to 6.1% of the global GDP, the World Bank estimates.", "The report says millions of deaths from heart disease could be prevented by governments taking urgent action to tackle air pollution, including improving the amount of reliable data available through pollution monitoring and modelling.", "2. WHO report: Sexually transmitted infections rising", "A new report from the World Health Organization has highlighted a “major increase in sexually transmitted infections (STIs)”.", "Globally, HIV, hepatitis and STIs cause 2.5 millions deaths each year and STIs are increasing in many regions, the WHO says. Cases of adult syphilis, for example, rose by 1 million in 2022, with the highest increases in the Americas and Africa. The organization has also observed large rises in gonorrhea in around 10% of countries surveyed for antimicrobial resistance to the infection. Around 1.2 million new hepatitis B cases and nearly 1 million new hepatitis C cases were recorded in 2022.", "“We have the tools required to end these epidemics as public health threats by 2030,” WHO Director-General Tedros Adhanom Ghebreyesus said in a news release. “But we now need to ensure that, in the context of an increasingly complex world, countries do all they can to achieve the ambitious targets they set themselves.”", "3. News in brief: Health stories from around the world", "Diagnoses of colorectal cancer among those younger than 50 years old are increasing globally, and people are often missing the warning signs, according to new research. Blood in the stool, abdominal pain, altered bowel habits, and unexplained weight loss are the most common symptoms in people diagnosed with early onset colorectal cancer, it says.", "More than 60% of adults in the US will have cardiovascular disease by 2050, according to new predictions from the American Heart Association (AMA). The large number of people with or who will develop high blood pressure is the biggest driver of the trend.", "Discover", "What is the World Economic Forum doing to improve healthcare systems?", "The Global Health and Strategic Outlook 2023 highlighted that there will be an estimated shortage of 10 million healthcare workers worldwide by 2030.", "The World Economic Forum’s Centre for Health and Healthcare works with governments and businesses to build more resilient, efficient and equitable healthcare systems that embrace new technologies.", "Learn more about our impact:", "Global vaccine delivery: Our contribution to COVAX resulted in the delivery of over 1 billion COVID-19 vaccines and our efforts in launching Gavi, the Vaccine Alliance, has helped save more than 13 million lives over the past 20 years.", "Davos Alzheimer's Collaborative: Through this collaborative initiative, we are working to accelerate progress in the discovery, testing and delivery of interventions for Alzheimer's – building a cohort of 1 million people living with the disease who provide real-world data to researchers worldwide.", "Mental health policy: In partnership with Deloitte, we developed a comprehensive toolkit to assist lawmakers in crafting effective policies related to technology for mental health.", "Global Coalition for Value in Healthcare: We are fostering a sustainable and equitable healthcare industry by launching innovative healthcare hubs to address ineffective spending on global health. In the Netherlands, for example, it has provided care for more than 3,000 patients with type 1 diabetes and enrolled 69 healthcare providers who supported 50,000 mothers in Sub-Saharan Africa.", "UHC2030 Private Sector Constituency: This collaboration with 30 diverse stakeholders plays a crucial role in advocating for universal health coverage and emphasizing the private sector's potential to contribute to achieving this ambitious goal.", "Want to know more about our centre’s impact or get involved? Contact us.", "Researchers are working on light-based and pharmaceutical interventions to help tackle a global rise in short-sightedness. According to an article in Nature, more outdoor activities in childhood, when changes in eye structure are most likely to occur, is already identified by research as a solution – but in reality this is difficult to achieve for many families.", "Introducing children to smooth peanut butter during infancy can help protect against peanut allergies later in life. A UK study associated starting peanut consumption in infancy (as a pureed paste) and continuing regularly to around five years old, with a 71% reduced rate of peanut allergy among adolescents.", "UK doctors say an at-home saliva test could be better at identifying men who are at higher risk of prostate cancer. While the research has not yet been published in a specialist journal, the National Health Service trust that conducted it hopes the findings could “turn the tide on prostate cancer”.", "4. More on health from our blog", "Super-agers are people in their 80s who have the episodic memory of a much younger person. New research looks into the brain’s grey and white matter to find out why.", "Climate anxiety is on the rise globally, compounding with the mental health crisis among our youth. This article looks at some of the ways we can tackle it.", "Employee mental health and well-being is significantly influenced by factors including working environment and stress, which affects performance and productivity and has a substantial global economic cost. Read more about how leadership is crucial to creating mental-health-friendly workplaces.", "Loading...", "Don't miss any update on this topic", "Create a free account and access your personalized content collection with our latest publications and analyses.", "Sign up for free", "License and Republishing", "World Economic Forum articles may be republished in accordance with the Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License, and in accordance with our Terms of Use.", "The views expressed in this article are those of the author alone and not the World Economic Forum.", "More on Health and Healthcare Systems", "See all"]}