{"title": "Michael Cauble - Sports Director", "timestamp": "\"2024-06-14 00:00:00\"", "content": ["Michael Cauble is the Sports Director for WBRZ News 2. He joined the WBRZ team as a sports intern in September 1997.", "Michael's father was in the Air Force, so he lived all over the world. He was born in Bitburg, Germany. As a child, Michael lived in Phoenix, Arizona and Washington, D.C. He attended high school in Ramstein, Germany. Michael graduated from LSU in 1998 with a Bachelor of Arts in Mass Communication with a concentration in journalism and a minor in history.", "Michael's love for broadcasting began in high school, when he was an anchor for his school's morning announcements on closed-circuit television. \"I feel lucky to wake up in the morning and live every man's dream job,\" he says, having found a way to combine his interests in broadcasting and sports.", "After finishing his one-year internship at WBRZ while attending LSU, Michael began working in the Operations Department. He quickly made the jump into the news department, and then he rose to news editor. Later, Michael became the night side assignment editor. In May of 2000, Michael realized a lifelong dream and began his career in the sports department as a reporter and photographer. Just four years later after watching LSU's football team win the national championship, he was promoted to Sports Director. In 2009, The Associated Press awarded Michael 3rd place honors for Best Sportscast. In 2008, he was awarded 2nd place in the category. In 2012, The Associated Press awarded Michael the top honor of Best Sportscast.", "Michael resides in Baton Rouge. When not covering sports, Michael likes to unwind by watching movies and working in his yard. He also enjoys anything relating to LSU sports, especially Tiger football and baseball. On October 15, 2009, he married Lori Cauble and now has one stepdaughter. He planned the wedding around an open date for LSU. On April 11, 2011, Michael and Lori's family added one additional member when Jaxson Cauble, their new son, was born.", "Facebook:MichaelCauble", "Twitter:@Cauble"]}