{"title": "Sports news roundup: Highlands coach steps down, college offers and more", "timestamp": "\"2024-06-12 00:00:00\"", "content": ["Sports news never stops in Northern Kentucky and we never rest. News is coming quickly on several fronts. Coaching news around the clock. College offers are rapidly accumulating. All-star games are taking place. It’s all here in the fastest 1,000 words in sports.", "LONGTIME HIGHLANDS COACH STEPS DOWN", "Brian Alessandro has stepped down as Highlands cross country and girls track and field coach. He’s been coaching at Highlands for more than 20 years. Alessandro, a 1998 Highlands graduate, is striking a new work-life balance as his children get older. As a teacher and coach, he made sure other people’s children reached their potential. A Highlands Middle School teacher, his first season at Highlands was as an assistant for cross country in 2002.", "Alessandro has been head coach of the Highlands boys and girls cross country teams since 2012. That same year he became head coach of the girls track and field team. Alessandro’s Highlands teams won 20 regional championships and nine state titles. Counting relay runners, he coached nearly 30 individual state champions in cross country and track and field. Alessandro was a cross country and track and field competitor at Highlands where he also excelled at soccer. He also ran at Northern Kentucky University", "EAST SNAPS LOSING STREAK TO WEST", "The East beat the West, 28-17, in the Tom Potter All-Star football game at Rice Mountjoy Stadium at Dixie Heights. The annual contest for seniors is part of the St. Elizabeth Healthcare All-Star Series at Dixie. The game operates under the direction of the Northern Kentucky Football Coaches Association. The East, coached by Bellevue’s Chad Montgomery, rallied for the win.", "The East trailed by 10 and were down 17-14 at halftime. East quarterback Kolton Smith is this year’s game MVP. The Thomas More commit threw three touchdowns passes, two in the second half. The East snapped a West three-game winning streak in the series. It’s the East’s first win since 2019 and just the second in nine years. There was no game in 2020.", "At halftime, 20 football players were recipients of $500 scholarships. They included Smith’s NewCath teammate Demetrick Welch, who is heading to Thomas More. Two other future Thomas More players received $500 scholarships, Beechwood’s Xavier Campbell and Conner’s Elian Ruzindana.", "COLLEGE OFFERS", "Ryle 13-year-old Jayden McClain has added a women’s college basketball offer from Florida State following an unofficial visit. McClain, an eighth grader next season, totaled 44 points and 54 rebounds as a seventh grader. The 6-foot-5 post player has a handful of Division I offers including from Kentucky. She also has offers from Xavier, Ohio State, Mississippi State and Pittsburgh. Cincinnati provided her first verbal offer last October.", "Holy Cross rising sophomore Max Hunt has received a college football offer from Kentucky. The brother of Holy Cross star Julia Hunt, the two-way lineman caught 11 passes for 113 yards in 2023. He did that as a freshman tight end. He had 23 tackles, five tackles for loss and three sacks on defense.", "Covington Catholic two-way lineman Mason Dietz, a rising senior, received his first college football offer from Wittenberg University. One of two returning starters on the Colonels’ offensive line, Dietz is a 6-foot-2, 265-pound player.", "BEARCATS FOOTBALL MOVING FORWARD", "New Walton-Verona head football coach Greg Pence is putting the finishing touches on his coaching staff. The selection process is winding down with interviews. Walton-Verona hired a new middle school head football coach Monday, according to the school district. First middle school practice is Thursday.", "The Bearcats’ varsity held its first practices under Pence last week. The offense is going multiple in Pence’s first season. Gone is the hybrid Wing-T, long a staple of the Bearcats offense under previous coach Jeff Barth. The Walton-Verona defense is switching to a 4-2-5 base, Pence said. Everything goes into the playbook this month.", "NKU WOMEN SIGN ANOTHER BASKETBALL PLAYER", "The NKU women’s basketball team has added another player and injected some international flavor to the roster. Kamora Morgan, a native of Canada, comes to the Norse from Fort Erie International Academy. The school is in the Ontario Scholastic Basketball Association. Along with IUPUI transfer Abby Wolterman, Morgan represents the first two signings for new head coach Jeff Hans. From Oshawa, Ontario, Morgan averaged 11.7 points per game this past season. She added 5.3 rebounds, 2.1 steals, 1.7 assists and nearly a block a game.", "Morgan is a selectee for the All Canadian Senior Showcase all-star game. She is one of 24 seniors in the contest from throughout Canada. She’s an invitee to participate in tryouts for Team Canada. She’s with the team for the rest of the week and will await a final roster decision. With that, Morgan has a chance to become NKU’s first women’s basketball player to represent her country in international play.", "NKU MEN ADD BASKETBALL ASSISTANT", "R.J. Evans is a new NKU men’s basketball assistant coach. He comes to NKU after five years as an assistant at the College of Holy Cross. Evans’ involvement included on-court coaching, practice planning, opponent scouting, player development, game planning and recruiting. He’s familiar with coach Darrin Horn and his assistants after being on staff at Texas from 2015-17.", "Evans also had stints as an assistant at North Carolina-Asheville and Louisville. He began his coaching career as an assistant at Nichols College in 2014. He is a 2012 graduate of Holy Cross, where he scored 1,200 points in his career. Evans played a post-graduate season at Connecticut in 2012-13. He later played professionally in England for a year.", "SPEED READS", "Calvary Christian baseball player Connor Rossiter has committed to Kentucky Christian University. An infielder, outfielder and pitcher as a senior, Rossiter hit .367 with eight doubles, 31 RBI and 17 steals. He made 12 appearances on the mound with five starts and finished with a 4-2 record and a 3.05 ERA.", "Former Beechwood football and baseball standout Tanner Jackson has switched sports at the college level. Jackson, a 2022 Beechwood graduate, began his college career as a Kentucky Wesleyan football player. He then transferred to Georgetown College. But the 6-foot-4, 250-pound tight end is transferring to Cincinnati-Clermont to play baseball. Jackson is a 2022 9th Region baseball tournament MVP after recovering from knee surgery earlier that season. He starred for two regional baseball champions at Beechwood. He played on two Beechwood state championship football teams"]}