{"title": "Derick Dillard Shares Love Story with Jill Duggar", "timestamp": "\"2024-06-14 00:00:00\"", "content": ["It is no secret that Derick and Jill Dillard of 19 Kids and Counting are crazy in love with each other, and now that they just had their first son Israel David, whom they have nicknamed Baby Dilly, the couple's love is surely stronger than ever.", "As his wife was carrying the baby in her belly, Derick shared their love story on the Dillard Family blog and told the show's fans how he met \"the girl of my dreams.\"", "Both Derick and Jill live in Arkansas, but they never really met. Derick credits Jill's father Jim Bob for bringing them together, since Jim Bob became his prayer partner while he was out doing missionary work in Nepal, and it was Jim Bob who first noticed how well his daughter and Derick might get along.", "Jim Bob would often say how much in common he has with Jill, and Jim Bob would tell the same thing to Jill. Naturally, the two were quite intrigued with each other even though they have never met.", "\"Being that we had similar life goals, she caught my attention,\" said Derick.", "Their first conversation was actually in March 2013 and it was very brief and polite, recalled Derick. But in August, Jim Bob gave Derick Jill's phone number and the two started talking in earnest.", "\"Over the next few months we became very grateful for modern technology as we continued to get to know each other better. Most of our conversations were centered around our values and life goals,\" shared Derick.", "And in November, Jim Bob and Jill even flew to Nepal and Derick felt very excited to finally be talking to Jill face to face. He really did not know what to expect, but was hoping for the best.", "\"I prayed that God would give clear direction during this time,\" revealed Derick. \"By the end of the trip I felt the Lord directing me to ask Jill to officially begin a courtship relationship.\"", "He asked Jill, and she happily agreed, so they continued getting to know one another through e-mails and Skype conversations, since Derick still had two months left before his term in Nepal ends.", "When he finally moved back home to Arkansas back in January 2014, the lovers were very excited to reunite. Derick finally met the rest of the Duggar clan and months after, he asked Jill for her hand in marriage."]}