{"title": "Slideshow: New menu items from Wendy’s, First Watch and Applebee’s", "timestamp": "\"2024-06-14 12:15:00\"", "content": ["KANSAS CITY — Seasonal innovation is on tap at foodservice restaurants with new limited-time offerings brightening up menus.", "Wendy’s is adding a Triple Berry Frosty for a limited time. The summer-inspired frozen dessert combines strawberries, blackberries and raspberries and has a balance of “sweet and tart notes,” according to the company.", "\"The Triple Berry Frosty is the next iteration of summertime Frosty innovation, combining three fruit flavors into one bright and beautiful Frosty,\" said John Li, global vice president of culinary innovation at The Wendy's Company. \"A spoonful of this Frosty is like walking through the farmers market in the middle of summer and sampling fresh berry preserves.\"", "First Watch is adding its new limited-time menu, which features seasonal additions such as sweet corn, strawberries, blueberries and watermelon. New menu items, which are available until August 11, include shishito brisket hash, carnitas breakfast quesadilla, strawberry tres leches french toast, blueberry lemon cornbread and watermelon wake-up juice, which features a blend of watermelon, pineapple, lime and mint.", "\"Summer is the season of bright, bold flavors, which is exactly what we're going for with our newest recipes full of fresh twists on classic staples,\" said Shane Schaibly, senior vice president of culinary strategy at First Watch. \"From baking sweet blueberries into our cornbread, sprinkling shishito peppers into a breakfast hash and transforming our fan-favorite watermelon wake-up juice into a refreshing cocktail, these seasonal touches will redefine your summertime brunch outing.\"", "Applebee’s is adding a breaded chicken sandwich to its menus, which can be ordered three ways. The breaded chicken sandwich comes in these options: a bacon ranch crispy chicken sandwich, a sweet-and-spicy crispy chicken sandwich and a bacon crispy chicken sandwich.", "“Get ready to fall in love with our gold-standard, new hand-breaded chicken sandwiches,” said chef Shannon Johnson, head of culinary at Applebee’s. “Big, bold, juicy — and crispy — these chicken sandwiches are packed with flavor and available in three delicious iterations, sure to satisfy all our guests’ cravings. Plus, if you loved our whole lotta bacon burger, be sure to try our new bacon cheddar crispy chicken sandwich to get your tangy bacon sauce fix.”"]}