{"title": "Cartoon Brew", "timestamp": "\"2024-06-10 14:08:46\"", "content": ["Latest", "Feature Film", "Paramount Animation Reveals Five New Original Films In Development", "The announcement comes after Paramount Pictures CEO Brian Robbins said last year that the studio was moving away from original feature animation.", "Anime", "‘Neon Genesis Evangelion’ Studio Gainax Files For Bankruptcy", "After years of mismanagement, the 40-year-old Japanese studio has ceased operation.", "Presented by Netflix", "Exploring The Unique Production Process Of Netflix’s Stunning ‘Blue Eye Samurai’ (Exclusive Video)", "Watch a conversation with ‘Blue Eye Samurai’ supervising director and producer Jane Wu and production designer Toby Wilson.", "Feature Film", "How ‘Ultra-Man: Rising’ Found A Fresh Take On Tokusatsu And Kaiju Genres", "Shannon Tindle and John Aoshima discuss their roles as director and co-director of the new Netflix feature ‘Ultraman: Rising.’", "Documentary", "Pharrell Williams Lego Biopic ‘Piece By Piece’ Is A Gamechanger For Animated Documentary", "Focus Features has released the first trailer for the film, which is due out October 11.", "Feature Film", "Netflix Animation Upfront: Over 30 New Series And Features Teased For 2024 And 2025", "Netflix revealed new details today about its massive upcoming slate of animation.", "Feature Film", "Chilean Studio Punkrobot Debuts Teaser For ‘Brave Cat’ Feature", "The studio won the Oscar in 2016 for its animated short ‘Bear Story.’", "Animators", "‘Big Hero 6’ And ‘Raya And The Last Dragon’ Director Don Hall Moves To Skydance Animation", "Another key figure from Walt Disney Animation Studios has joined John Lasseter-led Skydance.", "Business", "Paramount And Skydance Are Nearing A Merger Deal", "The deal is valued around $8 billion.", "Events", "Annecy: Adult Swim To Premiere ‘Common Side Effects,’ New Show From ‘Scavengers Reign’ Co-Creator", "‘Primal’ creator Genndy Tartakovsky and ‘Smiling Freinds’ co-creators Zach Hadel and Michael Cusack will also speak at Annecy."]}