{"title": "Arlington America This Week w/ Eric Bolling", "timestamp": "\"2024-06-13 23:26:50\"", "content": ["hace 3 años", "America This Week 'United We Stand': Giroir on vaccines, at-home testing", "WASHINGTON (SBG) — States across the country are working to immunize people with Pfizer’s coronavirus vaccine. The pandemic is raging across the country, but vaccines from Pfizer and Moderna are providing a glimmer of hope that an end is in...", "hace 3 años", "'America This Week': Giuliani on Hunter Biden probe; Parscale on Trump post-White House", "WASHINGTON (SBG) — \"America This Week\" host Eric Bolling discussed the Justice Department's investigation of Hunter Biden with President Donald Trump's personal attorney Rudy Giuliani and Peter Schweizer, president of the Government Accountability Institute. Also on the program, former campaign...", "hace 4 años", "America This Week 'United We Stand': Great Britain's milestone vaccination program", "WASHINGTON (SBG) – Infectious disease doctor Dena Grayson joined \"America This Week\" host Eric Bolling to discuss Great Britain's milestone efforts to vaccinate the public against COVID-19 and the recently-approved Pfizer-Biotech shots. Caption: \"America This Week: United We Stand\" Dec...", "hace 4 años", "'America This Week': COVID lockdown hypocrisy; Grenell on US rep's ties to Chinese spy", "WASHINGTON (SBG) — \"America This Week,\" host Eric Bolling tackled the impact of the coronavirus restrictions on small businesses with Angela Mardsen, a Los Angeles restaurant owner who spoke out against California lockdown orders. Caption: Video: Sinclair Broadcast Group Also...", "hace 4 años", "America This Week 'United We Stand': What's next with the vaccine", "WASHINGTON (SBG) — Experts in the fight against the COVID-19 pandemic joined America This Week \"United We Stand\" host Eric Bolling to discuss the virus that has rattled the world. Appearing on the program this week were White House Coronavirus...", "hace 4 años", "'America This Week w/Eric Bolling' features Rudy Giuliani, K.T. McFarland", "WASHINGTON (SBG) — \"America This Week,\" host Eric Bolling sat down with Rudy Giuliani, personal attorney to President Donald Trump, to discuss his ongoing claims of election fraud. Bolling also spoke with former deputy national security adviser K. T. McFarland...", "hace 4 años", "America This Week 'United We Stand' w/Eric Bolling", "WASHINGTON (SBG) – Join America This Week \"United We Stand\" w/ Eric Bolling for an in-depth look at the the issues dividing our country, the race for the White House and the coronavirus pandemic. Caption: America This Week 'United We..."]}