{"title": "Caitlin Clark's controversial treatment in WNBA sparks differing reactions from Diana Taurasi, Geno Auriemma", "timestamp": "\"2024-06-10 19:52:42\"", "content": ["Instead of the Connecticut Sun's red-hot start or A'ja Wilson's early dominance, the prevailing conversation about the WNBA thus far this season has seemed to be focused on one rookie -- Caitlin Clark -- and the rest of the league's treatment of her.", "WNBA veteran Diana Taurasi came under scrutiny for saying Clark would have a transition period when she entered the WNBA. Earlier in the year, WNBA legend and Naismith Basketball Hall of Famer Sheryl Swoopes also received public backlash for saying more of the same.", "Despite these players' observations, a sector of fans has weaponized the comments to the point where women's basketball players and coaches across the game are chiming in.", "\"You have to really focus on doing your research, and that's for everyone,\" Taurasi told CBS Sports.", "Taurasi is the latest player to add her voice to the chorus. She joins players like Aces forward Alysha Clark, Storm forward Nneka Ogwumike and her Phoenix teammate Natasha Cloud -- to name a few -- who want newer WNBA fans to respect and appreciate the players in the league and the level of competition required to compete night after night.", "Although Taurasi hadn't heard the comments her former UConn coach Geno Auriemma made about \"delusional\" fans directly, she does feel there is a base level of knowledge often missing from the prevailing WNBA debates this season.", "\"Players, fans, reporters -- just do your research,\" Taurasi said. \"Gather the facts. I think we're in a day and age where anything that is said is taken for a fact or that's the way it is, and I think we just got to make sure we know who's good at basketball and who's not.\"", "Auriemma was more pointed with his comments.", "\"The delusional fan base that follows [Caitlin Clark] disrespected the WNBA players by saying she's gonna go in that league and tear it apart,\" Auriemma said on The Dan Patrick Show last week. \"There were actually odds on -- she's third or fourth in betting odds of being MVP in the WNBA. These people are so disrespectful and so unknowledgeable and so stupid that it gives women's basketball a bad name.\"", "Taurasi and others remind their rookies and the general public often that the WNBA has always been a physical league. The WNBA merges college players with athletes 19 years their senior, as is the case when 41-year-old Taurasi competes against 22-year-old Clark, and there is bound to be a learning curve.", "\"Entering the WNBA it's just a whole different league,\" Taurasi said. \"It's like anything, it's a different level of competition and you know, I had to get used to that.\"", "Although Caitlin Clark herself has said she's focused on basketball, there have also been moments the Iowa legend and Fever coach Christine Sides have felt the physicality has gone too far. At the top of the list is likely Chennedy Carter's hip check to Clark while the ball was out of play.", "\"It's tough, but that's just the fact of the matter,\" Clark said. \"This is a very physical game, and you're going to get pressure, this is professional basketball. It is what it is, honestly.\"", "Former Pacers guard Reggie Miller sat down with Mark Jackson on the \"Come and Talk 2 Me\" podcast and expressed that nobody should be surprised by the elite competition and physical play in the WNBA.", "\"I've known this for years because I grew up in it,\" Miller said of the WNBA's increased coverage.", "The five-time All-Star Miller is a member of the NBA 75th Anniversary team, but he self-admittedly isn't even the best basketball player in his family. His older sister and Naismith Basketball Hall of Famer Cheryl Miller never played in the WNBA due to a major injury in college, but she is regarded as one of the best to play the game.", "While Reggie Miller is glad folks are joining him in appreciation and respect for women's basketball, he isn't on board with the notion Clark is being hated on.", "\"Why are people so shocked? Right, you're playing against grown women. The same thing happened to us as rookies,\" Miller said while pointing back and forth between him and former Knicks star Mark Jackson. \"Going against [Michael Jordan] -- they're trying to embarrass you. It's nothing personal ... these are grown women.\"", "And Clark understands that.", "When asked if she felt Carter owed her an apology after their exchange, Clark responded, \"No. I mean, basketball's competitive. I get it.\"", "\"She's having a tremendous season,\" Clark added, while saying she herself has let emotions get the best of her throughout her basketball career. The Fever guard collected her third technical foul in a game against the Seattle Storm last month.", "However, there is a conversation to be had about officiating in the WNBA. The latest head-scratcher occurred last Tuesday when Chicago Sky rookie Angel Reese was ejected after being issued a double technical foul. The league rescinded the second technical Wednesday, but that did little for the 2023 NCAA champion who missed the final two minutes of the matchup against New York.", "For Taurasi, adapting to how the game is called is part of the learning curve from college to the pros.", "\"It's the way the league has been, it's a physical league,\" Taurasi said. \"That is just the way our game is set up. It's the way it's officiated. The way the rules are. I don't know it any other way.\"", "Leagues like the NBA and MLB have adjusted rules to protect players from close-outs or put outs, but regulating all contact from sports is unlikely to be successful.", "\"I know the NBA is taking huge strides and making the game a little bit more free flowing, but at the same time, you know, there's extremes to everything,\" Taurasi said. \"So I think there's a happy medium of making sure that the game is what the game is, and that's dribbling, passing, shooting, letting people be creative with the basketball. I think that's as a player that's what you want. As a fan. I'm sure that's what you want.", "\"And then at the same time, the flip side of that is, you want people to compete. That is what sports ultimately is about. And when you lose confidence of the competition, then I think you lose the confidence of the fans.\"", "What we do know is Taurasi and Clark are competitors. They will win games and they will lose games throughout their careers. And yes, they will also collect technical fouls and get into arguments with other players.", "Yet, if you ask their college or now professional teammates if they like their odds to win when Taurasi and Clark are on the court, it's not hard to imagine several would say yes, definitively."]}