{"title": "Mary Stoyanoff Petrich", "timestamp": "\"2024-06-10 14:37:01\"", "content": ["Mary Stoyanoff Petrich, a cherished matriarch, community pillar, and beacon of kindness, passed away Friday, June 7, surrounded by love and comfort. Born on July 12, 1928, to Chris and Bozana Stoyanoff, Mary’s journey began above the family-run Home Restaurant in Gary New Duluth, a place that would shape her strong sense of community and family values. Mary’s educational pursuits saw her through the halls of Stowe Elementary and Junior High, to her graduation from Morgan Park High School in the year 1945. She furthered her dedication to learning at Duluth Teachers’ College, preparing herself for a life enriched with wisdom and knowledge. Her professional life was as varied as it was impactful. From her time at the USS Cement Plant to her contributions at the Duluth Budgeteer, Mary’s work ethic was unwavering. She played a pivotal role in the success of her brother George’s ventures, from Ribbon Distributing to the Buffalo House, Buffalo Video, and Duluth Culvert, showcasing her versatility and business acumen. In September 1951, Mary united in marriage with Ed Petrich, a partnership fortified by love and mutual respect. Together, they navigated life’s highs and lows, their bond a testament to enduring companionship. Together they raised six children, instilling in them the values of family, friendship, hard work, and service to the community. Mary’s life was filled with remarkable achievements and passionate involvement. As one of the pioneering organizers of the Duluth Women’s Fast Pitch League in 1945, she demonstrated her leadership and love for sports. Her athletic prowess was further immortalized when she secured a hole-in-one at Nemadji Golf Course in 1997, and as an avid bowler, when she won the Duluth City All Events Title in 1976-triumphs that spoke to her zest for life and competition. A life-long volunteer, Mary’s generosity knew no bounds. From her involvement with the Stowe PTA to her compassionate role as a Boy Scout Den Mother, from managing finances as the Far West Little League Treasurer to her dedicated service as a Life member of the VFW Auxiliary and the American Legion Post 71 Auxiliary, her efforts were a force for good. As a volunteer with the Second Harvest Food Bank, Mary embodied the spirit of giving. Mary’s faith was a cornerstone, as evidenced by her long-standing membership with the St. George Serbian Orthodox Church and active participation in the St. George’s Sisters Kolo, where she found solace and fellowship. Mary was preceded in death by her beloved husband Ed, brothers Nuney and George, sisters Helen Stojevich and Florence Nasti, daughter-in-law Theresa, and granddaughter LaDonna. Her legacy continues through her special sister, Verna Westin, her loving children Kisty (Bill) Haller, Rita (Darrill) Erickson, Gregg, Bryan, Mark (Joy), and Jim (Diane), her adored 9 grandchildren and 12 great-grandchildren, as well as her extended family of nieces, nephews, and special friends Helen Sever and Regis Glumac. In recognition of the compassionate care provided, Mary’s family extends heartfelt gratitude to Dr. Edwall and associates at PS Rudie Medical Clinic, the nurses and staff of St. Luke’s ICU and 2nd floor, and the hospice team who offered comfort in her final days. The family also sends many thanks to those who visited with Mary in her last weeks. Mary Stoyanoff Petrich’s life was a tapestry of love, commitment, and service. Her memory will shine as a guiding light to all who were fortunate to cross her path. She will be missed, but her spirit will continue to inspire generations to come.", "Visitation will be held from 10a.m. until the funeral service at 11:00 a.m. on Tuesday, June 11, at St. George Orthodox Church, 1216 104th Ave. West. Burial in Oneota Cemetery. On Wednesday, June 12, COME CELEBRATE WITH US at 4:00 p.m. at the Buffalo Junction, 2590 Guss Road. In Mary’s memory please wear your favorite hat to her party. Arrangements by Dougherty Funeral Home. 600 E. 2nd St. Duluth, MN 55805. 218-727-3555."]}