{"title": "Ask Alma's Owl: A World of News", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["Dear J. Schooler,", "If you hang a right when you get to the third floor of Pulitzer Hall, you’ll see a floor-to-ceiling stained-glass window featuring the Statue of Liberty thrusting her torch in the air, flanked by two globes resting on clouds and framed by a pair of Corinthian columns. It adorns the World Room, named for the influential newspaper owned by Joseph Pulitzer, The New York World.", "Pulitzer, born in Hungary, was recruited to fight for the Union in the Civil War. Penniless after the war, he took many jobs and ultimately became a reporter, editor and then a publisher. He bought two newspapers in St. Louis becoming rich in the process, and in 1883 after moving to New York City, purchased the World.", "The paper’s main office, on Park Row in lower Manhattan, was built in 1890. Pulitzer had stipulated that the architect must make it “at least as good as the [New York] Times building.” Swathed in marble and topped by an 850,000-pound gold dome, it was for five years the tallest building in the city and had an observation deck that could be visited for a nickel. The stained-glass window, installed in the building’s lobby in 1908, was titled “Liberty Enlightening the World” and commemorated Pulitzer’s successful crusade years earlier to raise funds for a pedestal for the Statue of Liberty; the World raised $106,000 toward the effort.", "Pulitzer endowed Columbia’s Journalism School and the eponymous annual prizes that the University administers before he died in 1911. Decades later, the New York World Building was slated for demolition to make way for a new highway entrance to the Brooklyn Bridge, and Carl W. Ackerman, then the Journalism School’s dean, and John Hohenberg, a journalism professor, asked city officials to help move the window to Columbia.", "The Columbia Spectator reported that Mayor Robert F. Wagner presented the window to the Journalism School in 1954 at a ceremony with Columbia President Grayson Kirk. At the event, Ackerman said that Columbia would preserve the work of art “as guidance and inspiration for the journalists of today and tomorrow.”", "There is an ironic twist to the building’s history. According to Pulitzer’s biographer, James McGrath Morris, the New York World Building sat on the former lot of French’s Hotel. About a quarter century before his own building was constructed, Pulitzer, then an unemployed Civil War veteran, was thrown out of the hotel lobby “because its guests objected to seeing tattered former soldiers milling about.” Pulitzer made a triumphant return and the World Building lives on at Columbia."]}