{"title": "A Nobel Prize Winner in Physics, and More Awards", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["Columbia News produces a biweekly newsletter (subscribe here!) and article series featuring a roundup of awards and milestones that Columbia faculty, staff, and students have received in recent days. In this edition, you’ll find awards and milestones from September 22 to October 6, 2022.", "Have an award or milestone you’d like to have featured in the newsletter or article online? Please send an email to [email protected]. Note that we’ll be running this series every other week.", "You can take a look at past accomplishments on our Awards & Milestones page. And you can subscribe to receive the newsletter in your inbox.", "ALUMNI", "John F. Clauser, who received his PhD from Columbia University in 1969, was one of three scientists awarded the 2022 Nobel Prize in Physics for helping to clear “the way for new technology based upon quantum information.”", "FACULTY", "ARTS & HUMANITIES", "Farah Jasmine Griffin, William B. Ransford Professor of English and Comparative Literature and African American Studies and professor of African American and African Diaspora Studies, has received the 2022 Christian Gauss Award from the Phi Beta Kappa Society.", "SCIENCE, MEDICINE, & ENGINEERING", "Jacky Austermann, assistant professor and part of the seismology, geology, and tectonophysics division of Lamont-Doherty Earth Observatory, was named one of Science News’ 10 Scientists to Watch in 2022.", "Rita Charon, professor and chair of medical humanities and ethics, professor of medicine, and executive director of Columbia Narrative Medicine will receive the inaugural Philip Sandblom Prize in Creativity, Illness, and Health from the Grace S. Sandblom Endowment and Birgit Rausing Centre for Medical Humanities at the University of Lund, Sweden.", "Leon Chen, associate professor of nursing, was named a fellow of the American College of Critical Care Medicine.", "Vikram Gadagkar, assistant professor in the department of neuroscience at the Mortimer B. Zuckerman Mind Brain Behavior Institute; Jellert Gaublomme, assistant professor of biological sciences; Christopher D. Makinson, assistant professor of neurological sciences; and Joanna Smeeton, the H.K. Corning Assistant Professor of Rehabilitation and Regenerative Medicine Research, were awarded New Innovator Awards by the National Institutes of Health.", "The American Geophysical Union honored a number of faculty, including:", "Pierre Gentine, the Maurice Ewing and J. Lamar Worzel Professor of Geophysics in the department of earth and environmental engineering and professor of earth and environmental sciences, received AGU’s James B. Macelwane Medal.", "Dennis Kent, senior research scientist at the Climate School, has been awarded the AGU's John Adam Fleming Medal, given annually to one honoree in recognition of original research and technical leadership in geomagnetism, atmospheric electricity, aeronomy, space physics, and/or related sciences.", "Marc Spiegelman, Arthur D. Storke Memorial Professor of Earth and Environmental Sciences, professor of applied physics and applied mathematics (APAM), and chair of the APAM department at Columbia Engineering; Mingfang Ting, a research professor at the Climate School; and Spahr C. Webb, Jerome M. Paros/Lamont Research Professor at the Climate School, were named AGU Fellows.", "George Hripcsak, chair and Vivian Beaumont Allen Professor of Biomedical Informatics, is the 2022 recipient of the Morris F. Collen Award of Excellence from the American College of Medical Informatics.", "W. Ian Lipkin, John Snow Professor of Epidemiology and professor of neurology and pathology and cell biology, was selected by the Bulletin of the Atomic Scientists to join a new international task force to consider trends and oversight of high-risk pathogen research.", "Maxim Topaz, the Elizabeth Standish Gill Associate Professor of Nursing, was appointed as a standing member of the “Clinical Informatics and Digital Health Study Section” by the NIH Center for Scientific Review.", "JOURNALISM", "Gabriella Canal (JRN’21), adjunct professor at Columbia Journalism School, and Michael Fearon (JRN’21) won a Student Academy Award for their documentary Seasons from the Doc’21 cohort at Columbia Journalism School. Both Canal and Fearon were students when they entered their film in the award show.", "SOCIAL SCIENCES", "Partha Chatterjee, professor emeritus of anthropology and of Middle Eastern, South Asian and African studies, won the 2022 American Political Science Association Grain of Sand Award.", "Navin Kartik, professor in the department of economics, has been elected as a 2022 Fellow of The Econometric Society", "Natalia Pasternak Taschner, adjunct senior research scholar in the Center for Science and Society and adjunct professor of international and public affairs, was named one of The Jerusalem Post's Top 50 Most Influential Jews of 2022.", "STUDENTS", "Rosemary Cater, a postdoctoral research scientist in structural and cellular biology, was announced as a finalist for the 2022 Blavatnik Regional Awards for Young Scientists.", "Giannis Karamanolakis and Ana-Andreea Stoica were awarded the Davide Giri Memorial Prize. Established in 2022, the prize will be given annually to a graduate student in computer science who has combined excellence in research results with continued outstanding efforts to promote research collaboration. It was established in memory of Dr. Davide Giri, who promoted research collaboration in an exemplary way as part of his doctoral studies, while excelling as a researcher."]}