{"title": "School’s in on sodium reduction", "timestamp": "\"2024-06-10 12:15:00\"", "content": ["KANSAS CITY — Ingredient suppliers are optimistic about hitting sodium reduction goals set by the US Department of Agriculture for school meals. Nearly 30 million students from kindergarten through twelfth grade consume breakfast and lunch at school every day, according to the USDA.", "In April the USDA set nutrition standards for breakfast and lunch. By July 1, 2027, sodium levels need to be lowered by about 15% for lunch and about 10% for breakfast from current levels.", "Those reductions may be reached without students noticing, said Scott Keys, vice president of sales for NuTek Natural Ingredients, Omaha, which offers potassium salt, also known as potassium chloride.", "In third-party consumer sensory panels, NuTek’s potassium salt was used to reduce sodium levels between 20% and 50% in items like pizza, hot dogs, lunch meat, bread, soups, cheese sauces and condiments, he said. When compared to the full-sodium control items, the food with potassium salt achieved parity in taste, saltiness and likeability.", "“Potassium salt is a natural alternative to salt with the same functionality,” Keys said. “While potassium salt has a salty taste, it can contribute a bitter and metallic off flavor.", "“NuTek’s sodium reduction technology uses an innovative and minimal washing and drying process that eliminates the bitter metallic off-flavors, without the use of bitter-blockers, flavor modulators or synthetic additives. This enables product developers to significantly reduce the sodium and increase potassium without negatively impacting the flavor, processing, quality, or food safety of the finished product.”", "School meal items historically the highest in sodium include pizza, soups, hot dogs, sandwiches with lunch meat and breakfast sandwiches, he said, adding potassium salt has been shown to work as a 1:1 replacement for standard salt in all the formulations.", "Janice Johnson, PhD, food technical adviser for Minneapolis-based Cargill, said she agreed USDA sodium reduction goals may be achieved in school meals. She said formulators may take a stepwise reduction to help students acclimatize to any change in flavor.", "“For example, in the first year, developers could introduce an 8% reduction, then go all the way to 15% in the following year,” she said.", "Cargill offers Potassium Pro Ultrafine, a potassium salt/potassium chloride.", "“It features an extremely fine particle size, which results in quick dissolution, and our research suggests it delivers the salty taste consumers expect, without the bitter and metallic notes associated with larger potassium salt particle sizes,” Johnson said. “As an added benefit, potassium salt can be an additional source of potassium, an under-consumed nutrient that is known to counter the effect of sodium on blood pressure for individuals with pre- or hypertension.”", "Sodium limits for school meals are based on the average weekly sodium content for the plate served and are not based on a daily total, per-meal or per-food item.", "“This makes it a little more challenging for menu planners, as compared to food manufacturers, who typically follow the FDA and WHO (World Health Organization) sodium target guidelines or self-imposed targets,” Johnson said.", "Foods to consider for sodium reduction include pizza, tacos, burritos, chicken nuggets/tenders, bread/rolls, processed meats, seasoned blends for vegetables and cheese, she said.", "Reducing sodium in pizza", "Sodium may be found in various ingredients in a single school food, said Hugo Leclerq, global portfolio director for taste fermentation — sodium reduction for Kerry, which has a US office in Beloit, Wis. In pizza, sodium may be reduced in dough, cheese, tomato paste and toppings like pepperoni.", "Kerry may assist in reducing sodium in applications like sandwiches, deli meat and sauces. The company has a Tastesense system that retains flavor properties and replicates a salty impact, body and linger, according to Kerry.", "Tastesense links taste receptors (ion channels) with proprietary product chemistry, material science, salt morphology, proteolysis and fermentation. Kerry develops ingredients from natural botanical extracts, peptides and ferments (yeast and non-yeast based).", "Besides sodium reduction, the USDA in school meals addressed other items such as added sugars, whole grains and flavored milk.", "“We all share the goal of helping children reach their full potential,” said Agriculture Secretary Tom Vilsack. “Like teachers, classrooms, books, and computers, nutritious school meals are an essential part of the school environment, and when we raise the bar for school meals, it empowers our kids to achieve greater success inside and outside of the classroom.”"]}