{"title": "Eight Inspiring Startups Based on ‘Green’ Tech Out of Columbia", "timestamp": "\"2024-06-12 12:00:00\"", "content": ["Long before the Columbia Climate School was launched, scientists and engineers have sought out solutions to some of the existential crises of our time, from climate change to shortages of clean water and other natural resources. Across Columbia, they’ve proposed ingenious answers to seemingly intractable problems, and are helping to redefine what we think of as waste. Along the way, Columbia Technology Ventures and Columbia Entrepreneurship have provided help patenting and licensing ideas, and provided training and other support to bring these new tools and technologies to market. Columbia’s interdisciplinary culture has also been instrumental.", "Here are eight ways that discoveries made in the lab, field, and even a sweltering dorm room, are being translated into applications that could deliver huge benefits to people and the planet.", "AdvanceH20", "Water treatment and natural gas production", "AdvanceH20 develops tools to help wastewater treatment plants convert wastewater and raw sewage into clean water, energy, and nutrients, like nitrogen and phosphorus. The company sells an annual all-in-one plant analytics and management package to water managers worldwide. Developed in the lab of Columbia Engineering professor Kartik Chandran, the patented technologies include a system for tracking microbial DNA and RNA in plant treatment reactors so that they can be redesigned to produce more clean water, energy, and nutrients during the treatment process. Extracting resources from waste is a valuable proposition as the world’s population nears 8 billion.", "GreenOre CleanTech", "Technology for reducing carbon emissions and producing sustainable building materials from industrial waste", "The process of turning raw iron ore into steel generates enormous piles of a waste material known as slag, which contains hazardous elements damaging to human health and the environment. But slag is also teeming with valuable materials that GreenOre wants to extract while neutralizing slag’s toxicity. The technology was developed at Columbia Engineering by Alissa Park, a professor, and her former graduate student, Xiaozhou (Sean) Zhou ’15SEAS. Through their patented carbon mineralization process, slag goes in, and sustainable materials like calcium carbonate, silica, and alumina as well as rare earth elements come out. In an added bonus, planet-warming carbon dioxide is consumed as a reagent. GreenOre CleanTech is currently working with China Baotou Steel, and is planning a demo project in Wyoming with Japan Coal Energy Center. Now CEO of GreenOre, Zhou was recently picked as one of MIT Tech Review’s Innovators Under 35 Asia Pacific.", "Trident Desalination", "Clean water with a smaller carbon footprint and less waste", "A warming climate and a booming global population have led to an insatiable demand for clean water. That in turn has led to a boom in desalination plants worldwide. But removing high concentrations of salt and other compounds from water is energy-intensive and produces concentrated brine that's harmful if discharged back into the environment. A startup that emerged from Ngai Yin Yip's lab at Columbia Engineering, Trident Desalination, wants to tackle both problems at once. Trident's patented approach uses low-cost solvents and machine learning software to extract more clean water than conventional systems while producing less waste.", "Werewool", "Biodegradable textile fibers as a solution to microplastic pollution from fashion", "From lycra to polyester, synthetic fibers have transformed fashion and made clothing easier and cheaper to make. But plastic-based fibers have their own set of problems: fossil fuels are the main raw material, making synthetic clothing a major source of microplastic pollution. Werewool, a startup based on patent-pending technology developed by Theanne Schiros at Columbia Engineering, in collaboration with Allie Obermeyer and Helen Lu, offers an alternative: proteins engineered to give fabric the desired color, stretch, and UV protection.", "In addition to eliminating the need for fossil fuels, Werewool’s approach requires no toxic dyeing or finishing steps. At the end of the product’s life, Werewool fibers are designed to biodegrade and return nutrients to the soil. Read more in this essay by Schiros and Columbia collaborators Allie Obermeyer and Helen Lu in a special edition of Chem published in advance of the UN climate talks in Glasgow."]}