{"title": "Do your part—be cybersmart", "timestamp": "\"2024-06-11 00:48:32\"", "content": ["As part of National Cybersecurity Awareness Month, the University of Miami Information Technology department is participating in a national annual campaign to raise awareness about the importance of cybersecurity, which is led by a collaborative effort between government, industry, and education with the goal of ensuring that every United States resident has the resources needed to stay safe and secure online. This year's campaign—Do Your Part. #BeCyberSmart.—helps empower individuals to own their role in protecting cyberspace. The following are some tips and tools you can employ now.", "If you connect it, do your part to protect yourself and your data.", "Whether it's through an email, phone call, or malicious website, fraudulent attempts to obtain sensitive information can come from unexpected sources posing as trustworthy. Being aware of strategies that can help you protect yourself from falling victim to phishing and potential identity theft or data loss.", "Before you click, think critically about the message and request. Cybercriminals use current political and worldwide events to their advantage, often creating a sense of urgency and fear to get a victim to reveal sensitive data like credit card information. Using a strong password to log in to your device or online account is the first step to protecting your data. Before you login, find tips for developing and managing strong passwords, and learn why multifactor authentication (MFA) is crucial for protecting your information.", "Secure your devices at home and at work.", "With the University community spending more time at home to work and learn remotely, we're increasingly relying on our home networks and must take steps to ensure that the connection at home is safe and secure. Find tips on how to better secure your home network and personal devices.", "Before you post on social networks, consider the consequences of sharing your important moments and personal details through updates, photos, and videos. Widespread use of social media has become an attractive platform for exploiting or misusing personal information. With families relying on personal devices to work from home or participate in virtual learning, it’s critical to regularly check or evaluate network security in the home.", "Whether you’re physically on campus or accessing University resources remotely, make sure your devices are ready to safely connect. Before you connect, check that you’re following best practices, which include using safe and trusted networks, installing anti-virus protection, and never leaving your device unattended. At the University, students, faculty, and staff members are required to use Duo—MFA software that creates a layered defense against unauthorized access to your accounts. If you have the ability to enable this protection, it’s a good idea to have it. Learn more about Duo.", "Understand the future of connected devices.", "With the increase of greater technological innovations and the capability to connect and share data with such ease, everyone must do their part to stay secure. Find tips to understand how to protect your data and devices as we move into the future.", "Cloud storage—also known as the cloud—allows you to store data online instead of on a hard drive, which can be accessed by any device and by multiple people simultaneously. At the University, there are several cloud storage options available to students, faculty, and staff members, including Box, Google Drive, SharePoint, and OneDrive.", "Smart technology—often referred to as the Internet of Things, or IoT—is increasingly integrated into our devices, vehicles, and homes. While the possibilities they enable seem endless, there are also potential security risks posed by smart devices that can be difficult to address. Consider how smart devices are interconnected and what type of data is collected, stored, and shared to protect yourself. Learn more about managing smart technology in your life."]}